
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: AnimGraphRuntime
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: FortniteAI
/// dependency: FortniteGame
/// dependency: GameplayAbilities
/// dependency: GameplayEffectTemplates
/// dependency: IrwinRuntime
/// dependency: NavigationSystem

/// Class /Game/AI/NavAreas/FortNavArea_JumpDownSmashable3.FortNavArea_JumpDownSmashable3_C
/// Size: 0x0000 (0x000058 - 0x000058)
class UFortNavArea_JumpDownSmashable3_C : public UFortNavArea_SmashableJump
{ 
public:
};

/// Class /Game/AI/NavAreas/FortNavArea_JumpDownSmashable.FortNavArea_JumpDownSmashable_C
/// Size: 0x0000 (0x000058 - 0x000058)
class UFortNavArea_JumpDownSmashable_C : public UFortNavArea_SmashableJump
{ 
public:
};

/// Class /Game/AI/NavAreas/FortNavArea_JumpDownSmashable2.FortNavArea_JumpDownSmashable2_C
/// Size: 0x0000 (0x000058 - 0x000058)
class UFortNavArea_JumpDownSmashable2_C : public UFortNavArea_SmashableJump
{ 
public:
};

/// Class /Game/AI/AIBlueprintInterface/BPI_HuskDance.BPI_HuskDance_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UBPI_HuskDance_C : public UInterface
{ 
public:


	/// Functions
	// Function /Game/AI/AIBlueprintInterface/BPI_HuskDance.BPI_HuskDance_C.OnEndDance
	// void OnEndDance();                                                                                                    // [0x211c0a0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/AI/AIBlueprintInterface/BPI_HuskDance.BPI_HuskDance_C.OnBeginDance
	// void OnBeginDance();                                                                                                  // [0x211c0a0] Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/AI/NavAreas/FortNavArea_JumpDown.FortNavArea_JumpDown_C
/// Size: 0x0000 (0x000050 - 0x000050)
class UFortNavArea_JumpDown_C : public UFortNavArea
{ 
public:
};

/// Class /Irwin/AI/Interfaces/Fauna_Idle_AnimInterface.Fauna_Idle_AnimInterface_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UFauna_Idle_AnimInterface_C : public UAnimLayerInterface
{ 
public:


	/// Functions
	// Function /Irwin/AI/Interfaces/Fauna_Idle_AnimInterface.Fauna_Idle_AnimInterface_C.Fauna IdleTurn
	// void Fauna IdleTurn(FPoseLink InPose IdleTurn, FPoseLink& Fauna IdleTurn);                                            // [0x211c0a0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Irwin/AI/Interfaces/Fauna_Idle_AnimInterface.Fauna_Idle_AnimInterface_C.Fauna Idle
	// void Fauna Idle(FPoseLink InPose Idle, FPoseLink& Fauna Idle);                                                        // [0x211c0a0] HasOutParms|BlueprintCallable|BlueprintEvent 
};

/// Struct /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.AnimBlueprintGeneratedMutableData
/// Size: 0x0067 (0x000001 - 0x000068)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{ 
	bool                                               __BoolProperty;                                             // 0x0001   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0002   (0x0002)  MISSED
	float                                              __FloatProperty;                                            // 0x0004   (0x0004)  
	bool                                               __BoolProperty0;                                            // 0x0008   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0009   (0x0003)  MISSED
	float                                              __FloatProperty1;                                           // 0x000C   (0x0004)  
	float                                              __FloatProperty2;                                           // 0x0010   (0x0004)  
	float                                              __FloatProperty3;                                           // 0x0014   (0x0004)  
	bool                                               __BoolProperty4;                                            // 0x0018   (0x0001)  
	bool                                               __BoolProperty5;                                            // 0x0019   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x001A   (0x0002)  MISSED
	float                                              __FloatProperty6;                                           // 0x001C   (0x0004)  
	float                                              __FloatProperty7;                                           // 0x0020   (0x0004)  
	float                                              __FloatProperty8;                                           // 0x0024   (0x0004)  
	bool                                               __BoolProperty9;                                            // 0x0028   (0x0001)  
	bool                                               __BoolProperty10;                                           // 0x0029   (0x0001)  
	bool                                               __BoolProperty11;                                           // 0x002A   (0x0001)  
	bool                                               __BoolProperty12;                                           // 0x002B   (0x0001)  
	bool                                               __BoolProperty13;                                           // 0x002C   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x002D   (0x0003)  MISSED
	float                                              __FloatProperty14;                                          // 0x0030   (0x0004)  
	bool                                               __BoolProperty15;                                           // 0x0034   (0x0001)  
	unsigned char                                      UnknownData04_5[0x3];                                       // 0x0035   (0x0003)  MISSED
	float                                              __FloatProperty16;                                          // 0x0038   (0x0004)  
	float                                              __FloatProperty17;                                          // 0x003C   (0x0004)  
	bool                                               __BoolProperty18;                                           // 0x0040   (0x0001)  
	unsigned char                                      UnknownData05_5[0x3];                                       // 0x0041   (0x0003)  MISSED
	float                                              __FloatProperty19;                                          // 0x0044   (0x0004)  
	bool                                               __BoolProperty20;                                           // 0x0048   (0x0001)  
	unsigned char                                      UnknownData06_5[0x3];                                       // 0x0049   (0x0003)  MISSED
	float                                              __FloatProperty21;                                          // 0x004C   (0x0004)  
	float                                              __FloatProperty22;                                          // 0x0050   (0x0004)  
	float                                              __FloatProperty23;                                          // 0x0054   (0x0004)  
	bool                                               __BoolProperty24;                                           // 0x0058   (0x0001)  
	unsigned char                                      UnknownData07_5[0x3];                                       // 0x0059   (0x0003)  MISSED
	float                                              __FloatProperty25;                                          // 0x005C   (0x0004)  
	float                                              __FloatProperty26;                                          // 0x0060   (0x0004)  
	float                                              __FloatProperty27;                                          // 0x0064   (0x0004)  
};

/// Class /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C
/// Size: 0x4038 (0x0007C0 - 0x0047F8)
class UBurt_AnimBP_C : public UFortAIFaunaAnimInstance_Burt
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x07C0   (0x0008)  
	FAnimBlueprintGeneratedMutableData                 __AnimBlueprintMutables;                                    // 0x07C8   (0x0068)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0830   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0838   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0840   (0x0020)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose;                              // 0x0860   (0x00B0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x0910   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0958   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer0;                              // 0x09A0   (0x0048)  
	FAnimNode_Root                                     AnimGraphNode_Root1;                                        // 0x09E8   (0x0020)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose2;                             // 0x0A08   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer3;                              // 0x0AB8   (0x0048)  
	FAnimNode_Root                                     AnimGraphNode_Root4;                                        // 0x0B00   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0B20   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult5;                            // 0x0B48   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult6;                            // 0x0B70   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult7;                            // 0x0B98   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult8;                            // 0x0BC0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult9;                            // 0x0BE8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult10;                           // 0x0C10   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult11;                           // 0x0C38   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult12;                           // 0x0C60   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult13;                           // 0x0C88   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult14;                           // 0x0CB0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult15;                           // 0x0CD8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult16;                           // 0x0D00   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult17;                           // 0x0D28   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult18;                           // 0x0D50   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult19;                           // 0x0D78   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult20;                           // 0x0DA0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult21;                           // 0x0DC8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult22;                           // 0x0DF0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult23;                           // 0x0E18   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult24;                           // 0x0E40   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult25;                           // 0x0E68   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer26;                             // 0x0E90   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0ED8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer27;                             // 0x0EF8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult28;                                // 0x0F40   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer29;                             // 0x0F60   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult30;                                // 0x0FA8   (0x0020)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x0FC8   (0x0070)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive;                                // 0x1038   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer31;                             // 0x1100   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer32;                             // 0x1148   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool33;                            // 0x1190   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult34;                                // 0x11D8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer35;                             // 0x11F8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult36;                                // 0x1240   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer37;                             // 0x1260   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult38;                                // 0x12A8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer39;                             // 0x12C8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult40;                                // 0x1310   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult41;                           // 0x1330   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult42;                           // 0x1358   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer43;                             // 0x1380   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult44;                                // 0x13C8   (0x0020)  
	FAnimNode_RefPose                                  AnimGraphNode_IdentityPose;                                 // 0x13E8   (0x0010)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult45;                                // 0x13F8   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x1418   (0x00C8)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive46;                              // 0x14E0   (0x00C8)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive47;                              // 0x15A8   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer48;                           // 0x1670   (0x0070)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer49;                           // 0x16E0   (0x0070)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult50;                                // 0x1750   (0x0020)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x1770   (0x0028)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool51;                            // 0x1798   (0x0048)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x17E0   (0x00F0)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool52;                            // 0x18D0   (0x0048)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose53;                              // 0x1918   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer54;                             // 0x1940   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer55;                             // 0x1988   (0x0048)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive56;                              // 0x19D0   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer57;                           // 0x1A98   (0x0070)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult58;                                // 0x1B08   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine59;                               // 0x1B28   (0x00C8)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x1BF0   (0x0048)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x1C38   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1C58   (0x0020)  
	FAnimNode_Slot                                     AnimGraphNode_Slot60;                                       // 0x1C78   (0x0048)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x1CC0   (0x00F8)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive61;                              // 0x1DB8   (0x00C8)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult62;                           // 0x1E80   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult63;                           // 0x1EA8   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer64;                             // 0x1ED0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult65;                                // 0x1F18   (0x0020)  
	FAnimNode_RefPose                                  AnimGraphNode_IdentityPose66;                               // 0x1F38   (0x0010)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult67;                                // 0x1F48   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine68;                               // 0x1F68   (0x00C8)  
	FFortAnimNode_QuadrupedSlopeWarping                FortAnimGraphNode_QuadrupedSlopeWarping;                    // 0x2030   (0x05C8)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x25F8   (0x0008)  MISSED
	FFortAnimNode_WeightedLookAt                       FortAnimGraphNode_WeightedLookAt;                           // 0x2600   (0x0250)  
	FAnimNode_Inertialization                          AnimGraphNode_Inertialization;                              // 0x2850   (0x0118)  
	FAnimNode_LinkedAnimLayer                          AnimGraphNode_LinkedAnimLayer;                              // 0x2968   (0x00C8)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x2A30   (0x0078)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool69;                            // 0x2AA8   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer70;                             // 0x2AF0   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool71;                            // 0x2B38   (0x0048)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult72;                           // 0x2B80   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult73;                           // 0x2BA8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult74;                           // 0x2BD0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult75;                           // 0x2BF8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult76;                           // 0x2C20   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult77;                           // 0x2C48   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult78;                           // 0x2C70   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult79;                           // 0x2C98   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult80;                           // 0x2CC0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult81;                           // 0x2CE8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult82;                           // 0x2D10   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult83;                           // 0x2D38   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult84;                           // 0x2D60   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult85;                           // 0x2D88   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult86;                           // 0x2DB0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult87;                           // 0x2DD8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult88;                           // 0x2E00   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult89;                           // 0x2E28   (0x0028)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool90;                            // 0x2E50   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer91;                             // 0x2E98   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer92;                             // 0x2EE0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult93;                                // 0x2F28   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult94;                           // 0x2F48   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult95;                           // 0x2F70   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult96;                           // 0x2F98   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult97;                           // 0x2FC0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult98;                           // 0x2FE8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult99;                           // 0x3010   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult100;                          // 0x3038   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult101;                          // 0x3060   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer102;                            // 0x3088   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult103;                               // 0x30D0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer104;                            // 0x30F0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult105;                               // 0x3138   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer106;                            // 0x3158   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult107;                               // 0x31A0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer108;                            // 0x31C0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult109;                               // 0x3208   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult110;                          // 0x3228   (0x0028)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine111;                              // 0x3250   (0x00C8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult112;                               // 0x3318   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer113;                            // 0x3338   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult114;                               // 0x3380   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer115;                            // 0x33A0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult116;                               // 0x33E8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer117;                            // 0x3408   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult118;                               // 0x3450   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult119;                          // 0x3470   (0x0028)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine120;                              // 0x3498   (0x00C8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult121;                               // 0x3560   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer122;                            // 0x3580   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer123;                            // 0x35C8   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool124;                           // 0x3610   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult125;                               // 0x3658   (0x0020)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool126;                           // 0x3678   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer127;                            // 0x36C0   (0x0048)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer128;                          // 0x3708   (0x0070)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive129;                             // 0x3778   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer130;                            // 0x3840   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer131;                            // 0x3888   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool132;                           // 0x38D0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult133;                               // 0x3918   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer134;                            // 0x3938   (0x0048)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer135;                          // 0x3980   (0x0070)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive136;                             // 0x39F0   (0x00C8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool137;                           // 0x3AB8   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer138;                            // 0x3B00   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult139;                               // 0x3B48   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer140;                            // 0x3B68   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult141;                               // 0x3BB0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer142;                            // 0x3BD0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult143;                               // 0x3C18   (0x0020)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer144;                          // 0x3C38   (0x0070)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive145;                             // 0x3CA8   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer146;                            // 0x3D70   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool147;                           // 0x3DB8   (0x0048)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer148;                          // 0x3E00   (0x0070)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive149;                             // 0x3E70   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer150;                            // 0x3F38   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool151;                           // 0x3F80   (0x0048)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult152;                          // 0x3FC8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult153;                          // 0x3FF0   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer154;                            // 0x4018   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult155;                               // 0x4060   (0x0020)  
	FAnimNode_RefPose                                  AnimGraphNode_IdentityPose156;                              // 0x4080   (0x0010)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult157;                               // 0x4090   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine158;                              // 0x40B0   (0x00C8)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive159;                             // 0x4178   (0x00C8)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive160;                             // 0x4240   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer161;                          // 0x4308   (0x0070)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer162;                          // 0x4378   (0x0070)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult163;                               // 0x43E8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer164;                            // 0x4408   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult165;                               // 0x4450   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine166;                              // 0x4470   (0x00C8)  
	FAnimNode_Slot                                     AnimGraphNode_Slot167;                                      // 0x4538   (0x0048)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive168;                             // 0x4580   (0x00C8)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult169;                          // 0x4648   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult170;                          // 0x4670   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer171;                            // 0x4698   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult172;                               // 0x46E0   (0x0020)  
	FAnimNode_RefPose                                  AnimGraphNode_IdentityPose173;                              // 0x4700   (0x0010)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult174;                               // 0x4710   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine175;                              // 0x4730   (0x00C8)  


	/// Functions
	// Function /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.Fauna IdleTurn
	// void Fauna IdleTurn(FPoseLink InPose IdleTurn, FPoseLink& Fauna IdleTurn);                                            // [0x211c0a0] HasOutParms|BlueprintCallable 
	// Function /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.Fauna Idle
	// void Fauna Idle(FPoseLink InPose Idle, FPoseLink& Fauna Idle);                                                        // [0x211c0a0] HasOutParms|BlueprintCallable 
	// Function /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x211c0a0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Burt_AnimBP_AnimGraphNode_BlendSpacePlayer_2DD8FBAB4C767B0770C81BBB25A41BD3
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_Burt_AnimBP_AnimGraphNode_BlendSpacePlayer_2DD8FBAB4C767B0770C81BBB25A41BD3(); // [0x211c0a0] BlueprintEvent       
	// Function /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.AnimNotify_FallExit
	// void AnimNotify_FallExit();                                                                                           // [0x211c0a0] BlueprintCallable|BlueprintEvent 
	// Function /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.AnimNotify_LandAddExit
	// void AnimNotify_LandAddExit();                                                                                        // [0x211c0a0] BlueprintCallable|BlueprintEvent 
	// Function /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.AnimNotify_LandEnter
	// void AnimNotify_LandEnter();                                                                                          // [0x211c0a0] BlueprintCallable|BlueprintEvent 
	// Function /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.ExecuteUbergraph_Burt_AnimBP
	// void ExecuteUbergraph_Burt_AnimBP(int32_t EntryPoint);                                                                // [0x211c0a0] Final                
};

/// Class /Irwin/AI/Interfaces/Fauna_Jump_AnimInterface.Fauna_Jump_AnimInterface_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UFauna_Jump_AnimInterface_C : public UAnimLayerInterface
{ 
public:


	/// Functions
	// Function /Irwin/AI/Interfaces/Fauna_Jump_AnimInterface.Fauna_Jump_AnimInterface_C.Fauna Jump
	// void Fauna Jump(FPoseLink& Fauna Jump);                                                                               // [0x211c0a0] HasOutParms|BlueprintCallable|BlueprintEvent 
};

/// Class /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C
/// Size: 0x4888 (0x0007E0 - 0x005068)
class UGrandma_AnimBP_C : public UFortAIFaunaAnimInstance_Grandma
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x07E0   (0x0008)  
	FAnimBlueprintGeneratedMutableData                 __AnimBlueprintMutables;                                    // 0x07E8   (0x0074)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x085C   (0x0004)  MISSED
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0860   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0868   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0870   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0890   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult0;                            // 0x08B8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult1;                            // 0x08E0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult2;                            // 0x0908   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult3;                            // 0x0930   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult4;                            // 0x0958   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult5;                            // 0x0980   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x09A8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x09F0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer6;                              // 0x0A10   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult7;                                 // 0x0A58   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer8;                              // 0x0A78   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult9;                                 // 0x0AC0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer10;                             // 0x0AE0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult11;                                // 0x0B28   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x0B48   (0x00C8)  
	FAnimNode_Root                                     AnimGraphNode_Root12;                                       // 0x0C10   (0x0020)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose;                              // 0x0C30   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer13;                             // 0x0CE0   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer14;                             // 0x0D28   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x0D70   (0x0048)  
	FAnimNode_Root                                     AnimGraphNode_Root15;                                       // 0x0DB8   (0x0020)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose16;                            // 0x0DD8   (0x00B0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer17;                             // 0x0E88   (0x0048)  
	FAnimNode_Root                                     AnimGraphNode_Root18;                                       // 0x0ED0   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult19;                           // 0x0EF0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult20;                           // 0x0F18   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult21;                           // 0x0F40   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult22;                           // 0x0F68   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult23;                           // 0x0F90   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult24;                           // 0x0FB8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult25;                           // 0x0FE0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult26;                           // 0x1008   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult27;                           // 0x1030   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult28;                           // 0x1058   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult29;                           // 0x1080   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult30;                           // 0x10A8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult31;                           // 0x10D0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult32;                           // 0x10F8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult33;                           // 0x1120   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult34;                           // 0x1148   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult35;                           // 0x1170   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult36;                           // 0x1198   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult37;                           // 0x11C0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult38;                           // 0x11E8   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer39;                             // 0x1210   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult40;                                // 0x1258   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer41;                             // 0x1278   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult42;                                // 0x12C0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer43;                             // 0x12E0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult44;                                // 0x1328   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer45;                             // 0x1348   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult46;                                // 0x1390   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer47;                             // 0x13B0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult48;                                // 0x13F8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer49;                             // 0x1418   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult50;                                // 0x1460   (0x0020)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive;                                // 0x1480   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x1548   (0x0070)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool51;                            // 0x15B8   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer52;                             // 0x1600   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer53;                             // 0x1648   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult54;                                // 0x1690   (0x0020)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive55;                              // 0x16B0   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer56;                           // 0x1778   (0x0070)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult57;                           // 0x17E8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult58;                           // 0x1810   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer59;                             // 0x1838   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult60;                                // 0x1880   (0x0020)  
	FAnimNode_RefPose                                  AnimGraphNode_IdentityPose;                                 // 0x18A0   (0x0010)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult61;                                // 0x18B0   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine62;                               // 0x18D0   (0x00C8)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive63;                              // 0x1998   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer64;                           // 0x1A60   (0x0070)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult65;                                // 0x1AD0   (0x0020)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer66;                           // 0x1AF0   (0x0070)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer67;                             // 0x1B60   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer68;                             // 0x1BA8   (0x0048)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x1BF0   (0x0028)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool69;                            // 0x1C18   (0x0048)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x1C60   (0x00F0)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive70;                              // 0x1D50   (0x00C8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool71;                            // 0x1E18   (0x0048)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose72;                              // 0x1E60   (0x0028)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult73;                                // 0x1E88   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine74;                               // 0x1EA8   (0x00C8)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x1F70   (0x0048)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x1FB8   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1FD8   (0x0020)  
	FAnimNode_Slot                                     AnimGraphNode_Slot75;                                       // 0x1FF8   (0x0048)  
	FAnimNode_LegIK                                    AnimGraphNode_LegIK;                                        // 0x2040   (0x00F8)  
	FAnimNode_Slot                                     AnimGraphNode_Slot76;                                       // 0x2138   (0x0048)  
	FAnimNode_Slot                                     AnimGraphNode_Slot77;                                       // 0x2180   (0x0048)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x21C8   (0x0078)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose78;                              // 0x2240   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose79;                              // 0x2268   (0x0028)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool80;                            // 0x2290   (0x0048)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend81;                           // 0x22D8   (0x00F0)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose82;                              // 0x23C8   (0x0028)  
	FAnimNode_Slot                                     AnimGraphNode_Slot83;                                       // 0x23F0   (0x0048)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive84;                              // 0x2438   (0x00C8)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult85;                           // 0x2500   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult86;                           // 0x2528   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult87;                           // 0x2550   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult88;                           // 0x2578   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer89;                             // 0x25A0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult90;                                // 0x25E8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer91;                             // 0x2608   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult92;                                // 0x2650   (0x0020)  
	FAnimNode_RefPose                                  AnimGraphNode_IdentityPose93;                               // 0x2670   (0x0010)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult94;                                // 0x2680   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine95;                               // 0x26A0   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer96;                             // 0x2768   (0x0048)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend97;                           // 0x27B0   (0x00F0)  
	FFortAnimNode_QuadrupedSlopeWarping                FortAnimGraphNode_QuadrupedSlopeWarping;                    // 0x28A0   (0x05C8)  
	unsigned char                                      UnknownData01_5[0x8];                                       // 0x2E68   (0x0008)  MISSED
	FFortAnimNode_WeightedLookAt                       FortAnimGraphNode_WeightedLookAt;                           // 0x2E70   (0x0250)  
	FAnimNode_Inertialization                          AnimGraphNode_Inertialization;                              // 0x30C0   (0x0118)  
	FAnimNode_LinkedAnimLayer                          AnimGraphNode_LinkedAnimLayer;                              // 0x31D8   (0x00C8)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose98;                             // 0x32A0   (0x0078)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer99;                             // 0x3318   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool100;                           // 0x3360   (0x0048)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult101;                          // 0x33A8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult102;                          // 0x33D0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult103;                          // 0x33F8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult104;                          // 0x3420   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult105;                          // 0x3448   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult106;                          // 0x3470   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult107;                          // 0x3498   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult108;                          // 0x34C0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult109;                          // 0x34E8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult110;                          // 0x3510   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult111;                          // 0x3538   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult112;                          // 0x3560   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult113;                          // 0x3588   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult114;                          // 0x35B0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult115;                          // 0x35D8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult116;                          // 0x3600   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult117;                          // 0x3628   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult118;                          // 0x3650   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer119;                            // 0x3678   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer120;                            // 0x36C0   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool121;                           // 0x3708   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult122;                               // 0x3750   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer123;                            // 0x3770   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer124;                            // 0x37B8   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool125;                           // 0x3800   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult126;                               // 0x3848   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult127;                          // 0x3868   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult128;                          // 0x3890   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult129;                          // 0x38B8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult130;                          // 0x38E0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult131;                          // 0x3908   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult132;                          // 0x3930   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult133;                          // 0x3958   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult134;                          // 0x3980   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer135;                            // 0x39A8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult136;                               // 0x39F0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer137;                            // 0x3A10   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult138;                               // 0x3A58   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer139;                            // 0x3A78   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult140;                               // 0x3AC0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer141;                            // 0x3AE0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult142;                               // 0x3B28   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult143;                          // 0x3B48   (0x0028)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine144;                              // 0x3B70   (0x00C8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult145;                               // 0x3C38   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer146;                            // 0x3C58   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult147;                               // 0x3CA0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer148;                            // 0x3CC0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult149;                               // 0x3D08   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer150;                            // 0x3D28   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult151;                               // 0x3D70   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult152;                          // 0x3D90   (0x0028)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine153;                              // 0x3DB8   (0x00C8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult154;                               // 0x3E80   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer155;                            // 0x3EA0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult156;                               // 0x3EE8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer157;                            // 0x3F08   (0x0048)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive158;                             // 0x3F50   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer159;                          // 0x4018   (0x0070)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool160;                           // 0x4088   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer161;                            // 0x40D0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult162;                               // 0x4118   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer163;                            // 0x4138   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult164;                               // 0x4180   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer165;                            // 0x41A0   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool166;                           // 0x41E8   (0x0048)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive167;                             // 0x4230   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer168;                          // 0x42F8   (0x0070)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool169;                           // 0x4368   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer170;                            // 0x43B0   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer171;                            // 0x43F8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult172;                               // 0x4440   (0x0020)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive173;                             // 0x4460   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer174;                          // 0x4528   (0x0070)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer175;                            // 0x4598   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool176;                           // 0x45E0   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer177;                            // 0x4628   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool178;                           // 0x4670   (0x0048)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive179;                             // 0x46B8   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer180;                          // 0x4780   (0x0070)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive181;                             // 0x47F0   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer182;                          // 0x48B8   (0x0070)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult183;                          // 0x4928   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult184;                          // 0x4950   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer185;                            // 0x4978   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult186;                               // 0x49C0   (0x0020)  
	FAnimNode_RefPose                                  AnimGraphNode_IdentityPose187;                              // 0x49E0   (0x0010)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult188;                               // 0x49F0   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine189;                              // 0x4A10   (0x00C8)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive190;                             // 0x4AD8   (0x00C8)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer191;                          // 0x4BA0   (0x0070)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult192;                               // 0x4C10   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer193;                            // 0x4C30   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult194;                               // 0x4C78   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine195;                              // 0x4C98   (0x00C8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool196;                           // 0x4D60   (0x0048)  
	FAnimNode_Slot                                     AnimGraphNode_Slot197;                                      // 0x4DA8   (0x0048)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive198;                             // 0x4DF0   (0x00C8)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult199;                          // 0x4EB8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult200;                          // 0x4EE0   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer201;                            // 0x4F08   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult202;                               // 0x4F50   (0x0020)  
	FAnimNode_RefPose                                  AnimGraphNode_IdentityPose203;                              // 0x4F70   (0x0010)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult204;                               // 0x4F80   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine205;                              // 0x4FA0   (0x00C8)  


	/// Functions
	// Function /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.Fauna Jump
	// void Fauna Jump(FPoseLink& Fauna Jump);                                                                               // [0x211c0a0] HasOutParms|BlueprintCallable 
	// Function /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.Fauna IdleTurn
	// void Fauna IdleTurn(FPoseLink InPose IdleTurn, FPoseLink& Fauna IdleTurn);                                            // [0x211c0a0] HasOutParms|BlueprintCallable 
	// Function /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.Fauna Idle
	// void Fauna Idle(FPoseLink InPose Idle, FPoseLink& Fauna Idle);                                                        // [0x211c0a0] HasOutParms|BlueprintCallable 
	// Function /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x211c0a0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.AnimNotify_FallExit
	// void AnimNotify_FallExit();                                                                                           // [0x211c0a0] BlueprintCallable|BlueprintEvent 
	// Function /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.AnimNotify_LandAddExit
	// void AnimNotify_LandAddExit();                                                                                        // [0x211c0a0] BlueprintCallable|BlueprintEvent 
	// Function /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.AnimNotify_LandEnter
	// void AnimNotify_LandEnter();                                                                                          // [0x211c0a0] BlueprintCallable|BlueprintEvent 
	// Function /Irwin/AI/Predators/Grandma/Animations/Grandma_AnimBP.Grandma_AnimBP_C.ExecuteUbergraph_Grandma_AnimBP
	// void ExecuteUbergraph_Grandma_AnimBP(int32_t EntryPoint);                                                             // [0x211c0a0] Final                
};

/// Class /Irwin/AI/Prey/Burt/Abilities/GE_RidingSprint_PawnDmg.GE_RidingSprint_PawnDmg_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_RidingSprint_PawnDmg_C : public UGET_DirectPhysicalDamage_C
{ 
public:
};

/// Class /Irwin/AI/Prey/Burt/Abilities/GE_RidingSprint_VehicleDmg.GE_RidingSprint_VehicleDmg_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_RidingSprint_VehicleDmg_C : public UGET_DirectPhysicalDamage_C
{ 
public:
};

/// Class /Irwin/AI/Prey/Burt/Abilities/GE_NPC_Irwn_Prey_Burt_DiscoverLootCooldown.GE_NPC_Irwn_Prey_Burt_DiscoverLootCooldown_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_NPC_Irwn_Prey_Burt_DiscoverLootCooldown_C : public UGameplayEffect
{ 
public:
};

/// Struct /Irwin/AI/Prey/Burt/Animations/Burt_AnimBP.Burt_AnimBP_C.AnimBlueprintGeneratedConstantData
/// Size: 0x2727 (0x000001 - 0x002728)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0004)  
	FName                                              __NameProperty0;                                            // 0x0008   (0x0004)  
	FName                                              __NameProperty1;                                            // 0x000C   (0x0004)  
	FName                                              __NameProperty2;                                            // 0x0010   (0x0004)  
	FName                                              __NameProperty3;                                            // 0x0014   (0x0004)  
	FName                                              __NameProperty4;                                            // 0x0018   (0x0004)  
	FName                                              __NameProperty5;                                            // 0x001C   (0x0004)  
	FName                                              __NameProperty6;                                            // 0x0020   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0024   (0x0004)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0028   (0x0010)  
	FName                                              __NameProperty7;                                            // 0x0038   (0x0004)  
	FName                                              __NameProperty8;                                            // 0x003C   (0x0004)  
	TArray<float>                                      __ArrayProperty9;                                           // 0x0040   (0x0010)  
	float                                              __FloatProperty;                                            // 0x0050   (0x0004)  
	FName                                              __NameProperty10;                                           // 0x0054   (0x0004)  
	int32_t                                            __IntProperty;                                              // 0x0058   (0x0004)  
	FName                                              __NameProperty11;                                           // 0x005C   (0x0004)  
	FName                                              __NameProperty12;                                           // 0x0060   (0x0004)  
	FName                                              __NameProperty13;                                           // 0x0064   (0x0004)  
	FName                                              __NameProperty14;                                           // 0x0068   (0x0004)  
	FName                                              __NameProperty15;                                           // 0x006C   (0x0004)  
	FName                                              __NameProperty16;                                           // 0x0070   (0x0004)  
	FName                                              __NameProperty17;                                           // 0x0074   (0x0004)  
	FName                                              __NameProperty18;                                           // 0x0078   (0x0004)  
	FName                                              __NameProperty19;                                           // 0x007C   (0x0004)  
	int32_t                                            __IntProperty20;                                            // 0x0080   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x0084   (0x0004)  MISSED
	TArray<float>                                      __ArrayProperty21;                                          // 0x0088   (0x0010)  
	FName                                              __NameProperty22;                                           // 0x0098   (0x0004)  
	int32_t                                            __IntProperty23;                                            // 0x009C   (0x0004)  
	EBlendListTransitionType                           __EnumProperty;                                             // 0x00A0   (0x0001)  
	unsigned char                                      UnknownData03_5[0x7];                                       // 0x00A1   (0x0007)  MISSED
	TArray<float>                                      __ArrayProperty24;                                          // 0x00A8   (0x0010)  
	TArray<float>                                      __ArrayProperty25;                                          // 0x00B8   (0x0010)  
	FName                                              __NameProperty26;                                           // 0x00C8   (0x0004)  
	int32_t                                            __IntProperty27;                                            // 0x00CC   (0x0004)  
	FName                                              __NameProperty28;                                           // 0x00D0   (0x0004)  
	int32_t                                            __IntProperty29;                                            // 0x00D4   (0x0004)  
	FName                                              __NameProperty30;                                           // 0x00D8   (0x0004)  
	int32_t                                            __IntProperty31;                                            // 0x00DC   (0x0004)  
	FName                                              __NameProperty32;                                           // 0x00E0   (0x0004)  
	int32_t                                            __IntProperty33;                                            // 0x00E4   (0x0004)  
	TArray<float>                                      __ArrayProperty34;                                          // 0x00E8   (0x0010)  
	class UBlendProfile*                               __BlendProfile;                                             // 0x00F8   (0x0008)  
	class UCurveFloat*                                 __CurveFloat;                                               // 0x0100   (0x0008)  
	EAlphaBlendOption                                  __EnumProperty35;                                           // 0x0108   (0x0001)  
	EBlendListTransitionType                           __EnumProperty36;                                           // 0x0109   (0x0001)  
	unsigned char                                      UnknownData04_5[0x6];                                       // 0x010A   (0x0006)  MISSED
	TArray<float>                                      __ArrayProperty37;                                          // 0x0110   (0x0010)  
	EAnimSyncMethod                                    __EnumProperty38;                                           // 0x0120   (0x0001)  
	unsigned char                                      UnknownData05_5[0x3];                                       // 0x0121   (0x0003)  MISSED
	FName                                              __NameProperty39;                                           // 0x0124   (0x0004)  
	FName                                              __NameProperty40;                                           // 0x0128   (0x0004)  
	FName                                              __NameProperty41;                                           // 0x012C   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0130   (0x0001)  
	unsigned char                                      UnknownData06_5[0x3];                                       // 0x0131   (0x0003)  MISSED
	float                                              __FloatProperty42;                                          // 0x0134   (0x0004)  
	FInputScaleBiasClampConstants                      __StructProperty;                                           // 0x0138   (0x002C)  
	float                                              __FloatProperty43;                                          // 0x0164   (0x0004)  
	bool                                               __BoolProperty44;                                           // 0x0168   (0x0001)  
	EAnimSyncMethod                                    __EnumProperty45;                                           // 0x0169   (0x0001)  
	SDK_UNDEFINED(1,9324) /* TEnumAsByte<EAnimGroupRole> */ __um(__ByteProperty);                                  // 0x016A   (0x0001)  
	unsigned char                                      UnknownData07_5[0x1];                                       // 0x016B   (0x0001)  MISSED
	FName                                              __NameProperty46;                                           // 0x016C   (0x0004)  
	int32_t                                            __IntProperty47;                                            // 0x0170   (0x0004)  
	SDK_UNDEFINED(1,9325) /* TEnumAsByte<ERefPoseType> */ __um(__ByteProperty);                                    // 0x0174   (0x0001)  
	unsigned char                                      UnknownData08_5[0x3];                                       // 0x0175   (0x0003)  MISSED
	FName                                              __NameProperty49;                                           // 0x0178   (0x0004)  
	FName                                              __NameProperty50;                                           // 0x017C   (0x0004)  
	int32_t                                            __IntProperty51;                                            // 0x0180   (0x0004)  
	unsigned char                                      UnknownData09_5[0x4];                                       // 0x0184   (0x0004)  MISSED
	FAnimNodeFunctionRef                               __StructProperty52;                                         // 0x0188   (0x0018)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x01A0   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x0220   (0x0018)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_Root;                                         // 0x0238   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_LinkedInputPose;                              // 0x0268   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool;                              // 0x0298   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer;                               // 0x02C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer53;                             // 0x02F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_Root54;                                       // 0x0328   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_LinkedInputPose55;                            // 0x0358   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer56;                             // 0x0388   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_Root57;                                       // 0x03B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult;                             // 0x03E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult58;                           // 0x0418   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult59;                           // 0x0448   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult60;                           // 0x0478   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult61;                           // 0x04A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult62;                           // 0x04D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult63;                           // 0x0508   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult64;                           // 0x0538   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult65;                           // 0x0568   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult66;                           // 0x0598   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult67;                           // 0x05C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult68;                           // 0x05F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult69;                           // 0x0628   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult70;                           // 0x0658   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult71;                           // 0x0688   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult72;                           // 0x06B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult73;                           // 0x06E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult74;                           // 0x0718   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult75;                           // 0x0748   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult76;                           // 0x0778   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult77;                           // 0x07A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult78;                           // 0x07D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer79;                             // 0x0808   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult;                                  // 0x0838   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer80;                             // 0x0868   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult81;                                // 0x0898   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer82;                             // 0x08C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult83;                                // 0x08F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer;                             // 0x0928   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive;                                // 0x0958   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer84;                             // 0x0988   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer85;                             // 0x09B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool86;                            // 0x09E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult87;                                // 0x0A18   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer88;                             // 0x0A48   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult89;                                // 0x0A78   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer90;                             // 0x0AA8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult91;                                // 0x0AD8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer92;                             // 0x0B08   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult93;                                // 0x0B38   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult94;                           // 0x0B68   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult95;                           // 0x0B98   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer96;                             // 0x0BC8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult97;                                // 0x0BF8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_IdentityPose;                                 // 0x0C28   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult98;                                // 0x0C58   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine;                                 // 0x0C88   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive99;                              // 0x0CB8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive100;                             // 0x0CE8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer101;                          // 0x0D18   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer102;                          // 0x0D48   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult103;                               // 0x0D78   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_UseCachedPose;                                // 0x0DA8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool104;                           // 0x0DD8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_LayeredBoneBlend;                             // 0x0E08   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool105;                           // 0x0E38   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_UseCachedPose106;                             // 0x0E68   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer107;                            // 0x0E98   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer108;                            // 0x0EC8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive109;                             // 0x0EF8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer110;                          // 0x0F28   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult111;                               // 0x0F58   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine112;                              // 0x0F88   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_Slot;                                         // 0x0FB8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_LocalToComponentSpace;                        // 0x0FE8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ComponentToLocalSpace;                        // 0x1018   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_Slot113;                                      // 0x1048   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_LegIK;                                        // 0x1078   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive114;                             // 0x10A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult115;                          // 0x10D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult116;                          // 0x1108   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer117;                            // 0x1138   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult118;                               // 0x1168   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_IdentityPose119;                              // 0x1198   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult120;                               // 0x11C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine121;                              // 0x11F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        FortAnimGraphNode_QuadrupedSlopeWarping;                    // 0x1228   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        FortAnimGraphNode_WeightedLookAt;                           // 0x1258   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_Inertialization;                              // 0x1288   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_LinkedAnimLayer;                              // 0x12B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SaveCachedPose;                               // 0x12E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool122;                           // 0x1318   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer123;                            // 0x1348   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool124;                           // 0x1378   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult125;                          // 0x13A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult126;                          // 0x13D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult127;                          // 0x1408   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult128;                          // 0x1438   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult129;                          // 0x1468   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult130;                          // 0x1498   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult131;                          // 0x14C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult132;                          // 0x14F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult133;                          // 0x1528   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult134;                          // 0x1558   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult135;                          // 0x1588   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult136;                          // 0x15B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult137;                          // 0x15E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult138;                          // 0x1618   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult139;                          // 0x1648   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult140;                          // 0x1678   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult141;                          // 0x16A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult142;                          // 0x16D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool143;                           // 0x1708   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer144;                            // 0x1738   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer145;                            // 0x1768   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult146;                               // 0x1798   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult147;                          // 0x17C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult148;                          // 0x17F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult149;                          // 0x1828   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult150;                          // 0x1858   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult151;                          // 0x1888   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult152;                          // 0x18B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult153;                          // 0x18E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult154;                          // 0x1918   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer155;                            // 0x1948   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult156;                               // 0x1978   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer157;                            // 0x19A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult158;                               // 0x19D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer159;                            // 0x1A08   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult160;                               // 0x1A38   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer161;                            // 0x1A68   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult162;                               // 0x1A98   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult163;                          // 0x1AC8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine164;                              // 0x1AF8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult165;                               // 0x1B28   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer166;                            // 0x1B58   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult167;                               // 0x1B88   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer168;                            // 0x1BB8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult169;                               // 0x1BE8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer170;                            // 0x1C18   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult171;                               // 0x1C48   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult172;                          // 0x1C78   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine173;                              // 0x1CA8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult174;                               // 0x1CD8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer175;                            // 0x1D08   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer176;                            // 0x1D38   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool177;                           // 0x1D68   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult178;                               // 0x1D98   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool179;                           // 0x1DC8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer180;                            // 0x1DF8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer181;                          // 0x1E28   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive182;                             // 0x1E58   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer183;                            // 0x1E88   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer184;                            // 0x1EB8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool185;                           // 0x1EE8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult186;                               // 0x1F18   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer187;                            // 0x1F48   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer188;                          // 0x1F78   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive189;                             // 0x1FA8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool190;                           // 0x1FD8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer191;                            // 0x2008   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult192;                               // 0x2038   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer193;                            // 0x2068   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult194;                               // 0x2098   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer195;                            // 0x20C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult196;                               // 0x20F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer197;                          // 0x2128   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive198;                             // 0x2158   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer199;                            // 0x2188   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool200;                           // 0x21B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer201;                          // 0x21E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive202;                             // 0x2218   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer203;                            // 0x2248   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendListByBool204;                           // 0x2278   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult205;                          // 0x22A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult206;                          // 0x22D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer207;                            // 0x2308   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult208;                               // 0x2338   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_IdentityPose209;                              // 0x2368   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult210;                               // 0x2398   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine211;                              // 0x23C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive212;                             // 0x23F8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive213;                             // 0x2428   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer214;                          // 0x2458   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_BlendSpacePlayer215;                          // 0x2488   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult216;                               // 0x24B8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer217;                            // 0x24E8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult218;                               // 0x2518   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine219;                              // 0x2548   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_Slot220;                                      // 0x2578   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_ApplyAdditive221;                             // 0x25A8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult222;                          // 0x25D8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_TransitionResult223;                          // 0x2608   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_SequencePlayer224;                            // 0x2638   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult225;                               // 0x2668   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_IdentityPose226;                              // 0x2698   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateResult227;                               // 0x26C8   (0x0030)  
	FAnimNodeExposedValueHandler_PropertyAccess        AnimGraphNode_StateMachine228;                              // 0x26F8   (0x0030)  
};

