
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: AIModule
/// dependency: AssembledMeshSystem
/// dependency: AtomRuntime
/// dependency: ClientPilot
/// dependency: CoreUObject
/// dependency: CraftingRuntime
/// dependency: DataflowCore
/// dependency: DataRegistry
/// dependency: DeltaFileSystem
/// dependency: DeveloperSettings
/// dependency: EnergyRuntime
/// dependency: Engine
/// dependency: EnhancedInput
/// dependency: FortGameplayGraph
/// dependency: FortImGuiCore
/// dependency: FortniteAI
/// dependency: FortniteGame
/// dependency: FortniteGameFramework
/// dependency: GameFeatures
/// dependency: GameplayAbilities
/// dependency: GameplayEventRouter
/// dependency: GameplayGraph
/// dependency: GameplayInteractionsModule
/// dependency: GameplayStateMachine
/// dependency: GameplayTags
/// dependency: GeometryCollectionEngine
/// dependency: ItemizationCoreRuntime
/// dependency: JunoWorldManagement
/// dependency: MassEntity
/// dependency: McpProfileSys
/// dependency: MeshNetwork
/// dependency: ModularGameplay
/// dependency: NavigationSystem
/// dependency: NetCore
/// dependency: PhysicsCore
/// dependency: PlayspaceSystem
/// dependency: ProxyTable
/// dependency: ReplicationGraph
/// dependency: SmartObjectsModule
/// dependency: SoundLibrary
/// dependency: SpatialMetricsCore
/// dependency: StateTreeModule
/// dependency: StructUtils
/// dependency: WorldConditions

/// Enum /Script/JunoGameNative.EJunoBuildingPlacementType
/// Size: 0x05
enum class EJunoBuildingPlacementType : uint8_t
{
	EJunoBuildingPlacementType__GuidedSnapping                                       = 0,
	EJunoBuildingPlacementType__Connectivity                                         = 1,
	EJunoBuildingPlacementType__SnapPlacement                                        = 2,
	EJunoBuildingPlacementType__NoTarget                                             = 3,
	EJunoBuildingPlacementType__MAX                                                  = 4
};

/// Enum /Script/JunoGameNative.EJunoBuildingBehaviorState
/// Size: 0x06
enum class EJunoBuildingBehaviorState : uint8_t
{
	EJunoBuildingBehaviorState__Uninitialized                                        = 0,
	EJunoBuildingBehaviorState__Pending                                              = 1,
	EJunoBuildingBehaviorState__Ready                                                = 2,
	EJunoBuildingBehaviorState__Invalid                                              = 3,
	EJunoBuildingBehaviorState__Disabled                                             = 4,
	EJunoBuildingBehaviorState__MAX                                                  = 5
};

/// Enum /Script/JunoGameNative.EJunoBiomeHabitat
/// Size: 0x16
enum class EJunoBiomeHabitat : uint8_t
{
	EJunoBiomeHabitat__Unknown                                                       = 0,
	EJunoBiomeHabitat__POI                                                           = 1,
	EJunoBiomeHabitat__Cave                                                          = 2,
	EJunoBiomeHabitat__Stone                                                         = 3,
	EJunoBiomeHabitat__Asphalt                                                       = 4,
	EJunoBiomeHabitat__Snow                                                          = 5,
	EJunoBiomeHabitat__Dirt                                                          = 6,
	EJunoBiomeHabitat__Sand                                                          = 7,
	EJunoBiomeHabitat__Grass                                                         = 8,
	EJunoBiomeHabitat__Flowers                                                       = 9,
	EJunoBiomeHabitat__Heather                                                       = 10,
	EJunoBiomeHabitat__Moss                                                          = 11,
	EJunoBiomeHabitat__Ocean                                                         = 12,
	EJunoBiomeHabitat__Lake                                                          = 13,
	EJunoBiomeHabitat__River                                                         = 14,
	EJunoBiomeHabitat__Max                                                           = 15
};

/// Enum /Script/JunoGameNative.EJunoBiome
/// Size: 0x09
enum class EJunoBiome : uint8_t
{
	EJunoBiome__Unknown                                                              = 0,
	EJunoBiome__Grasslands                                                           = 1,
	EJunoBiome__DarkForest                                                           = 2,
	EJunoBiome__Desert                                                               = 3,
	EJunoBiome__Tropical                                                             = 4,
	EJunoBiome__Alpine                                                               = 5,
	EJunoBiome__Water                                                                = 6,
	EJunoBiome__Reserved                                                             = 7,
	EJunoBiome__Max                                                                  = 8
};

/// Enum /Script/JunoGameNative.EJunoAwesomePointModificationContext
/// Size: 0x06
enum class EJunoAwesomePointModificationContext : uint8_t
{
	EJunoAwesomePointModificationContext__Cheat                                      = 0,
	EJunoAwesomePointModificationContext__Interaction                                = 1,
	EJunoAwesomePointModificationContext__ActorPlacement                             = 2,
	EJunoAwesomePointModificationContext__ActorRemoval                               = 3,
	EJunoAwesomePointModificationContext__QuestCompletion                            = 4,
	EJunoAwesomePointModificationContext__EJunoAwesomePointModificationContext_MAX   = 5
};

/// Enum /Script/JunoGameNative.EJunoPawnEmotionalState
/// Size: 0x04
enum class EJunoPawnEmotionalState : uint8_t
{
	EJunoPawnEmotionalState__Default                                                 = 0,
	EJunoPawnEmotionalState__Happy                                                   = 1,
	EJunoPawnEmotionalState__Sad                                                     = 2,
	EJunoPawnEmotionalState__MAX                                                     = 3
};

/// Enum /Script/JunoGameNative.EPassiveCraftingDoneReason
/// Size: 0x05
enum class EPassiveCraftingDoneReason : uint8_t
{
	EPassiveCraftingDoneReason__UnexpectedError                                      = 0,
	EPassiveCraftingDoneReason__PlayerStopped                                        = 1,
	EPassiveCraftingDoneReason__NoOutputSpace                                        = 2,
	EPassiveCraftingDoneReason__MissingIngredients                                   = 3,
	EPassiveCraftingDoneReason__EPassiveCraftingDoneReason_MAX                       = 4
};

/// Enum /Script/JunoGameNative.EJunoCaveType
/// Size: 0x11
enum class EJunoCaveType : uint8_t
{
	EJunoCaveType__Unknown                                                           = 0,
	EJunoCaveType__Surface                                                           = 1,
	EJunoCaveType__Lava                                                              = 2,
	EJunoCaveType__Rift                                                              = 3,
	EJunoCaveType__Ruins                                                             = 4,
	EJunoCaveType__SurfaceMines                                                      = 5,
	EJunoCaveType__Pirate                                                            = 6,
	EJunoCaveType__Bear                                                              = 7,
	EJunoCaveType__Treasure                                                          = 8,
	EJunoCaveType__BossRoom                                                          = 9,
	EJunoCaveType__Max                                                               = 10
};

/// Enum /Script/JunoGameNative.EJunoCompassDirection
/// Size: 0x10
enum class EJunoCompassDirection : uint8_t
{
	EJunoCompassDirection__Unknown                                                   = 0,
	EJunoCompassDirection__North                                                     = 1,
	EJunoCompassDirection__NorthEast                                                 = 2,
	EJunoCompassDirection__East                                                      = 3,
	EJunoCompassDirection__SouthEast                                                 = 4,
	EJunoCompassDirection__South                                                     = 5,
	EJunoCompassDirection__SouthWest                                                 = 6,
	EJunoCompassDirection__West                                                      = 7,
	EJunoCompassDirection__NorthWest                                                 = 8,
	EJunoCompassDirection__Max                                                       = 9
};

/// Enum /Script/JunoGameNative.EJunoTrackedActorRefreshReason
/// Size: 0x05
enum class EJunoTrackedActorRefreshReason : uint8_t
{
	EJunoTrackedActorRefreshReason__LocationChanged                                  = 0,
	EJunoTrackedActorRefreshReason__NetRelDistanceChanged                            = 1,
	EJunoTrackedActorRefreshReason__NumberOfRelevantActorsChanged                    = 2,
	EJunoTrackedActorRefreshReason__Unknown                                          = 3,
	EJunoTrackedActorRefreshReason__EJunoTrackedActorRefreshReason_MAX               = 4
};

/// Enum /Script/JunoGameNative.EChaosEventSize
/// Size: 0x06
enum class EChaosEventSize : uint8_t
{
	Single                                                                           = 0,
	Small                                                                            = 1,
	Medium                                                                           = 2,
	Large                                                                            = 3,
	Default                                                                          = 1,
	EChaosEventSize_MAX                                                              = 4
};

/// Enum /Script/JunoGameNative.EJunoContactDirection
/// Size: 0x07
enum class EJunoContactDirection : uint8_t
{
	EJunoContactDirection__PosX                                                      = 0,
	EJunoContactDirection__NegX                                                      = 1,
	EJunoContactDirection__PosY                                                      = 2,
	EJunoContactDirection__NegY                                                      = 3,
	EJunoContactDirection__PosZ                                                      = 4,
	EJunoContactDirection__NegZ                                                      = 5,
	EJunoContactDirection__EJunoContactDirection_MAX                                 = 6
};

/// Enum /Script/JunoGameNative.EJunoDumpWorldPersistentContentsVerbosity
/// Size: 0x04
enum class EJunoDumpWorldPersistentContentsVerbosity : uint8_t
{
	EJunoDumpWorldPersistentContentsVerbosity__Compact                               = 0,
	EJunoDumpWorldPersistentContentsVerbosity__Default                               = 1,
	EJunoDumpWorldPersistentContentsVerbosity__Verbose                               = 2,
	EJunoDumpWorldPersistentContentsVerbosity__EJunoDumpWorldPersistentContentsVerbosity_MAX = 3
};

/// Enum /Script/JunoGameNative.EJunoGeometryCollectionAssemblerDurationType
/// Size: 0x04
enum class EJunoGeometryCollectionAssemblerDurationType : uint32_t
{
	EJunoGeometryCollectionAssemblerDurationType__Default                            = 0,
	EJunoGeometryCollectionAssemblerDurationType__CalculateLayerCount                = 1,
	EJunoGeometryCollectionAssemblerDurationType__SpecifyLayerCount                  = 2,
	EJunoGeometryCollectionAssemblerDurationType__EJunoGeometryCollectionAssemblerDurationType_MAX = 3
};

/// Enum /Script/JunoGameNative.EJunoKnowledgeState
/// Size: 0x04
enum class EJunoKnowledgeState : uint8_t
{
	EJunoKnowledgeState__Hidden                                                      = 0,
	EJunoKnowledgeState__Revealed                                                    = 1,
	EJunoKnowledgeState__Acquired                                                    = 2,
	EJunoKnowledgeState__EJunoKnowledgeState_MAX                                     = 3
};

/// Enum /Script/JunoGameNative.EJunoWorldSaveDataState
/// Size: 0x06
enum class EJunoWorldSaveDataState : uint8_t
{
	EJunoWorldSaveDataState__Uninitialized                                           = 0,
	EJunoWorldSaveDataState__Loading                                                 = 1,
	EJunoWorldSaveDataState__Loaded                                                  = 2,
	EJunoWorldSaveDataState__CheckingIn                                              = 3,
	EJunoWorldSaveDataState__CheckedIn                                               = 4,
	EJunoWorldSaveDataState__EJunoWorldSaveDataState_MAX                             = 5
};

/// Enum /Script/JunoGameNative.EJunoLevelSaveDataState
/// Size: 0x05
enum class EJunoLevelSaveDataState : uint8_t
{
	EJunoLevelSaveDataState__None                                                    = 0,
	EJunoLevelSaveDataState__CheckedOut                                              = 1,
	EJunoLevelSaveDataState__Applied                                                 = 2,
	EJunoLevelSaveDataState__CheckedIn                                               = 3,
	EJunoLevelSaveDataState__EJunoLevelSaveDataState_MAX                             = 4
};

/// Enum /Script/JunoGameNative.EJunoPersistenceFeatureCheckoutState
/// Size: 0x04
enum class EJunoPersistenceFeatureCheckoutState : uint32_t
{
	EJunoPersistenceFeatureCheckoutState__None                                       = 0,
	EJunoPersistenceFeatureCheckoutState__CheckedOut                                 = 1,
	EJunoPersistenceFeatureCheckoutState__CheckedIn                                  = 2,
	EJunoPersistenceFeatureCheckoutState__EJunoPersistenceFeatureCheckoutState_MAX   = 3
};

/// Enum /Script/JunoGameNative.EJunoBuildModeType
/// Size: 0x05
enum class EJunoBuildModeType : uint8_t
{
	EJunoBuildModeType__BuildMode                                                    = 0,
	EJunoBuildModeType__GuidedBuildingMode                                           = 1,
	EJunoBuildModeType__NumOfBuildModes                                              = 2,
	EJunoBuildModeType__ActionMode                                                   = 3,
	EJunoBuildModeType__EJunoBuildModeType_MAX                                       = 4
};

/// Enum /Script/JunoGameNative.EJunoPersistenceReportOptions
/// Size: 0x15
enum class EJunoPersistenceReportOptions : uint16_t
{
	EJunoPersistenceReportOptions__None                                              = 0,
	EJunoPersistenceReportOptions__ActorTemplateDataEnabled                          = 1,
	EJunoPersistenceReportOptions__ActorInstanceDataEnabled                          = 2,
	EJunoPersistenceReportOptions__JunoUpdateActionDataEnabled                       = 4,
	EJunoPersistenceReportOptions__JunoDeleteActionDataEnabled                       = 8,
	EJunoPersistenceReportOptions__JunoPersistenceFeaturesDataEnabled                = 16,
	EJunoPersistenceReportOptions__DataEnabledDefaultFlags                           = 31,
	EJunoPersistenceReportOptions__ShowReportHeader                                  = 32,
	EJunoPersistenceReportOptions__ShowPlayspaceHeaders                              = 64,
	EJunoPersistenceReportOptions__ShowSubreportsHeaders                             = 128,
	EJunoPersistenceReportOptions__ShowTablesHeaders                                 = 256,
	EJunoPersistenceReportOptions__ShowIndividualItemsStats                          = 512,
	EJunoPersistenceReportOptions__ShowAggregatedStats                               = 1024,
	EJunoPersistenceReportOptions__ShowDefaultFlags                                  = 1504,
	EJunoPersistenceReportOptions__EJunoPersistenceReportOptions_MAX                 = 1505
};

/// Enum /Script/JunoGameNative.EJunoWorldConditionAICampChecksIsAssigned
/// Size: 0x04
enum class EJunoWorldConditionAICampChecksIsAssigned : uint8_t
{
	EJunoWorldConditionAICampChecksIsAssigned__None                                  = 0,
	EJunoWorldConditionAICampChecksIsAssigned__Assigned                              = 1,
	EJunoWorldConditionAICampChecksIsAssigned__Unassigned                            = 2,
	EJunoWorldConditionAICampChecksIsAssigned__EJunoWorldConditionAICampChecksIsAssigned_MAX = 3
};

/// Enum /Script/JunoGameNative.EJunoWorldConditionMustHaveLastUsedGatheringActor
/// Size: 0x04
enum class EJunoWorldConditionMustHaveLastUsedGatheringActor : uint8_t
{
	EJunoWorldConditionMustHaveLastUsedGatheringActor__None                          = 0,
	EJunoWorldConditionMustHaveLastUsedGatheringActor__IsValid                       = 1,
	EJunoWorldConditionMustHaveLastUsedGatheringActor__IsNotValid                    = 2,
	EJunoWorldConditionMustHaveLastUsedGatheringActor__EJunoWorldConditionMustHaveLastUsedGatheringActor_MAX = 3
};

/// Enum /Script/JunoGameNative.EJunoWorldConditionAssignmentState
/// Size: 0x05
enum class EJunoWorldConditionAssignmentState : uint8_t
{
	EJunoWorldConditionAssignmentState__None                                         = 0,
	EJunoWorldConditionAssignmentState__AssignedToUserActor                          = 1,
	EJunoWorldConditionAssignmentState__Assigned                                     = 2,
	EJunoWorldConditionAssignmentState__Unassigned                                   = 3,
	EJunoWorldConditionAssignmentState__EJunoWorldConditionAssignmentState_MAX       = 4
};

/// Enum /Script/JunoGameNative.EJunoWorldConditionPawnType
/// Size: 0x05
enum class EJunoWorldConditionPawnType : uint8_t
{
	EJunoWorldConditionPawnType__None                                                = 0,
	EJunoWorldConditionPawnType__Player                                              = 1,
	EJunoWorldConditionPawnType__Villager                                            = 2,
	EJunoWorldConditionPawnType__EnemyMinifig                                        = 4,
	EJunoWorldConditionPawnType__EJunoWorldConditionPawnType_MAX                     = 5
};

/// Enum /Script/JunoGameNative.EJunoWorldConditionHasFollower
/// Size: 0x04
enum class EJunoWorldConditionHasFollower : uint8_t
{
	EJunoWorldConditionHasFollower__Unset                                            = 0,
	EJunoWorldConditionHasFollower__Zero                                             = 1,
	EJunoWorldConditionHasFollower__OneOrMore                                        = 2,
	EJunoWorldConditionHasFollower__EJunoWorldConditionHasFollower_MAX               = 3
};

/// Enum /Script/JunoGameNative.EPhysicalStrainHealthMode
/// Size: 0x05
enum class EPhysicalStrainHealthMode : uint8_t
{
	EPhysicalStrainHealthMode__Disabled                                              = 0,
	EPhysicalStrainHealthMode__FullIntegrityPercentageMapping                        = 1,
	EPhysicalStrainHealthMode__ZeroIntegrity                                         = 2,
	EPhysicalStrainHealthMode__FullIntegrityFatigueThresholdMapping                  = 3,
	EPhysicalStrainHealthMode__EPhysicalStrainHealthMode_MAX                         = 4
};

/// Enum /Script/JunoGameNative.EJunoAwesomeThresholdTestMode
/// Size: 0x04
enum class EJunoAwesomeThresholdTestMode : uint32_t
{
	EJunoAwesomeThresholdTestMode__LessOrEqual                                       = 0,
	EJunoAwesomeThresholdTestMode__GreaterOrEqual                                    = 1,
	EJunoAwesomeThresholdTestMode__Range                                             = 2,
	EJunoAwesomeThresholdTestMode__EJunoAwesomeThresholdTestMode_MAX                 = 3
};

/// Enum /Script/JunoGameNative.EJunoAwesomeLevelUpgradeQueryResult
/// Size: 0x04
enum class EJunoAwesomeLevelUpgradeQueryResult : uint8_t
{
	EJunoAwesomeLevelUpgradeQueryResult__Fail_LackingAwesomePoints                   = 0,
	EJunoAwesomeLevelUpgradeQueryResult__Fail_LackingPlayerResources                 = 1,
	EJunoAwesomeLevelUpgradeQueryResult__Pass                                        = 2,
	EJunoAwesomeLevelUpgradeQueryResult__EJunoAwesomeLevelUpgradeQueryResult_MAX     = 3
};

/// Enum /Script/JunoGameNative.EImpactOrDamage_ExecutionPin
/// Size: 0x04
enum class EImpactOrDamage_ExecutionPin : uint8_t
{
	EImpactOrDamage_ExecutionPin__LocalImpact                                        = 0,
	EImpactOrDamage_ExecutionPin__LocalDamage                                        = 1,
	EImpactOrDamage_ExecutionPin__OtherDamage                                        = 2,
	EImpactOrDamage_ExecutionPin__EImpactOrDamage_MAX                                = 3
};

/// Enum /Script/JunoGameNative.EUpdateAnimationTimer_ExecutionPin
/// Size: 0x03
enum class EUpdateAnimationTimer_ExecutionPin : uint8_t
{
	EUpdateAnimationTimer_ExecutionPin__Active                                       = 0,
	EUpdateAnimationTimer_ExecutionPin__Expired                                      = 1,
	EUpdateAnimationTimer_ExecutionPin__EUpdateAnimationTimer_MAX                    = 2
};

/// Enum /Script/JunoGameNative.EJunoMinifigRotationMode
/// Size: 0x05
enum class EJunoMinifigRotationMode : uint8_t
{
	EJunoMinifigRotationMode__NoRotation                                             = 0,
	EJunoMinifigRotationMode__ContinuousRotateToTarget                               = 1,
	EJunoMinifigRotationMode__CurveRotateToMovingTarget                              = 2,
	EJunoMinifigRotationMode__CurveRotateToStaticTarget                              = 3,
	EJunoMinifigRotationMode__EJunoMinifigRotationMode_MAX                           = 4
};

/// Enum /Script/JunoGameNative.EJunoResourceScale
/// Size: 0x07
enum class EJunoResourceScale : uint8_t
{
	EJunoResourceScale__Invalid                                                      = 0,
	EJunoResourceScale__Small                                                        = 1,
	EJunoResourceScale__Medium                                                       = 2,
	EJunoResourceScale__Large                                                        = 3,
	EJunoResourceScale__VerySmall                                                    = 4,
	EJunoResourceScale__VeryLarge                                                    = 5,
	EJunoResourceScale__EJunoResourceScale_MAX                                       = 6
};

/// Enum /Script/JunoGameNative.EWorldDataAvailable
/// Size: 0x04
enum class EWorldDataAvailable : uint8_t
{
	EWorldDataAvailable__Undefined                                                   = 0,
	EWorldDataAvailable__WasLoadedFromPersistentData                                 = 1,
	EWorldDataAvailable__WasInitializedFromWorldMetadata                             = 2,
	EWorldDataAvailable__EWorldDataAvailable_MAX                                     = 3
};

/// Enum /Script/JunoGameNative.EJunoItemChangeType
/// Size: 0x06
enum class EJunoItemChangeType : uint8_t
{
	EJunoItemChangeType__Added                                                       = 0,
	EJunoItemChangeType__Removed                                                     = 1,
	EJunoItemChangeType__ItemChanged                                                 = 2,
	EJunoItemChangeType__SlotChanged                                                 = 3,
	EJunoItemChangeType__Swapped                                                     = 4,
	EJunoItemChangeType__EJunoItemChangeType_MAX                                     = 5
};

/// Enum /Script/JunoGameNative.EJunoInventoryAcquisitionResult
/// Size: 0x05
enum class EJunoInventoryAcquisitionResult : uint8_t
{
	EJunoInventoryAcquisitionResult__Failure                                         = 0,
	EJunoInventoryAcquisitionResult__SystemNotReady                                  = 1,
	EJunoInventoryAcquisitionResult__InventoryCreated                                = 2,
	EJunoInventoryAcquisitionResult__InventoryRestored                               = 3,
	EJunoInventoryAcquisitionResult__EJunoInventoryAcquisitionResult_MAX             = 4
};

/// Enum /Script/JunoGameNative.EJunoBuildingActorOverlapActionType
/// Size: 0x05
enum class EJunoBuildingActorOverlapActionType : uint8_t
{
	EJunoBuildingActorOverlapActionType__AllowOverlap                                = 0,
	EJunoBuildingActorOverlapActionType__DestroyComponent                            = 1,
	EJunoBuildingActorOverlapActionType__CropComponent                               = 2,
	EJunoBuildingActorOverlapActionType__Custom                                      = 3,
	EJunoBuildingActorOverlapActionType__EJunoBuildingActorOverlapActionType_MAX     = 4
};

/// Enum /Script/JunoGameNative.EJunoBuildingSnapEntryState
/// Size: 0x06
enum class EJunoBuildingSnapEntryState : uint8_t
{
	EJunoBuildingSnapEntryState__Incompatible                                        = 0,
	EJunoBuildingSnapEntryState__Compatible                                          = 1,
	EJunoBuildingSnapEntryState__InRangeRejected                                     = 2,
	EJunoBuildingSnapEntryState__InRangeValid                                        = 3,
	EJunoBuildingSnapEntryState__Connected                                           = 4,
	EJunoBuildingSnapEntryState__EJunoBuildingSnapEntryState_MAX                     = 5
};

/// Enum /Script/JunoGameNative.EOnPlacementAction
/// Size: 0x03
enum class EOnPlacementAction : uint8_t
{
	EOnPlacementAction__IgnoreOnly                                                   = 0,
	EOnPlacementAction__IgnoreAndDestroy                                             = 1,
	EOnPlacementAction__EOnPlacementAction_MAX                                       = 2
};

/// Enum /Script/JunoGameNative.EJunoGuidedBuildingState
/// Size: 0x05
enum class EJunoGuidedBuildingState : uint8_t
{
	EJunoGuidedBuildingState__Default                                                = 0,
	EJunoGuidedBuildingState__Hidden                                                 = 1,
	EJunoGuidedBuildingState__Unfilled                                               = 2,
	EJunoGuidedBuildingState__Filled                                                 = 3,
	EJunoGuidedBuildingState__EJunoGuidedBuildingState_MAX                           = 4
};

/// Enum /Script/JunoGameNative.EJunoLandscapeVisualModifierType
/// Size: 0x03
enum class EJunoLandscapeVisualModifierType : uint8_t
{
	EJunoLandscapeVisualModifierType__None                                           = 0,
	EJunoLandscapeVisualModifierType__DirtPatch                                      = 1,
	EJunoLandscapeVisualModifierType__EJunoLandscapeVisualModifierType_MAX           = 2
};

/// Enum /Script/JunoGameNative.EJunoAutomaticConnectionMethod
/// Size: 0x04
enum class EJunoAutomaticConnectionMethod : uint8_t
{
	EJunoAutomaticConnectionMethod__Full                                             = 0,
	EJunoAutomaticConnectionMethod__Below                                            = 1,
	EJunoAutomaticConnectionMethod__Custom                                           = 2,
	EJunoAutomaticConnectionMethod__EJunoAutomaticConnectionMethod_MAX               = 3
};

/// Enum /Script/JunoGameNative.EJunoDeltaActionTypes
/// Size: 0x05
enum class EJunoDeltaActionTypes : uint8_t
{
	EJunoDeltaActionTypes__None                                                      = 0,
	EJunoDeltaActionTypes__Add                                                       = 1,
	EJunoDeltaActionTypes__Update                                                    = 2,
	EJunoDeltaActionTypes__Delete                                                    = 4,
	EJunoDeltaActionTypes__EJunoDeltaActionTypes_MAX                                 = 5
};

/// Enum /Script/JunoGameNative.EJunoQuickbarSelectionDirection
/// Size: 0x03
enum class EJunoQuickbarSelectionDirection : uint8_t
{
	EJunoQuickbarSelectionDirection__Next                                            = 0,
	EJunoQuickbarSelectionDirection__Prev                                            = 1,
	EJunoQuickbarSelectionDirection__EJunoQuickbarSelectionDirection_MAX             = 2
};

/// Enum /Script/JunoGameNative.EJunoPawnEmotionalStateMappingTest
/// Size: 0x03
enum class EJunoPawnEmotionalStateMappingTest : uint32_t
{
	EJunoPawnEmotionalStateMappingTest__LessOrEqual                                  = 0,
	EJunoPawnEmotionalStateMappingTest__GreaterOrEqual                               = 1,
	EJunoPawnEmotionalStateMappingTest__EJunoPawnEmotionalStateMappingTest_MAX       = 2
};

/// Enum /Script/JunoGameNative.EJunoActionExecutionConfig
/// Size: 0x04
enum class EJunoActionExecutionConfig : uint8_t
{
	EJunoActionExecutionConfig__ExecuteEveryTime                                     = 0,
	EJunoActionExecutionConfig__ExecuteFirstTimeOnly                                 = 1,
	EJunoActionExecutionConfig__ExecuteReloadOnly                                    = 2,
	EJunoActionExecutionConfig__EJunoActionExecutionConfig_MAX                       = 3
};

/// Enum /Script/JunoGameNative.EMeshAuditFailureReason
/// Size: 0x12
enum class EMeshAuditFailureReason : uint32_t
{
	EMeshAuditFailureReason__MAFR_None                                               = 0,
	EMeshAuditFailureReason__MAFR_NeverStream                                        = 1,
	EMeshAuditFailureReason__MAFR_HighTriRatioInLODs                                 = 2,
	EMeshAuditFailureReason__MAFR_SimplestLODTooComplex                              = 4,
	EMeshAuditFailureReason__MAFR_TriDensityTooHigh                                  = 8,
	EMeshAuditFailureReason__MAFR_PhysicsTriDensityHigh                              = 256,
	EMeshAuditFailureReason__MAFR_PhysicsComplexAsSimple                             = 512,
	EMeshAuditFailureReason__MAFR_PhysicsMeshIsHighLOD                               = 1024,
	EMeshAuditFailureReason__MAFR_PhysicsSimpleShapeTooComplex                       = 2048,
	EMeshAuditFailureReason__MAFR_PhysicsTooDetailedForSmallObject                   = 4096,
	EMeshAuditFailureReason__MAFR_PhysicsCollideAll                                  = 8192,
	EMeshAuditFailureReason__MAFR_MAX                                                = 8193
};

/// Class /Script/JunoGameNative.FortAutomationRpcManager_Juno
/// Size: 0x0050 (0x000058 - 0x0000A8)
class UFortAutomationRpcManager_Juno : public UFortAutomationRpcManager
{ 
public:
	unsigned char                                      UnknownData00_1[0x50];                                      // 0x0058   (0x0050)  MISSED
};

/// Class /Script/JunoGameNative.FortQueryGenerator_PointsOutsideVolume
/// Size: 0x0078 (0x000088 - 0x000100)
class UFortQueryGenerator_PointsOutsideVolume : public UEnvQueryGenerator_ProjectedPoints
{ 
public:
	FAIDataProviderFloatValue                          SpaceBetween;                                               // 0x0088   (0x0038)  
	FAIDataProviderFloatValue                          NumberOfRingsAroundVolume;                                  // 0x00C0   (0x0038)  
	class UClass*                                      GenerateInVolume;                                           // 0x00F8   (0x0008)  
};

/// Class /Script/JunoGameNative.JunoBuildingTrackedActorInterface
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoBuildingTrackedActorInterface : public UInterface
{ 
public:


	/// Functions
	// Function /Script/JunoGameNative.JunoBuildingTrackedActorInterface.ShouldBeTrackedByMetrics
	// bool ShouldBeTrackedByMetrics();                                                                                      // [0x1ccfdb4] Native|Event|Public|BlueprintEvent|Const 
	// Function /Script/JunoGameNative.JunoBuildingTrackedActorInterface.GetNumberOfRelevantActors
	// int32_t GetNumberOfRelevantActors();                                                                                  // [0x60b7ef4] Native|Event|Public|BlueprintEvent|Const 
	// Function /Script/JunoGameNative.JunoBuildingTrackedActorInterface.GetNetRelevanceDistanceOverride
	// float GetNetRelevanceDistanceOverride();                                                                              // [0xbb957b4] Native|Event|Public|BlueprintEvent|Const 
};

/// Struct /Script/JunoGameNative.PushMontageData
/// Size: 0x00D8 (0x000000 - 0x0000D8)
struct FPushMontageData
{ 
	FGameplayTagRequirements                           MontageDataRequirement;                                     // 0x0000   (0x0088)  
	SDK_UNDEFINED(80,11816) /* TMap<EFortPhysicsSimSize, UAnimMontage*> */ __um(SizeToMontageMap);                 // 0x0088   (0x0050)  
};

/// Class /Script/JunoGameNative.JunoAbility_PlayerPushPhysicsObject
/// Size: 0x0130 (0x000B60 - 0x000C90)
class UJunoAbility_PlayerPushPhysicsObject : public UFortGameplayAbility
{ 
public:
	EFortPhysicsSimSize                                MaxPhysicsObjectSizeToPush;                                 // 0x0B60   (0x0001)  
	EFortPhysicsSimSize                                MinPhysicsObjectSizeToPush;                                 // 0x0B61   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x0B62   (0x0006)  MISSED
	FGameplayTagContainer                              NoTagsPusher;                                               // 0x0B68   (0x0020)  
	FGameplayTagContainer                              NoTagsPushedObject;                                         // 0x0B88   (0x0020)  
	class UAnimMontage*                                DefaultPushMontage;                                         // 0x0BA8   (0x0008)  
	TArray<FPushMontageData>                           SpecializedPushMontages;                                    // 0x0BB0   (0x0010)  
	FGameplayTagQuery                                  EnergyComponentQuery;                                       // 0x0BC0   (0x0048)  
	FScalableFloat                                     EnergyInitialCost;                                          // 0x0C08   (0x0028)  
	FScalableFloat                                     EnergyDrainPerSecond;                                       // 0x0C30   (0x0028)  
	bool                                               bEnergyExhausted;                                           // 0x0C58   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0C59   (0x0003)  MISSED
	SDK_UNDEFINED(8,11817) /* TWeakObjectPtr<UFortComponent_Energy*> */ __um(CachedEnergyComponent);               // 0x0C5C   (0x0008)  
	unsigned char                                      UnknownData02_5[0xC];                                       // 0x0C64   (0x000C)  MISSED
	SDK_UNDEFINED(8,11818) /* TWeakObjectPtr<AActor*> */ __um(TrackedObjectToPush);                                // 0x0C70   (0x0008)  
	EFortPhysicsSimSize                                TrackedObjectSimSize;                                       // 0x0C78   (0x0001)  
	unsigned char                                      UnknownData03_6[0x17];                                      // 0x0C79   (0x0017)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoAbility_PlayerPushPhysicsObject.StopUsingEnergy
	// void StopUsingEnergy();                                                                                               // [0xbb95f0c] Final|Native|Protected|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoAbility_PlayerPushPhysicsObject.PotentiallyStartUsingEnergy
	// void PotentiallyStartUsingEnergy();                                                                                   // [0xbb95c7c] Final|Native|Protected|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoAbility_PlayerPushPhysicsObject.OnPlayerHit
	// void OnPlayerHit(class AActor* HitPlayer, class AActor* HitActor, FVector NormalImpulse, FHitResult& Hit);            // [0xbb959fc] Final|Native|Private|HasOutParms|HasDefaults 
	// Function /Script/JunoGameNative.JunoAbility_PlayerPushPhysicsObject.OnEnergyFullyRecharged
	// void OnEnergyFullyRecharged(class UFortComponent_Energy* EnergyComponentRecharged);                                   // [0xbb95924] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoAbility_PlayerPushPhysicsObject.OnEnergyDrained
	// void OnEnergyDrained(class UFortComponent_Energy* EnergyComponentDrained);                                            // [0xbb9584c] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoAbility_PlayerPushPhysicsObject.GetMontageToPlay
	// class UAnimMontage* GetMontageToPlay();                                                                               // [0xbb95790] Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoAbility_PlayerPushPhysicsObject.CancelPushingPhysicsObject
	// void CancelPushingPhysicsObject();                                                                                    // [0x307d48c] Final|Native|Protected|BlueprintCallable 
};

/// Class /Script/JunoGameNative.JunoAccountItemDefinitionOverrideManager
/// Size: 0x0168 (0x000028 - 0x000190)
class UJunoAccountItemDefinitionOverrideManager : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	class UFortHeroType*                               JunoHeroDefinition;                                         // 0x0030   (0x0008)  
	class UDataTable*                                  DefaultCharacters;                                          // 0x0038   (0x0008)  
	SDK_UNDEFINED(80,11819) /* TMap<TWeakObjectPtr<UClass*>, TWeakObjectPtr<UClass*>> */ __um(PreviewActorClasses); // 0x0040   (0x0050)  
	SDK_UNDEFINED(80,11820) /* TMap<TWeakObjectPtr<UClass*>, FGameplayTagContainer> */ __um(GameplayTagParentsToRemoveFromOverrides); // 0x0090   (0x0050)  
	SDK_UNDEFINED(80,11821) /* TMap<TWeakObjectPtr<UClass*>, FGameplayTagContainer> */ __um(GameplayTagsToAdd);    // 0x00E0   (0x0050)  
	SDK_UNDEFINED(80,11822) /* TMap<FPrimaryAssetId, FJunoAccountItemDefinitionOverride> */ __um(Overrides);       // 0x0130   (0x0050)  
	unsigned char                                      UnknownData01_6[0x10];                                      // 0x0180   (0x0010)  MISSED
};

/// Class /Script/JunoGameNative.JunoAccountItemOverrideDefinition
/// Size: 0x0078 (0x000030 - 0x0000A8)
class UJunoAccountItemOverrideDefinition : public UPrimaryDataAsset
{ 
public:
	FGameplayTagContainer                              GameplayTagsToAdd;                                          // 0x0030   (0x0020)  
	bool                                               bOverrideFrontendTransform;                                 // 0x0050   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0051   (0x0003)  MISSED
	float                                              FrontendPreviewScale;                                       // 0x0054   (0x0004)  
	FVector                                            FrontendPreviewPivotOffset;                                 // 0x0058   (0x0018)  
	FRotator                                           FrontendPreviewInitialRotation;                             // 0x0070   (0x0018)  
	SDK_UNDEFINED(32,11823) /* TWeakObjectPtr<UClass*> */ __um(PreviewActorClass);                                 // 0x0088   (0x0020)  
};

/// Class /Script/JunoGameNative.JunoAthenaCharacterItemOverrideDefinition
/// Size: 0x0088 (0x0000A8 - 0x000130)
class UJunoAthenaCharacterItemOverrideDefinition : public UJunoAccountItemOverrideDefinition
{ 
public:
	SDK_UNDEFINED(32,11824) /* TWeakObjectPtr<UAthenaCharacterItemDefinition*> */ __um(BaseAthenaCharacterItemDefinition); // 0x00A8   (0x0020)  
	SDK_UNDEFINED(32,11825) /* TWeakObjectPtr<UAssembledMeshSchema*> */ __um(AssembledMeshSchema);                 // 0x00C8   (0x0020)  
	SDK_UNDEFINED(32,11826) /* TWeakObjectPtr<UAssembledMeshSchema*> */ __um(LowDetailsAssembledMeshSchema);       // 0x00E8   (0x0020)  
	SDK_UNDEFINED(32,11827) /* TWeakObjectPtr<UAnimMontage*> */ __um(FrontendAnimMontageIdleOverride);             // 0x0108   (0x0020)  
	float                                              PreviewPawnScale;                                           // 0x0128   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x012C   (0x0004)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoAthenaCharacterItemOverrideDefinition.SetBaseAthenaCharacterItemDefinition
	// void SetBaseAthenaCharacterItemDefinition(TWeakObjectPtr<UAthenaCharacterItemDefinition*> InBaseAthenaCharacterItemDefinition); // [0xbb95c90] Final|Native|Protected|BlueprintCallable 
};

/// Class /Script/JunoGameNative.JunoAthenaDanceItemOverrideDefinition
/// Size: 0x00E8 (0x0000A8 - 0x000190)
class UJunoAthenaDanceItemOverrideDefinition : public UJunoAccountItemOverrideDefinition
{ 
public:
	SDK_UNDEFINED(32,11828) /* TWeakObjectPtr<UAthenaDanceItemDefinition*> */ __um(BaseAthenaDanceItemDefinition); // 0x00A8   (0x0020)  
	SDK_UNDEFINED(32,11829) /* TWeakObjectPtr<UAnimMontage*> */ __um(Animation);                                   // 0x00C8   (0x0020)  
	SDK_UNDEFINED(32,11830) /* TWeakObjectPtr<UAnimMontage*> */ __um(AnimationFemaleOverride);                     // 0x00E8   (0x0020)  
	TArray<FFortEmoteMapping>                          AnimationOverrides;                                         // 0x0108   (0x0010)  
	SDK_UNDEFINED(32,11831) /* TWeakObjectPtr<UAnimMontage*> */ __um(FrontEndAnimation);                           // 0x0118   (0x0020)  
	SDK_UNDEFINED(32,11832) /* TWeakObjectPtr<UAnimMontage*> */ __um(FrontEndAnimationFemaleOverride);             // 0x0138   (0x0020)  
	TArray<FFortEmoteMapping>                          FrontEndAnimationOverrides;                                 // 0x0158   (0x0010)  
	FVector                                            GroupEmotePositionOffset;                                   // 0x0168   (0x0018)  
	float                                              GroupEmotePositionOffsetTolerance;                          // 0x0180   (0x0004)  
	float                                              GroupEmoteFollowDistance;                                   // 0x0184   (0x0004)  
	float                                              WalkForwardSpeed;                                           // 0x0188   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x018C   (0x0004)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoAthenaDanceItemOverrideDefinition.SetBaseAthenaDanceItemDefinition
	// void SetBaseAthenaDanceItemDefinition(TWeakObjectPtr<UAthenaDanceItemDefinition*> InBaseAthenaDanceItemDefinition);   // [0xbb95dc4] Final|Native|Protected|BlueprintCallable 
};

/// Class /Script/JunoGameNative.JunoActionConfig
/// Size: 0x0010 (0x000028 - 0x000038)
class UJunoActionConfig : public UObject
{ 
public:
	class UClass*                                      JunoActionClass;                                            // 0x0028   (0x0008)  
	EJunoActionExecutionConfig                         JunoActionExecutionConfig;                                  // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0031   (0x0007)  MISSED
};

/// Class /Script/JunoGameNative.JunoActionConfig_StaticMesh
/// Size: 0x0008 (0x000038 - 0x000040)
class UJunoActionConfig_StaticMesh : public UJunoActionConfig
{ 
public:
	class UStaticMesh*                                 StaticMesh;                                                 // 0x0038   (0x0008)  
};

/// Class /Script/JunoGameNative.JunoActorAttributeOverrideComponent
/// Size: 0x0018 (0x0000A0 - 0x0000B8)
class UJunoActorAttributeOverrideComponent : public UFortBuildingActorTagComponent
{ 
public:
	FDataRegistryType                                  AttributeOverrideDataRegistry;                              // 0x00A0   (0x0004)  
	FDataRegistryId                                    DataRegistryItemId;                                         // 0x00A4   (0x0008)  
	unsigned char                                      UnknownData00_6[0xC];                                       // 0x00AC   (0x000C)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoActorAttributeOverrideComponent.SetupHealthAttributeSet
	// void SetupHealthAttributeSet();                                                                                       // [0xbb95ef8] Final|Native|Protected 
	// Function /Script/JunoGameNative.JunoActorAttributeOverrideComponent.GetSecondaryLootTier
	// FName GetSecondaryLootTier();                                                                                         // [0xbb95814] Final|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoActorAttributeOverrideComponent.GetPrimaryLootTier
	// FName GetPrimaryLootTier();                                                                                           // [0xbb957dc] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/JunoGameNative.JunoActorInstancesReportHandler
/// Size: 0x0028 (0x000028 - 0x000050)
class UJunoActorInstancesReportHandler : public UObject
{ 
public:
	unsigned char                                      UnknownData00_1[0x28];                                      // 0x0028   (0x0028)  MISSED
};

/// Class /Script/JunoGameNative.JunoPersistenceFeatureDataActor
/// Size: 0x0040 (0x000290 - 0x0002D0)
class AJunoPersistenceFeatureDataActor : public AInfo
{ 
public:
	unsigned char                                      UnknownData00_2[0x28];                                      // 0x0290   (0x0028)  MISSED
	FGuid                                              SavedActorGuid;                                             // 0x02B8   (0x0010)  
	int32_t                                            Version;                                                    // 0x02C8   (0x0004)  
	bool                                               bSpawnedByLevelSaveRecord;                                  // 0x02CC   (0x0001)  
	bool                                               bForceDirty;                                                // 0x02CD   (0x0001)  
	bool                                               bDirty;                                                     // 0x02CE   (0x0001)  
	unsigned char                                      UnknownData01_6[0x1];                                       // 0x02CF   (0x0001)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoPersistenceFeatureDataActor.OnPersistentDataModified
	// void OnPersistentDataModified();                                                                                      // [0x60d2114] Native|Protected|BlueprintCallable 
};

/// Struct /Script/JunoGameNative.SavedAIData_BaseType
/// Size: 0x0001 (0x000000 - 0x000001)
struct FSavedAIData_BaseType
{ 
	unsigned char                                      UnknownData00_1[0x1];                                       // 0x0000   (0x0001)  MISSED
};

/// Struct /Script/JunoGameNative.SavedGlobalAIData_FTUE
/// Size: 0x0027 (0x000001 - 0x000028)
struct FSavedGlobalAIData_FTUE : FSavedAIData_BaseType
{ 
	FGameplayTag                                       PickedFTUENPC;                                              // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0004   (0x0004)  MISSED
	FVector                                            FTUEStartLocation;                                          // 0x0008   (0x0018)  
	bool                                               bFTUEWasEverCompleted;                                      // 0x0020   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0021   (0x0007)  MISSED
};

/// Struct /Script/JunoGameNative.SavedGlobalAIData_Rewards
/// Size: 0x004F (0x000001 - 0x000050)
struct FSavedGlobalAIData_Rewards : FSavedAIData_BaseType
{ 
	SDK_UNDEFINED(80,11833) /* TMap<FName, int32_t> */ __um(CountOfRewardedLootTierGroups);                        // 0x0000   (0x0050)  
};

/// Struct /Script/JunoGameNative.SavedGlobalAIData_WorldSettings
/// Size: 0x0002 (0x000001 - 0x000003)
struct FSavedGlobalAIData_WorldSettings : FSavedAIData_BaseType
{ 
	bool                                               bEnableFriendlyCreatures;                                   // 0x0000   (0x0001)  
	bool                                               bEnableHostileCreatures;                                    // 0x0001   (0x0001)  
	bool                                               bEnableFriendlyNPCs;                                        // 0x0002   (0x0001)  
};

/// Struct /Script/JunoGameNative.SavedGlobalAIData_RecruitmentObjectData
/// Size: 0x004F (0x000001 - 0x000050)
struct FSavedGlobalAIData_RecruitmentObjectData : FSavedAIData_BaseType
{ 
	SDK_UNDEFINED(80,11834) /* TMap<FGuid, FJunoRecruitmentObjectAssignedData> */ __um(RecruitmentObjectToAssignedData); // 0x0000   (0x0050)  
};

/// Struct /Script/JunoGameNative.SavedGlobalAIData
/// Size: 0x00D0 (0x000000 - 0x0000D0)
struct FSavedGlobalAIData
{ 
	FSavedGlobalAIData_FTUE                            FTUE;                                                       // 0x0000   (0x0028)  
	FSavedGlobalAIData_Rewards                         Rewards;                                                    // 0x0028   (0x0050)  
	FSavedGlobalAIData_WorldSettings                   WorldSettings;                                              // 0x0078   (0x0003)  
	unsigned char                                      UnknownData00_5[0x5];                                       // 0x007B   (0x0005)  MISSED
	FSavedGlobalAIData_RecruitmentObjectData           RecruitmentObjectData;                                      // 0x0080   (0x0050)  
};

/// Struct /Script/JunoGameNative.SavedAIDataManager
/// Size: 0x0120 (0x000000 - 0x000120)
struct FSavedAIDataManager
{ 
	SDK_UNDEFINED(80,11835) /* TMap<FGameplayTag, FSavedAIData> */ __um(SavedAIDataPerUniqueAIIdentifier);         // 0x0000   (0x0050)  
	FSavedGlobalAIData                                 SavedGlobalAIData;                                          // 0x0050   (0x00D0)  
};

/// Class /Script/JunoGameNative.JunoAIPersistenceFeatureDataActor
/// Size: 0x0130 (0x0002D0 - 0x000400)
class AJunoAIPersistenceFeatureDataActor : public AJunoPersistenceFeatureDataActor
{ 
public:
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x02D0   (0x0010)  MISSED
	FSavedAIDataManager                                SavedAIData;                                                // 0x02E0   (0x0120)  
};

/// Class /Script/JunoGameNative.JunoAIPersistenceFeatureDataInterface
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoAIPersistenceFeatureDataInterface : public UInterface
{ 
public:
};

/// Class /Script/JunoGameNative.JunoAIPersistenceFeatureModule
/// Size: 0x0000 (0x0000E0 - 0x0000E0)
class UJunoAIPersistenceFeatureModule : public UPersistenceFrameworkModule
{ 
public:
};

/// Class /Script/JunoGameNative.JunoBasePFWContainer
/// Size: 0x00A0 (0x000140 - 0x0001E0)
class UJunoBasePFWContainer : public UPersistenceFrameworkContainer
{ 
public:
	unsigned char                                      UnknownData00_1[0xA0];                                      // 0x0140   (0x00A0)  MISSED
};

/// Class /Script/JunoGameNative.JunoBasePFWPersistenceFeatureDataContainer
/// Size: 0x0000 (0x0001E0 - 0x0001E0)
class UJunoBasePFWPersistenceFeatureDataContainer : public UJunoBasePFWContainer
{ 
public:
};

/// Class /Script/JunoGameNative.JunoAIPersistenceFeatureData_Container
/// Size: 0x0000 (0x0001E0 - 0x0001E0)
class UJunoAIPersistenceFeatureData_Container : public UJunoBasePFWPersistenceFeatureDataContainer
{ 
public:
};

/// Class /Script/JunoGameNative.JunoAlterationCraftingComponent
/// Size: 0x0010 (0x0000A0 - 0x0000B0)
class UJunoAlterationCraftingComponent : public UGameFrameworkComponent
{ 
public:
	SDK_UNDEFINED(8,11836) /* TWeakObjectPtr<UCraftingObjectComponent*> */ __um(CachedCraftingObjectComponent);    // 0x00A0   (0x0008)  
	FDataRegistryType                                  WeaponEssenceDataRegistryType;                              // 0x00A8   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x00AC   (0x0004)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoAlterationCraftingComponent.OnCraftingSuccess
	// void OnCraftingSuccess(FCraftingObjectSuccessEvent& Event);                                                           // [0xbb989f8] Final|Native|Private|HasOutParms 
	// Function /Script/JunoGameNative.JunoAlterationCraftingComponent.OnCheckValidItemType
	// bool OnCheckValidItemType(class AFortPlayerController* Instigator);                                                   // [0x8624e08] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoAlterationCraftingComponent.HandleCraftingStateChanged
	// void HandleCraftingStateChanged(FCraftingObjectStateChangedEvent& Event);                                             // [0xbb9895c] Final|Native|Private|HasOutParms 
};

/// Class /Script/JunoGameNative.JunoAnalytics
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoAnalytics : public UObject
{ 
public:
};

/// Class /Script/JunoGameNative.JunoAnimNotifyState_QueueInput
/// Size: 0x0068 (0x000030 - 0x000098)
class UJunoAnimNotifyState_QueueInput : public UAnimNotifyState
{ 
public:
	bool                                               bQueueMantisInput;                                          // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0031   (0x0007)  MISSED
	FGameplayTagContainer                              GameplayEventTagsToQueue;                                   // 0x0038   (0x0020)  
	FGameplayTagContainer                              AbilityTagsToRemove;                                        // 0x0058   (0x0020)  
	FGameplayTagContainer                              AbilityTagsToAdd;                                           // 0x0078   (0x0020)  
};

/// Class /Script/JunoGameNative.JunoAnimNotifyState_MakeInterruptible
/// Size: 0x0040 (0x000030 - 0x000070)
class UJunoAnimNotifyState_MakeInterruptible : public UAnimNotifyState
{ 
public:
	FGameplayTagContainer                              AbilityTagsToRemove;                                        // 0x0030   (0x0020)  
	FGameplayTagContainer                              AbilityTagsToAdd;                                           // 0x0050   (0x0020)  
};

/// Class /Script/JunoGameNative.JunoAsyncAction_WaitForEventRouter
/// Size: 0x0030 (0x000030 - 0x000060)
class UJunoAsyncAction_WaitForEventRouter : public UBlueprintAsyncActionBase
{ 
public:
	SDK_UNDEFINED(16,11837) /* FMulticastInlineDelegate */ __um(OnGameplayEventRouterAvailable);                   // 0x0030   (0x0010)  
	unsigned char                                      UnknownData00_6[0x20];                                      // 0x0040   (0x0020)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoAsyncAction_WaitForEventRouter.WaitForEventRouter
	// class UJunoAsyncAction_WaitForEventRouter* WaitForEventRouter(class AActor* ContextActor);                            // [0xbb98da8] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoAsyncAction_WaitForEventRouter.onGameplayEventRouterAvailable__DelegateSignature
	// void onGameplayEventRouterAvailable__DelegateSignature(class UGameplayEventRouterComponent* EventRouter);             // [0x2047e54] MulticastDelegate|Public|Delegate 
};

/// Class /Script/JunoGameNative.JunoBuilderToolSelectedActorInterface
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoBuilderToolSelectedActorInterface : public UInterface
{ 
public:


	/// Functions
	// Function /Script/JunoGameNative.JunoBuilderToolSelectedActorInterface.ReceiveSpawnedByBuilderTool
	// void ReceiveSpawnedByBuilderTool(class AJunoBuilderTool* BuilderTool, class UJunoBuilderToolInteractionBehavior* Behavior); // [0xbb98c68] Native|Event|Public|BlueprintEvent 
	// Function /Script/JunoGameNative.JunoBuilderToolSelectedActorInterface.ReceiveSelectionSpawnedByBuilderTool
	// void ReceiveSelectionSpawnedByBuilderTool(class AJunoBuilderTool* BuilderTool, class UJunoBuilderToolInteractionBehavior* Behavior, FJunoBuilderToolSelectionSpawnParams& SelectionSpawnParameters); // [0xbb98aa0] Native|Event|Public|HasOutParms|BlueprintEvent 
};

/// Class /Script/JunoGameNative.JunoBuildingConnectivityBlueprintLibrary
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoBuildingConnectivityBlueprintLibrary : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/JunoGameNative.JunoBuildingConnectivityBlueprintLibrary.GetKnobs
	// TArray<FJunoBuildingConnectionPoint> GetKnobs(FJunoBuildingConnectionPointsResult& Result);                           // [0xbb98228] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/JunoGameNative.JunoBuildingConnectivityBlueprintLibrary.GetAtomModelAssetUserData
	// TArray<UAtomModelAssetUserData*> GetAtomModelAssetUserData(class UObject* Object);                                    // [0xbb98130] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoBuildingConnectivityBlueprintLibrary.DebugDrawConnections
	// void DebugDrawConnections(class UObject* WorldContextObject, FJunoBuildingConnectionPointsResult& Candidates, FJunoBuildingConnectionPointsResult& Targets, FJunoBuildingConnection& ChosenConnection, TArray<FJunoBuildingConnection>& Connections); // [0xbb97ee8] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoBuildingConnectivityBlueprintLibrary.DebugDrawConnectionLocations
	// void DebugDrawConnectionLocations(class UObject* WorldContextObject, FJunoBuildingConnection& Connection);            // [0xbb97dbc] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
};

/// Class /Script/JunoGameNative.JunoBuildingProp
/// Size: 0x0048 (0x000BC8 - 0x000C10)
class AJunoBuildingProp : public ABuildingProp
{ 
public:
	unsigned char                                      UnknownData00_2[0x20];                                      // 0x0BC8   (0x0020)  MISSED
	class UJunoHarvestingComponent*                    HarvestingComponent;                                        // 0x0BE8   (0x0008)  
	class UJunoPhysicsPersistenceComponent*            PhysicsPersistenceComponent;                                // 0x0BF0   (0x0008)  
	unsigned char                                      UnknownData01_5[0x10];                                      // 0x0BF8   (0x0010)  MISSED
	class UFortItemDefinition*                         AssociatedItem;                                             // 0x0C08   (0x0008)  


	/// Functions
	// Function /Script/JunoGameNative.JunoBuildingProp.GetAssociatedItem
	// class UFortItemDefinition* GetAssociatedItem();                                                                       // [0xbcc3c00] Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/JunoGameNative.JunoBuildingPropTree
/// Size: 0x0008 (0x000C10 - 0x000C18)
class AJunoBuildingPropTree : public AJunoBuildingProp
{ 
public:
	class UActorComponent*                             LifeCycleComponent;                                         // 0x0C10   (0x0008)  


	/// Functions
	// Function /Script/JunoGameNative.JunoBuildingPropTree.BlueprintCanDieInLifecyclePhase
	// bool BlueprintCanDieInLifecyclePhase(char CurrentPhaseIndex);                                                         // [0x2047e54] BlueprintAuthorityOnly|Event|Protected|BlueprintEvent 
};

/// Class /Script/JunoGameNative.JunoCampActor
/// Size: 0x0090 (0x000290 - 0x000320)
class AJunoCampActor : public AActor
{ 
public:
	unsigned char                                      UnknownData00_2[0x60];                                      // 0x0290   (0x0060)  MISSED
	FGuid                                              SavedActorGuid;                                             // 0x02F0   (0x0010)  
	unsigned char                                      UnknownData01_5[0x8];                                       // 0x0300   (0x0008)  MISSED
	class UOverlapComponent*                           BoundsComponent;                                            // 0x0308   (0x0008)  
	unsigned char                                      UnknownData02_6[0x10];                                      // 0x0310   (0x0010)  MISSED
};

/// Class /Script/JunoGameNative.JunoCampCenterComponent
/// Size: 0x00D8 (0x0000A0 - 0x000178)
class UJunoCampCenterComponent : public UGameFrameworkComponent
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x00A0   (0x0008)  MISSED
	SDK_UNDEFINED(16,11838) /* FMulticastInlineDelegate */ __um(OnJunoCampAwesomeLevelChangedDelegate);            // 0x00A8   (0x0010)  
	SDK_UNDEFINED(16,11839) /* FMulticastInlineDelegate */ __um(OnJunoCampAwesomePointModificationDelegate);       // 0x00B8   (0x0010)  
	unsigned char                                      UnknownData01_5[0x30];                                      // 0x00C8   (0x0030)  MISSED
	class UClass*                                      CampActorClassToSpawn;                                      // 0x00F8   (0x0008)  
	FGameplayTag                                       CampCenterDestructionDeathReasonTag;                        // 0x0100   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x0104   (0x0004)  MISSED
	class UJunoAsyncAction_WaitForEventRouter*         WaitForEventRouterAction;                                   // 0x0108   (0x0008)  
	FGuid                                              LinkedCampActorID;                                          // 0x0110   (0x0010)  
	unsigned char                                      UnknownData03_6[0x58];                                      // 0x0120   (0x0058)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoCampCenterComponent.OnCampAwesomePointModification
	// void OnCampAwesomePointModification(FJunoEvent_CampAwesomePointsModified& Payload);                                   // [0xbb9c510] Final|Native|Protected|HasOutParms 
	// Function /Script/JunoGameNative.JunoCampCenterComponent.OnCampAwesomeLevelChanged
	// void OnCampAwesomeLevelChanged(FJunoEvent_CampAwesomeLevelChanged& Payload);                                          // [0xbb9c478] Final|Native|Protected|HasOutParms 
	// Function /Script/JunoGameNative.JunoCampCenterComponent.NotifyOwnerPlacedByBuilderTool
	// void NotifyOwnerPlacedByBuilderTool(class AFortPlayerController* FortPC);                                             // [0xbb9c368] Final|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoCampCenterComponent.HandleSmartObjectEvent
	// void HandleSmartObjectEvent(FSmartObjectEventData& SmartObjectEventData, class AActor* Actor);                        // [0xbb9bf20] Final|Native|Private|HasOutParms 
};

/// Class /Script/JunoGameNative.JunoCampComponentBase
/// Size: 0x0000 (0x0000A0 - 0x0000A0)
class UJunoCampComponentBase : public UGameFrameworkComponent
{ 
public:
};

/// Struct /Script/JunoGameNative.JunoMarker
/// Size: 0x0098 (0x000000 - 0x000098)
struct FJunoMarker
{ 
	FVector                                            Location;                                                   // 0x0000   (0x0018)  
	class UTexture*                                    Icon;                                                       // 0x0018   (0x0008)  
	FColor                                             Color;                                                      // 0x0020   (0x0004)  
	bool                                               bOverrideColor;                                             // 0x0024   (0x0001)  
	bool                                               bEnableMarkerCustomization;                                 // 0x0025   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0026   (0x0002)  MISSED
	float                                              TimeLeft;                                                   // 0x0028   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x002C   (0x0004)  MISSED
	FUniqueNetIdRepl                                   AttachedPlayerNetId;                                        // 0x0030   (0x0030)  
	FGuid                                              VolumeId;                                                   // 0x0060   (0x0010)  
	FName                                              SettingsName;                                               // 0x0070   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x0074   (0x0004)  MISSED
	class UMaterialInstanceDynamic*                    MaterialInstanceDynamic;                                    // 0x0078   (0x0008)  
	FName                                              IconParamName;                                              // 0x0080   (0x0004)  
	FName                                              ColorParamName;                                             // 0x0084   (0x0004)  
	FDataTableRowHandle                                CustomizationOptionsHandle;                                 // 0x0088   (0x0010)  
};

/// Class /Script/JunoGameNative.JunoMarkerComponent
/// Size: 0x00B0 (0x0000A0 - 0x000150)
class UJunoMarkerComponent : public UActorComponent
{ 
public:
	FJunoMarker                                        Settings;                                                   // 0x00A0   (0x0098)  
	unsigned char                                      UnknownData00_5[0x10];                                      // 0x0138   (0x0010)  MISSED
	bool                                               bShouldCreateMarkerOnStart;                                 // 0x0148   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0149   (0x0007)  MISSED
};

/// Class /Script/JunoGameNative.JunoCampMarkerComponent
/// Size: 0x0000 (0x000150 - 0x000150)
class UJunoCampMarkerComponent : public UJunoMarkerComponent
{ 
public:
};

/// Class /Script/JunoGameNative.JunoCampMembershipActorComponent
/// Size: 0x0088 (0x0000E0 - 0x000168)
class UJunoCampMembershipActorComponent : public UFortAthenaTrackableAIObjectComponent
{ 
public:
	SDK_UNDEFINED(16,11840) /* FMulticastInlineDelegate */ __um(OnJunoCampMembershipChanged);                      // 0x00E0   (0x0010)  
	unsigned char                                      UnknownData00_5[0x18];                                      // 0x00F0   (0x0018)  MISSED
	SDK_UNDEFINED(8,11841) /* TWeakObjectPtr<AJunoCampActor*> */ __um(BoundCamp);                                  // 0x0108   (0x0008)  
	unsigned char                                      UnknownData01_5[0x30];                                      // 0x0110   (0x0030)  MISSED
	FScalableFloat                                     ToleranceForMovementUpdates;                                // 0x0140   (0x0028)  


	/// Functions
	// Function /Script/JunoGameNative.JunoCampMembershipActorComponent.OnRep_BoundCamp
	// void OnRep_BoundCamp();                                                                                               // [0xbb9c5bc] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoCampMembershipActorComponent.HasCampAtLocation
	// bool HasCampAtLocation(class UObject* WorldContextObject, FVector& Location);                                         // [0xbb9c1e8] Final|RequiredAPI|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoCampMembershipActorComponent.HasCampAtBounds
	// bool HasCampAtBounds(class UObject* WorldContextObject, FBox& Bounds);                                                // [0xbb9c0cc] Final|RequiredAPI|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoCampMembershipActorComponent.HandleBoundCampEndPlayEvent
	// void HandleBoundCampEndPlayEvent(class AActor* InOwner, TEnumAsByte<EEndPlayReason> EndPlayReason);                   // [0xbb9b8bc] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoCampMembershipActorComponent.GetBoundComponent
	// class UActorComponent* GetBoundComponent(class UClass* ComponentClass);                                               // [0xbb9b7d4] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoCampMembershipActorComponent.GetBoundCamp
	// class AJunoCampActor* GetBoundCamp();                                                                                 // [0xbb9b7b0] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoCampMembershipActorComponent.FindOrCreateCampMembershipComponentAndReturnComponent
	// class UActorComponent* FindOrCreateCampMembershipComponentAndReturnComponent(class UClass* ComponentClass, class AActor* Owner); // [0xbb9b61c] Final|RequiredAPI|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoCampMembershipActorComponent.FindOrCreateCampMembershipActorComponentOnActor
	// class UJunoCampMembershipActorComponent* FindOrCreateCampMembershipActorComponentOnActor(class AActor* Owner);        // [0xbb9b55c] Final|RequiredAPI|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoCampMembershipActorComponent.FindCampMembershipComponentAndReturnComponent
	// class UActorComponent* FindCampMembershipComponentAndReturnComponent(class UClass* ComponentClass, class AActor* Owner); // [0xbb9b3e8] Final|RequiredAPI|Native|Static|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoCampMembershipActorComponent.FindCampMembershipActorComponentOnActor
	// class UJunoCampMembershipActorComponent* FindCampMembershipActorComponentOnActor(class AActor* Owner);                // [0xbb9b31c] Final|RequiredAPI|Native|Static|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoCampMembershipActorComponent.FindBindableLocalCampForLocation
	// class AJunoCampActor* FindBindableLocalCampForLocation(class UObject* WorldContextObject, FVector& Location);         // [0xbb9b1c8] Final|RequiredAPI|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoCampMembershipActorComponent.FindBindableLocalCampForArea
	// class AJunoCampActor* FindBindableLocalCampForArea(class AActor* Actor, FBox& AreaBox);                               // [0xbb9b038] Final|RequiredAPI|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoCampMembershipActorComponent.FindBindableLocalCampForActorAndReturnComponent
	// class UActorComponent* FindBindableLocalCampForActorAndReturnComponent(class UClass* ComponentClass, class AActor* Actor); // [0xbb9aec0] Final|RequiredAPI|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoCampMembershipActorComponent.FindBindableLocalCampForActor
	// class AJunoCampActor* FindBindableLocalCampForActor(class AActor* Actor);                                             // [0xbb9ae00] Final|RequiredAPI|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoCampMembershipActorComponent.FindBindableLocalCampAtLocationAndReturnComponent
	// class UActorComponent* FindBindableLocalCampAtLocationAndReturnComponent(class UClass* ComponentClass, class UObject* WorldContextObject, FVector& Location); // [0xbb9ac00] Final|RequiredAPI|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoCampMembershipActorComponent.AttemptToBindToCamp
	// void AttemptToBindToCamp();                                                                                           // [0xbb9ab40] Final|Native|Private 
};

/// Struct /Script/JunoGameNative.AwesomeLevelSaveData
/// Size: 0x0058 (0x000000 - 0x000058)
struct FAwesomeLevelSaveData
{ 
	int32_t                                            AwesomePoints;                                              // 0x0000   (0x0004)  
	int32_t                                            AwesomeLevel;                                               // 0x0004   (0x0004)  
	SDK_UNDEFINED(80,11842) /* TSet<FGuid> */          __um(AwesomePrefabIDs);                                     // 0x0008   (0x0050)  
};

/// Struct /Script/JunoGameNative.AICampManagementSaveData
/// Size: 0x0020 (0x000000 - 0x000020)
struct FAICampManagementSaveData
{ 
	int64_t                                            LastPassiveResourceGatheringSimulatedJunoRealTime;          // 0x0000   (0x0008)  
	int64_t                                            CampCreationTime;                                           // 0x0008   (0x0008)  
	int64_t                                            FirstRecruitedNPCTime;                                      // 0x0010   (0x0008)  
	int64_t                                            LastVisitorsUpdateTime;                                     // 0x0018   (0x0008)  
};

/// Struct /Script/JunoGameNative.NamedPOISaveData
/// Size: 0x00B0 (0x000000 - 0x0000B0)
struct FNamedPOISaveData
{ 
	SDK_UNDEFINED(24,11843) /* FText */                __um(POIName);                                              // 0x0000   (0x0018)  
	FJunoMarker                                        Marker;                                                     // 0x0018   (0x0098)  
};

/// Class /Script/JunoGameNative.JunoCampPersistenceComponent
/// Size: 0x0160 (0x0000A0 - 0x000200)
class UJunoCampPersistenceComponent : public UJunoCampComponentBase
{ 
public:
	unsigned char                                      UnknownData00_2[0x20];                                      // 0x00A0   (0x0020)  MISSED
	FAwesomeLevelSaveData                              AwesomeLevelSaveData;                                       // 0x00C0   (0x0058)  
	FAICampManagementSaveData                          AICampManagementSaveData;                                   // 0x0118   (0x0020)  
	FNamedPOISaveData                                  NamedPOISaveData;                                           // 0x0138   (0x00B0)  
	unsigned char                                      UnknownData01_6[0x18];                                      // 0x01E8   (0x0018)  MISSED
};

/// Class /Script/JunoGameNative.JunoCampPersistenceFeatureModule
/// Size: 0x0000 (0x0000E0 - 0x0000E0)
class UJunoCampPersistenceFeatureModule : public UPersistenceFrameworkModule
{ 
public:
};

/// Class /Script/JunoGameNative.JunoCampPersistenceFeatureData_Container
/// Size: 0x0000 (0x0001E0 - 0x0001E0)
class UJunoCampPersistenceFeatureData_Container : public UJunoBasePFWPersistenceFeatureDataContainer
{ 
public:
};

/// Struct /Script/JunoGameNative.ActiveCampNPCEntry
/// Size: 0x0088 (0x000000 - 0x000088)
struct FActiveCampNPCEntry
{ 
	FGameplayTag                                       UniqueAIIdentifier;                                         // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0004   (0x0004)  MISSED
	SDK_UNDEFINED(24,11844) /* FText */                __um(DisplayName);                                          // 0x0008   (0x0018)  
	FGameplayTag                                       RoleTag;                                                    // 0x0020   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0024   (0x0004)  MISSED
	SDK_UNDEFINED(32,11845) /* TWeakObjectPtr<UTexture2D*> */ __um(NPCIconSmall);                                  // 0x0028   (0x0020)  
	SDK_UNDEFINED(32,11846) /* TWeakObjectPtr<UTexture2D*> */ __um(NPCIconLarge);                                  // 0x0048   (0x0020)  
	SDK_UNDEFINED(32,11847) /* TWeakObjectPtr<UTexture2D*> */ __um(NPCIconWide);                                   // 0x0068   (0x0020)  
};

/// Class /Script/JunoGameNative.JunoCampRecruitmentComponent
/// Size: 0x0050 (0x0000A0 - 0x0000F0)
class UJunoCampRecruitmentComponent : public UJunoCampComponentBase
{ 
public:
	unsigned char                                      UnknownData00_2[0x40];                                      // 0x00A0   (0x0040)  MISSED
	TArray<FActiveCampNPCEntry>                        ActiveNPCEntries;                                           // 0x00E0   (0x0010)  


	/// Functions
	// Function /Script/JunoGameNative.JunoCampRecruitmentComponent.GetActiveNPCEntries
	// TArray<FActiveCampNPCEntry> GetActiveNPCEntries();                                                                    // [0xbb9b778] Final|Native|Public|BlueprintCallable|BlueprintPure 
};

/// Struct /Script/JunoGameNative.JunoRecruitmentObjectAssignedData
/// Size: 0x0080 (0x000000 - 0x000080)
struct FJunoRecruitmentObjectAssignedData
{ 
	FGuid                                              CampGuid;                                                   // 0x0000   (0x0010)  
	FGameplayTag                                       UniqueAIIdentifier;                                         // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	FUniqueNetIdRepl                                   PlayerNetId;                                                // 0x0018   (0x0030)  
	SDK_UNDEFINED(24,11848) /* FText */                __um(DisplayText);                                          // 0x0048   (0x0018)  
	SDK_UNDEFINED(32,11849) /* TWeakObjectPtr<UTexture2D*> */ __um(NPCPortrait);                                   // 0x0060   (0x0020)  
};

/// Class /Script/JunoGameNative.JunoCampRecruitmentObjectComponent
/// Size: 0x00E8 (0x0000A0 - 0x000188)
class UJunoCampRecruitmentObjectComponent : public UGameFrameworkComponent
{ 
public:
	SDK_UNDEFINED(16,11850) /* FMulticastInlineDelegate */ __um(OnJunoRecruitmentObjectAssignedChangedDelegate);   // 0x00A0   (0x0010)  
	unsigned char                                      UnknownData00_5[0x18];                                      // 0x00B0   (0x0018)  MISSED
	SDK_UNDEFINED(16,11851) /* FMulticastInlineDelegate */ __um(OnJunoRecruitmentObjectEnableChangeDelegate);      // 0x00C8   (0x0010)  
	bool                                               bIsEnabled;                                                 // 0x00D8   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x00D9   (0x0007)  MISSED
	FJunoRecruitmentObjectAssignedData                 CachedAssignedData;                                         // 0x00E0   (0x0080)  
	unsigned char                                      UnknownData02_6[0x28];                                      // 0x0160   (0x0028)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoCampRecruitmentObjectComponent.OnRep_bIsEnabled
	// void OnRep_bIsEnabled();                                                                                              // [0xbb9c5f0] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoCampRecruitmentObjectComponent.OnRep_AssignedData
	// void OnRep_AssignedData();                                                                                            // [0xbb9c5a8] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoCampRecruitmentObjectComponent.IsEnabled
	// bool IsEnabled();                                                                                                     // [0x84381f0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoCampRecruitmentObjectComponent.IsAssignedToPlayer
	// bool IsAssignedToPlayer();                                                                                            // [0xbb9c33c] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoCampRecruitmentObjectComponent.IsAssignedToAI
	// bool IsAssignedToAI();                                                                                                // [0x843a4c0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoCampRecruitmentObjectComponent.HandleOnEmptyRecrutmentObjectInteracted
	// void HandleOnEmptyRecrutmentObjectInteracted(class AFortPlayerController* InteractingController);                     // [0xbb9be50] Final|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoCampRecruitmentObjectComponent.HandleDied
	// void HandleDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, FVector HitLocation, class UPrimitiveComponent* FHitComponent, FName BoneName, FVector Momentum); // [0xbb9b9fc] Final|Native|Private|HasDefaults 
	// Function /Script/JunoGameNative.JunoCampRecruitmentObjectComponent.GetAssignedData
	// FJunoRecruitmentObjectAssignedData GetAssignedData();                                                                 // [0xbb9b794] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoCampRecruitmentObjectComponent.CostlyFindAssignableNPCs
	// bool CostlyFindAssignableNPCs(TArray<FGameplayTag>& OutAssignableNPCs);                                               // [0xbb9ab54] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoCampRecruitmentObjectComponent.AssignToPlayer
	// void AssignToPlayer(class AFortPlayerController* PlayerController, bool bCheckForDuplicateRecruitmentObjects);        // [0xbb9aa00] Final|Native|Public|BlueprintCallable 
};

/// Struct /Script/JunoGameNative.JunoCampRemovalStatusData
/// Size: 0x000C (0x000000 - 0x00000C)
struct FJunoCampRemovalStatusData
{ 
	bool                                               bIsSoftRemoved;                                             // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0001   (0x0003)  MISSED
	float                                              RemainingRealSecondsBeforeHardRemoval;                      // 0x0004   (0x0004)  
	bool                                               bIsInitialized;                                             // 0x0008   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0009   (0x0003)  MISSED
};

/// Class /Script/JunoGameNative.JunoCampRemovalStatusComponent
/// Size: 0x0058 (0x0000A0 - 0x0000F8)
class UJunoCampRemovalStatusComponent : public UJunoCampComponentBase
{ 
public:
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x00A0   (0x0010)  MISSED
	FScalableFloat                                     SoftRemovalCampComponentUpdateRate;                         // 0x00B0   (0x0028)  
	unsigned char                                      UnknownData01_5[0x8];                                       // 0x00D8   (0x0008)  MISSED
	FJunoCampRemovalStatusData                         CampRemovalStatusData;                                      // 0x00E0   (0x000C)  
	unsigned char                                      UnknownData02_6[0xC];                                       // 0x00EC   (0x000C)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoCampRemovalStatusComponent.OnRep_CampRemovalStatusData
	// void OnRep_CampRemovalStatusData();                                                                                   // [0xbb9c5d0] Final|Native|Private 
};

/// Class /Script/JunoGameNative.JunoCaveContainerInterface
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoCaveContainerInterface : public UInterface
{ 
public:


	/// Functions
	// Function /Script/JunoGameNative.JunoCaveContainerInterface.GetCaveEntrances
	// void GetCaveEntrances(TArray<FTransform>& Transforms);                                                                // [0xbb9e348] Native|Public|HasOutParms|Const 
};

/// Class /Script/JunoGameNative.JunoChaosAudioGameStateComponent
/// Size: 0x02C0 (0x0000A0 - 0x000360)
class UJunoChaosAudioGameStateComponent : public UFortGameStateComponent
{ 
public:
	class UPhysicalMaterial*                           FallbackPhysicalMaterial;                                   // 0x00A0   (0x0008)  
	FName                                              CollisionEventSizeParamName;                                // 0x00A8   (0x0004)  
	FName                                              CollisionTriggerUpdateParamName;                            // 0x00AC   (0x0004)  
	SDK_UNDEFINED(32,11852) /* TWeakObjectPtr<USoundBase*> */ __um(Collision_Loop);                                // 0x00B0   (0x0020)  
	FScalableFloat                                     CollisionMassToSize;                                        // 0x00D0   (0x0028)  
	FScalableFloat                                     CollisionVolumeMultiplier;                                  // 0x00F8   (0x0028)  
	SDK_UNDEFINED(80,11853) /* TMap<UPhysicalMaterial*, FChaosAudioEventSizeSounds> */ __um(CollisionMaterials);   // 0x0120   (0x0050)  
	FName                                              BreakEventSizeParamName;                                    // 0x0170   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0174   (0x0004)  MISSED
	SDK_UNDEFINED(32,11854) /* TWeakObjectPtr<USoundBase*> */ __um(Break_Group_Default);                           // 0x0178   (0x0020)  
	SDK_UNDEFINED(80,11855) /* TMap<UPhysicalMaterial*, USoundBase*> */ __um(BreakGroupMaterialMap);               // 0x0198   (0x0050)  
	FScalableFloat                                     BreakMassToSize;                                            // 0x01E8   (0x0028)  
	FScalableFloat                                     BreakVolumeMultiplier;                                      // 0x0210   (0x0028)  
	SDK_UNDEFINED(80,11856) /* TMap<UPhysicalMaterial*, FChaosAudioEventSizeSounds> */ __um(BreakMaterials);       // 0x0238   (0x0050)  
	SDK_UNDEFINED(80,11857) /* TMap<FGuid, TWeakObjectPtr<UAudioComponent*>> */ __um(CollisionSoundMap);           // 0x0288   (0x0050)  
	SDK_UNDEFINED(80,11858) /* TMap<FGuid, TWeakObjectPtr<UAudioComponent*>> */ __um(BreakSoundMap);               // 0x02D8   (0x0050)  
	class UAudioEventAggregatorSubsystem*              AudioEventAggregatorSubsystem;                              // 0x0328   (0x0008)  
	SDK_UNDEFINED(16,11859) /* TArray<TWeakObjectPtr<USoundBase*>> */ __um(SoftAssets);                            // 0x0330   (0x0010)  
	TArray<class USoundBase*>                          LoadedAssets;                                               // 0x0340   (0x0010)  
	unsigned char                                      UnknownData01_6[0x10];                                      // 0x0350   (0x0010)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoChaosAudioGameStateComponent.UnSubscribeToChaosEventRelayEvents
	// void UnSubscribeToChaosEventRelayEvents();                                                                            // [0xbba10a0] Final|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoChaosAudioGameStateComponent.SubscribeToChaosEventRelayEvents
	// void SubscribeToChaosEventRelayEvents();                                                                              // [0xbba108c] Final|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoChaosAudioGameStateComponent.OnSoundCollisionEvents
	// void OnSoundCollisionEvents(TArray<FSoundCollisionEvent>& SoundCollisionEvents);                                      // [0xbba0224] Final|Native|Private|HasOutParms 
	// Function /Script/JunoGameNative.JunoChaosAudioGameStateComponent.OnSoundBreakEvents
	// void OnSoundBreakEvents(TArray<FSoundBreakEvent>& SoundBreakEvents);                                                  // [0xbb9fb64] Final|Native|Private|HasOutParms 
	// Function /Script/JunoGameNative.JunoChaosAudioGameStateComponent.OnActiveSoundCollisionEventsUpdated
	// void OnActiveSoundCollisionEventsUpdated(TArray<FSoundCollisionEvent>& SoundCollisionEvents);                         // [0xbb9f14c] Final|Native|Private|HasOutParms 
	// Function /Script/JunoGameNative.JunoChaosAudioGameStateComponent.OnActiveSoundCollisionEventSoundFinished
	// void OnActiveSoundCollisionEventSoundFinished(class UAudioComponent* Component);                                      // [0xbb9f08c] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoChaosAudioGameStateComponent.OnActiveSoundBreakEventsUpdated
	// void OnActiveSoundBreakEventsUpdated(TArray<FSoundBreakEvent>& SoundBreakEvents);                                     // [0xbb9e9cc] Final|Native|Private|HasOutParms 
	// Function /Script/JunoGameNative.JunoChaosAudioGameStateComponent.OnActiveSoundBreakEventSoundFinished
	// void OnActiveSoundBreakEventSoundFinished(class UAudioComponent* Component);                                          // [0xbb9e90c] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoChaosAudioGameStateComponent.GetSingleChaosEventSound
	// class USoundBase* GetSingleChaosEventSound(TMap<UPhysicalMaterial*, FChaosAudioEventSizeSounds> ChaosEventMaterials, class UPhysicalMaterial* Material, char EventSize); // [0xbb9e5a0] Final|Native|Private 
};

/// Class /Script/JunoGameNative.JunoCheatProfilerSubsystem
/// Size: 0x0078 (0x000040 - 0x0000B8)
class UJunoCheatProfilerSubsystem : public UTickableWorldSubsystem
{ 
public:
	unsigned char                                      UnknownData00_1[0x78];                                      // 0x0040   (0x0078)  MISSED
};

/// Class /Script/JunoGameNative.JunoClosedDoorNavArea
/// Size: 0x0000 (0x000048 - 0x000048)
class UJunoClosedDoorNavArea : public UNavArea
{ 
public:
};

/// Class /Script/JunoGameNative.JunoClusterUnionComponent
/// Size: 0x0090 (0x000740 - 0x0007D0)
class UJunoClusterUnionComponent : public UClusterUnionComponent
{ 
public:
	unsigned char                                      UnknownData00_1[0x90];                                      // 0x0740   (0x0090)  MISSED
};

/// Class /Script/JunoGameNative.JunoComponent_HealthIndicator
/// Size: 0x0040 (0x0000A0 - 0x0000E0)
class UJunoComponent_HealthIndicator : public UPawnComponent
{ 
public:
	unsigned char                                      UnknownData00_2[0x20];                                      // 0x00A0   (0x0020)  MISSED
	float                                              Health;                                                     // 0x00C0   (0x0004)  
	float                                              MaxHealth;                                                  // 0x00C4   (0x0004)  
	FVector                                            AttachOffset;                                               // 0x00C8   (0x0018)  


	/// Functions
	// Function /Script/JunoGameNative.JunoComponent_HealthIndicator.OnServerPawnHealthChanged
	// void OnServerPawnHealthChanged();                                                                                     // [0xbb9fb50] Final|Native|Protected 
	// Function /Script/JunoGameNative.JunoComponent_HealthIndicator.OnRep_MaxHealth
	// void OnRep_MaxHealth();                                                                                               // [0xbb9fb0c] Final|Native|Protected 
	// Function /Script/JunoGameNative.JunoComponent_HealthIndicator.OnRep_Health
	// void OnRep_Health();                                                                                                  // [0xbb9fac8] Final|Native|Protected 
};

/// Class /Script/JunoGameNative.JunoComponent_Stamina
/// Size: 0x0000 (0x0002E8 - 0x0002E8)
class UJunoComponent_Stamina : public UFortComponent_Energy
{ 
public:


	/// Functions
	// Function /Script/JunoGameNative.JunoComponent_Stamina.SetMaxEnergy
	// void SetMaxEnergy(FScalableFloat NewMaxEnergy);                                                                       // [0xbba0fa4] Final|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoComponent_Stamina.GetMaxEnergy
	// FScalableFloat GetMaxEnergy();                                                                                        // [0xbb9e564] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/JunoGameNative.JunoConnectableActorInterface
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoConnectableActorInterface : public UInterface
{ 
public:
};

/// Class /Script/JunoGameNative.JunoConnectedActorLevelPlayspaceComponent
/// Size: 0x0000 (0x0000F8 - 0x0000F8)
class UJunoConnectedActorLevelPlayspaceComponent : public UFortPlayspaceComponent
{ 
public:
};

/// Class /Script/JunoGameNative.JunoControllerComponent_AFKHandler
/// Size: 0x0068 (0x0000D0 - 0x000138)
class UJunoControllerComponent_AFKHandler : public UFortControllerComponent_AFKHandler
{ 
public:
	class UDataTable*                                  AFKEventsDataTable;                                         // 0x00D0   (0x0008)  
	unsigned char                                      UnknownData00_6[0x60];                                      // 0x00D8   (0x0060)  MISSED
};

/// Struct /Script/JunoGameNative.JunoIndicatorVisibilityQueryEntry
/// Size: 0x0010 (0x000000 - 0x000010)
struct FJunoIndicatorVisibilityQueryEntry
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
	class AFortPawn*                                   Pawn;                                                       // 0x0008   (0x0008)  
};

/// Class /Script/JunoGameNative.JunoControllerComponent_Indicators
/// Size: 0x00B8 (0x0000A8 - 0x000160)
class UJunoControllerComponent_Indicators : public UFortControllerComponent
{ 
public:
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x00A8   (0x0010)  MISSED
	float                                              ShowDistance;                                               // 0x00B8   (0x0004)  
	float                                              HideDistance;                                               // 0x00BC   (0x0004)  
	unsigned char                                      UnknownData01_5[0x10];                                      // 0x00C0   (0x0010)  MISSED
	SDK_UNDEFINED(80,11860) /* TSet<AFortPawn*> */     __um(VisiblePawnsCache);                                    // 0x00D0   (0x0050)  
	TArray<FJunoIndicatorVisibilityQueryEntry>         QueryToPawnEntries;                                         // 0x0120   (0x0010)  
	unsigned char                                      UnknownData02_6[0x30];                                      // 0x0130   (0x0030)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoControllerComponent_Indicators.OnAnyFortPawnDestroyed
	// void OnAnyFortPawnDestroyed(class AActor* FortPawnActor);                                                             // [0xbb9f80c] Final|Native|Private 
};

/// Class /Script/JunoGameNative.JunoControllerComponent_MapMarker
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UJunoControllerComponent_MapMarker : public UFortControllerComponent
{ 
public:


	/// Functions
	// Function /Script/JunoGameNative.JunoControllerComponent_MapMarker.ServerCreateMarker
	// void ServerCreateMarker(FGuid Guid, FJunoMarker NewMarker, FText DisplayName);                                        // [0xbba08e4] Net|NetReliableNative|Event|Public|NetServer|HasDefaults 
	// Function /Script/JunoGameNative.JunoControllerComponent_MapMarker.ClientRequestCustomization
	// void ClientRequestCustomization(FGuid Guid, FJunoMarker NewMarker, FText DisplayName);                                // [0xbb9e130] Net|NetReliableNative|Event|Public|HasDefaults|NetClient 
};

/// Class /Script/JunoGameNative.JunoControllerComponent_SocialSim
/// Size: 0x0010 (0x0000A8 - 0x0000B8)
class UJunoControllerComponent_SocialSim : public UFortControllerComponent
{ 
public:
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x00A8   (0x0010)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoControllerComponent_SocialSim.Server_TriggerVillageSelfDestruct
	// void Server_TriggerVillageSelfDestruct();                                                                             // [0x80910ac] RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoControllerComponent_SocialSim.Server_TriggerAwesomeLevelChange
	// void Server_TriggerAwesomeLevelChange(class AFortPlayerController* TriggeringPlayer);                                 // [0x8919fa4] RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoControllerComponent_SocialSim.OnJunoPlayerPersistenceDataAvailable
	// void OnJunoPlayerPersistenceDataAvailable(FUniqueNetIdRepl& UniquePlayerId, FJunoPlayerSaveData& SaveData);           // [0xbb9f98c] Final|Native|Private|HasOutParms 
};

/// Class /Script/JunoGameNative.JunoCraftingAnalytics
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoCraftingAnalytics : public UObject
{ 
public:
};

/// Class /Script/JunoGameNative.JunoCraftingGameplayAbility
/// Size: 0x0000 (0x000B60 - 0x000B60)
class UJunoCraftingGameplayAbility : public UFortGameplayAbility
{ 
public:
};

/// Struct /Script/JunoGameNative.JunoInventoryGroupConfig
/// Size: 0x0060 (0x000000 - 0x000060)
struct FJunoInventoryGroupConfig
{ 
	FGameplayTag                                       GroupType;                                                  // 0x0000   (0x0004)  
	uint32_t                                           NumItemRows;                                                // 0x0004   (0x0004)  
	uint32_t                                           NumItemColumns;                                             // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x000C   (0x0004)  MISSED
	SDK_UNDEFINED(80,11861) /* TMap<int32_t, FGameplayTagContainer> */ __um(SlotTagMap);                           // 0x0010   (0x0050)  
};

/// Struct /Script/JunoGameNative.JunoInventoryConfig
/// Size: 0x0018 (0x000000 - 0x000018)
struct FJunoInventoryConfig
{ 
	TArray<FJunoInventoryGroupConfig>                  InventoryGroupConfigs;                                      // 0x0000   (0x0010)  
	FGameplayTag                                       GameplayTag;                                                // 0x0010   (0x0004)  
	bool                                               bIsPersistent;                                              // 0x0014   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0015   (0x0003)  MISSED
};

/// Struct /Script/JunoGameNative.JunoInventoryHandle
/// Size: 0x0024 (0x000000 - 0x000024)
struct FJunoInventoryHandle
{ 
	FGuid                                              Guid;                                                       // 0x0000   (0x0010)  
	SDK_UNDEFINED(8,11862) /* TWeakObjectPtr<AJunoInventory*> */ __um(Inventory);                                  // 0x0010   (0x0008)  
	unsigned char                                      UnknownData00_6[0xC];                                       // 0x0018   (0x000C)  MISSED
};

/// Struct /Script/JunoGameNative.JunoItemSlot
/// Size: 0x0044 (0x00000C - 0x000050)
struct FJunoItemSlot : FFastArraySerializerItem
{ 
	FGameplayTag                                       GroupTag;                                                   // 0x000C   (0x0004)  
	FGameplayTagContainer                              SlotTags;                                                   // 0x0010   (0x0020)  
	int32_t                                            RowIndex;                                                   // 0x0030   (0x0004)  
	int32_t                                            ColumnIndex;                                                // 0x0034   (0x0004)  
	FGuid                                              ItemGuid;                                                   // 0x0038   (0x0010)  
	class UFortItem*                                   Item;                                                       // 0x0048   (0x0008)  
};

/// Struct /Script/JunoGameNative.JunoReplicatedItemSlotList
/// Size: 0x0020 (0x000108 - 0x000128)
struct FJunoReplicatedItemSlotList : FFastArraySerializer
{ 
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x0108   (0x0010)  MISSED
	TArray<FJunoItemSlot>                              ItemSlots;                                                  // 0x0118   (0x0010)  
};

/// Struct /Script/JunoGameNative.JunoSelectedSlotData
/// Size: 0x000C (0x000000 - 0x00000C)
struct FJunoSelectedSlotData
{ 
	FGameplayTag                                       GroupTag;                                                   // 0x0000   (0x0004)  
	int32_t                                            RowIndex;                                                   // 0x0004   (0x0004)  
	int32_t                                            ColumnIndex;                                                // 0x0008   (0x0004)  
};

/// Class /Script/JunoGameNative.JunoInventoryComponent
/// Size: 0x0278 (0x0000A0 - 0x000318)
class UJunoInventoryComponent : public UGameFrameworkComponent
{ 
public:
	unsigned char                                      UnknownData00_2[0x70];                                      // 0x00A0   (0x0070)  MISSED
	FJunoInventoryConfig                               InventoryConfig;                                            // 0x0110   (0x0018)  
	FName                                              InventoryLootTierGroup;                                     // 0x0128   (0x0004)  
	bool                                               bShouldDropContentsOnOwnerDeath;                            // 0x012C   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x012D   (0x0003)  MISSED
	float                                              LootTossSpeed;                                              // 0x0130   (0x0004)  
	float                                              LootTossAngle;                                              // 0x0134   (0x0004)  
	FJunoInventoryHandle                               InventoryHandle;                                            // 0x0138   (0x0024)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x015C   (0x0004)  MISSED
	SDK_UNDEFINED(80,11863) /* TMap<FGameplayTag, FJunoItemSlotGroup> */ __um(ItemSlotGroups);                     // 0x0160   (0x0050)  
	FJunoReplicatedItemSlotList                        ReplicatedItemSlotData;                                     // 0x01B0   (0x0128)  
	SDK_UNDEFINED(16,11864) /* FMulticastInlineDelegate */ __um(OnInventoryChangedEvent);                          // 0x02D8   (0x0010)  
	unsigned char                                      UnknownData03_5[0x8];                                       // 0x02E8   (0x0008)  MISSED
	TArray<FJunoSelectedSlotData>                      SelectedItemGroupSlots;                                     // 0x02F0   (0x0010)  
	unsigned char                                      UnknownData04_6[0x18];                                      // 0x0300   (0x0018)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoInventoryComponent.UseOffHandDurability
	// void UseOffHandDurability(float DurabilityPerUse);                                                                    // [0xbc818e0] Final|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoInventoryComponent.ServerTakeItem
	// void ServerTakeItem(FJunoTakeItemRequest Request);                                                                    // [0xbc80a94] RequiredAPI|Net|NetReliableNative|Event|Public|NetServer|NetValidate 
	// Function /Script/JunoGameNative.JunoInventoryComponent.ServerMoveAllItemsPossible
	// void ServerMoveAllItemsPossible(class UJunoInventoryComponent* SourceInventoryComponent, class UJunoInventoryComponent* DestinationInventoryComponent, TArray<FGameplayTag> SourceGroupTags, TArray<FGameplayTag> DestinationGroupTags); // [0xbc7ff14] RequiredAPI|Net|NetReliableNative|Event|Protected|NetServer 
	// Function /Script/JunoGameNative.JunoInventoryComponent.ServerMergeAllItemsPossible
	// void ServerMergeAllItemsPossible(class AActor* TargetInventoryActor);                                                 // [0x80b8a60] RequiredAPI|Net|NetReliableNative|Event|Protected|NetServer 
	// Function /Script/JunoGameNative.JunoInventoryComponent.ServerAttemptItemTransfer
	// void ServerAttemptItemTransfer(FJunoItemTransferRequest Request);                                                     // [0xbc7fd2c] RequiredAPI|Net|NetReliableNative|Event|Protected|NetServer|NetValidate 
	// Function /Script/JunoGameNative.JunoInventoryComponent.ServerAttemptItemMerge
	// void ServerAttemptItemMerge(FJunoItemSlot SourceItemSlot, FJunoItemSlot DestinationItemSlot, class AActor* SourceInventoryActor, class AActor* DestinationInventoryActor, int32_t Count); // [0xbc7f998] RequiredAPI|Net|NetReliableNative|Event|Protected|NetServer|NetValidate 
	// Function /Script/JunoGameNative.JunoInventoryComponent.RemoveItemFromInventory
	// bool RemoveItemFromInventory(FGuid ItemGuid, int32_t Count);                                                          // [0xbc7f794] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoInventoryComponent.OnRep_InventoryHandle
	// void OnRep_InventoryHandle();                                                                                         // [0xbc7f63c] Final|Native|Protected 
	// Function /Script/JunoGameNative.JunoInventoryComponent.OnOwningBuildingActorKilled
	// void OnOwningBuildingActorKilled(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, FVector HitLocation, class UPrimitiveComponent* HitComponent, FName BoneName, FVector Momentum); // [0x86210f0] Final|Native|Private|HasDefaults 
	// Function /Script/JunoGameNative.JunoInventoryComponent.OnInventoryChangedEvent__DelegateSignature
	// void OnInventoryChangedEvent__DelegateSignature(TArray<UFortItem*>& AddedItems, TArray<UFortItem*>& RemovedItems);    // [0x2047e54] MulticastDelegate|Public|Delegate|HasOutParms 
	// Function /Script/JunoGameNative.JunoInventoryComponent.GetOffhandItem
	// class UFortItem* GetOffhandItem();                                                                                    // [0xbc7db1c] Final|RequiredAPI|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoInventoryComponent.GetInventoryItemsInGroups
	// TArray<UFortWorldItem*> GetInventoryItemsInGroups(TArray<FGameplayTag>& Groups);                                      // [0xbc7d9e4] Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoInventoryComponent.GetInventoryItems
	// TArray<UFortWorldItem*> GetInventoryItems();                                                                          // [0xbc7d9a4] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoInventoryComponent.ClientMoveAllItemsPossibleComplete
	// void ClientMoveAllItemsPossibleComplete();                                                                            // [0x2ef340c] RequiredAPI|Net|NetReliableNative|Event|Protected|NetClient 
	// Function /Script/JunoGameNative.JunoInventoryComponent.ClientMergeAllItemsPossibleComplete
	// void ClientMergeAllItemsPossibleComplete();                                                                           // [0x38a9134] RequiredAPI|Net|NetReliableNative|Event|Protected|NetClient 
	// Function /Script/JunoGameNative.JunoInventoryComponent.AddItemToInventory
	// class UFortItem* AddItemToInventory(class UFortItemDefinition* ItemDefinition, int32_t Count);                        // [0xbc7cbf0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/JunoGameNative.JunoCraftingInventoryComponent
/// Size: 0x0000 (0x000318 - 0x000318)
class UJunoCraftingInventoryComponent : public UJunoInventoryComponent
{ 
public:
};

/// Class /Script/JunoGameNative.JunoCraftingLibrary
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoCraftingLibrary : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/JunoGameNative.JunoCraftingLibrary.MakePerPlayerCraftingKey
	// FCraftingMultiKey MakePerPlayerCraftingKey(class AActor* Instigator);                                                 // [0xbb9e84c] Final|RequiredAPI|Native|Static|Public|BlueprintCallable|BlueprintPure 
};

/// Class /Script/JunoGameNative.JunoDeleteActionsReportHandler
/// Size: 0x0018 (0x000028 - 0x000040)
class UJunoDeleteActionsReportHandler : public UObject
{ 
public:
	unsigned char                                      UnknownData00_1[0x18];                                      // 0x0028   (0x0018)  MISSED
};

/// Class /Script/JunoGameNative.JunoDeltasSaveHandler
/// Size: 0x00F0 (0x000028 - 0x000118)
class UJunoDeltasSaveHandler : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0xE8];                                      // 0x0028   (0x00E8)  MISSED
	class UDeltaFileSaveHandler*                       SaveHandler;                                                // 0x0110   (0x0008)  
};

/// Class /Script/JunoGameNative.JunoDestructionBlueprintLibrary
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoDestructionBlueprintLibrary : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/JunoGameNative.JunoDestructionBlueprintLibrary.SetGeometryCollectionSourceFromAtomModel
	// void SetGeometryCollectionSourceFromAtomModel(class UGeometryCollection* GeometryCollection, class UAtomModel* AtomModel, FName SelectionSetFilter); // [0xbba0e04] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoDestructionBlueprintLibrary.SetGeometryCollectionMaterialForInstancedMeshes
	// void SetGeometryCollectionMaterialForInstancedMeshes(class UGeometryCollection* GeometryCollection, class UMaterialInterface* OpaqueMaterial, class UMaterialInterface* TransparentMaterial, class UMaterialInterface* GlitterMaterial, class UMaterialInterface* OpalMaterial, class UMaterialInterface* InternalGlowMaterial); // [0xbba0afc] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoDestructionBlueprintLibrary.GetGeometryCollectionSource
	// TArray<FGeometryCollectionSource> GetGeometryCollectionSource(class UAtomModel* AtomModel, FName SelectionSetFilter); // [0xbb9e3e8] Final|Native|Static|Public|BlueprintCallable 
};

/// Class /Script/JunoGameNative.JunoDumpWorldPersistentContents
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoDumpWorldPersistentContents : public UInterface
{ 
public:
};

/// Class /Script/JunoGameNative.JunoEncounterCheatInterface
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoEncounterCheatInterface : public UInterface
{ 
public:
};

/// Class /Script/JunoGameNative.JunoEssenceLevelComponent
/// Size: 0x0000 (0x0000A0 - 0x0000A0)
class UJunoEssenceLevelComponent : public UFortWeaponComponent
{ 
public:


	/// Functions
	// Function /Script/JunoGameNative.JunoEssenceLevelComponent.OnEquip
	// void OnEquip(class AFortWeapon* Weapon);                                                                              // [0xbb9f8cc] Final|Native|Protected 
};

/// Class /Script/JunoGameNative.JunoEventLimiterInterface
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoEventLimiterInterface : public UInterface
{ 
public:
};

/// Class /Script/JunoGameNative.JunoEventRouterLibrary
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoEventRouterLibrary : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/JunoGameNative.JunoEventRouterLibrary.GetGameplayEventRouter
	// class UGameplayEventRouterComponent* GetGameplayEventRouter(class AActor* ContextActor);                              // [0xbba2f44] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
};

/// Class /Script/JunoGameNative.JunoExampleMacroGenerated_CheatTestSetup
/// Size: 0x0048 (0x000030 - 0x000078)
class UJunoExampleMacroGenerated_CheatTestSetup : public UPFWCheatTestSetup
{ 
public:
	unsigned char                                      UnknownData00_2[0x38];                                      // 0x0030   (0x0038)  MISSED
	class UJunoExample_InGameClass*                    InGameClass;                                                // 0x0068   (0x0008)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x0070   (0x0008)  MISSED
};

/// Class /Script/JunoGameNative.JunoExampleMacroGenerated_Container
/// Size: 0x0000 (0x0001E0 - 0x0001E0)
class UJunoExampleMacroGenerated_Container : public UJunoBasePFWContainer
{ 
public:
};

/// Class /Script/JunoGameNative.JunoExample_CheatTestSetup
/// Size: 0x0048 (0x000030 - 0x000078)
class UJunoExample_CheatTestSetup : public UPFWCheatTestSetup
{ 
public:
	unsigned char                                      UnknownData00_2[0x38];                                      // 0x0030   (0x0038)  MISSED
	class UJunoExample_InGameClass*                    InGameClass;                                                // 0x0068   (0x0008)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x0070   (0x0008)  MISSED
};

/// Class /Script/JunoGameNative.JunoExample_Container
/// Size: 0x0008 (0x0001E0 - 0x0001E8)
class UJunoExample_Container : public UJunoBasePFWContainer
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x01E0   (0x0008)  MISSED
};

/// Class /Script/JunoGameNative.JunoExample_InGameClass
/// Size: 0x0008 (0x000028 - 0x000030)
class UJunoExample_InGameClass : public UObject
{ 
public:
	int32_t                                            PersistentData;                                             // 0x0028   (0x0004)  
	int32_t                                            TransientData;                                              // 0x002C   (0x0004)  
};

/// Class /Script/JunoGameNative.JunoExample_Module
/// Size: 0x0000 (0x0000E0 - 0x0000E0)
class UJunoExample_Module : public UPersistenceFrameworkModule
{ 
public:
};

/// Class /Script/JunoGameNative.JunoFilteredEventContextCollector
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoFilteredEventContextCollector : public UFilteredEventContextCollectorBase
{ 
public:
};

/// Class /Script/JunoGameNative.JunoFogOfWarPersistenceFeatureModule
/// Size: 0x0000 (0x0000E0 - 0x0000E0)
class UJunoFogOfWarPersistenceFeatureModule : public UPersistenceFrameworkModule
{ 
public:
};

/// Class /Script/JunoGameNative.JunoFogOfWarPersistenceFeatureData_Container
/// Size: 0x0000 (0x0001E0 - 0x0001E0)
class UJunoFogOfWarPersistenceFeatureData_Container : public UJunoBasePFWPersistenceFeatureDataContainer
{ 
public:
};

/// Class /Script/JunoGameNative.JunoFreeBuildBlueprintLibrary
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoFreeBuildBlueprintLibrary : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/JunoGameNative.JunoFreeBuildBlueprintLibrary.IsPlayerAllowedToFly
	// bool IsPlayerAllowedToFly(class UObject* WorldContextObject);                                                         // [0xbba35ac] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoFreeBuildBlueprintLibrary.IsItemSpawnerEnabled
	// bool IsItemSpawnerEnabled(class UObject* WorldContextObject);                                                         // [0xbba34b8] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoFreeBuildBlueprintLibrary.IsFreeBuildEnabled
	// bool IsFreeBuildEnabled(class UObject* WorldContextObject);                                                           // [0xbba33e0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoFreeBuildBlueprintLibrary.IsFreeBuildCostFilteringEnabled
	// bool IsFreeBuildCostFilteringEnabled(class UObject* WorldContextObject);                                              // [0xbba3300] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoFreeBuildBlueprintLibrary.GetFreeBuildSpawnableItems
	// TArray<FName> GetFreeBuildSpawnableItems(class UObject* WorldContextObject);                                          // [0xbba2e70] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoFreeBuildBlueprintLibrary.GetFreeBuildSpawnableItemDefinition
	// class UFortItemDefinition* GetFreeBuildSpawnableItemDefinition(class UObject* WorldContextObject, FName& Name);       // [0xbba2d64] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
};

/// Class /Script/JunoGameNative.JunoFreeBuildComponent
/// Size: 0x0030 (0x0000A0 - 0x0000D0)
class UJunoFreeBuildComponent : public UGameFrameworkComponent
{ 
public:
	FDataRegistryType                                  SpawnableItemsRegistryType;                                 // 0x00A0   (0x0004)  
	bool                                               bIsFreeBuildEnabled;                                        // 0x00A4   (0x0001)  
	bool                                               bIsItemSpawnerEnabled;                                      // 0x00A5   (0x0001)  
	bool                                               bIsPlayerAllowedToFly;                                      // 0x00A6   (0x0001)  
	bool                                               bIsFreeBuildCostFilteringEnabled;                           // 0x00A7   (0x0001)  
	bool                                               bWasFreeBuildEverEnabled;                                   // 0x00A8   (0x0001)  
	unsigned char                                      UnknownData00_6[0x27];                                      // 0x00A9   (0x0027)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoFreeBuildComponent.WasFreeBuildEverEnabled
	// bool WasFreeBuildEverEnabled();                                                                                       // [0xad6f994] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoFreeBuildComponent.OnRep_WasFreeBuildEverEnabled
	// void OnRep_WasFreeBuildEverEnabled();                                                                                 // [0xbba38a8] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoFreeBuildComponent.OnRep_IsFreeBuildEnabled
	// void OnRep_IsFreeBuildEnabled();                                                                                      // [0xbba3854] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoFreeBuildComponent.OnRep_AnyFreeBuildFlag
	// void OnRep_AnyFreeBuildFlag();                                                                                        // [0xbba3840] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoFreeBuildComponent.OnPlaylistDataReady
	// void OnPlaylistDataReady(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, FGameplayTagContainer& PlaylistContextTags); // [0xbba368c] Final|Native|Private|HasOutParms 
	// Function /Script/JunoGameNative.JunoFreeBuildComponent.IsPlayerAllowedToFly
	// bool IsPlayerAllowedToFly();                                                                                          // [0xbba366c] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoFreeBuildComponent.IsItemSpawnerEnabled
	// bool IsItemSpawnerEnabled();                                                                                          // [0xbba358c] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoFreeBuildComponent.IsFreeBuildEnabled
	// bool IsFreeBuildEnabled();                                                                                            // [0xbba34a0] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoFreeBuildComponent.IsFreeBuildCostFilteringEnabled
	// bool IsFreeBuildCostFilteringEnabled();                                                                               // [0xbba33c0] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoFreeBuildComponent.GetSpawnableItems
	// TArray<FName> GetSpawnableItems();                                                                                    // [0xbba3044] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoFreeBuildComponent.EnableFreeBuild
	// void EnableFreeBuild();                                                                                               // [0xbba2b74] Final|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoFreeBuildComponent.DisableFreeBuild
	// void DisableFreeBuild();                                                                                              // [0xbba2b60] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/JunoGameNative.JunoBasePFWPersistenceFeatureData
/// Size: 0x0018 (0x000028 - 0x000040)
class UJunoBasePFWPersistenceFeatureData : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x0028   (0x0010)  MISSED
	bool                                               bDirty;                                                     // 0x0038   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0039   (0x0007)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoBasePFWPersistenceFeatureData.OnPersistentDataModified
	// void OnPersistentDataModified();                                                                                      // [0x6075a98] RequiredAPI|Native|Protected|BlueprintCallable 
};

/// Struct /Script/JunoGameNative.JunoFreeBuildSaveData
/// Size: 0x0002 (0x000000 - 0x000002)
struct FJunoFreeBuildSaveData
{ 
	bool                                               bIsFreeBuildSaved;                                          // 0x0000   (0x0001)  
	bool                                               bWasFreeBuildEverSaved;                                     // 0x0001   (0x0001)  
};

/// Class /Script/JunoGameNative.JunoFreeBuildPersistenceFeatureData
/// Size: 0x0018 (0x000040 - 0x000058)
class UJunoFreeBuildPersistenceFeatureData : public UJunoBasePFWPersistenceFeatureData
{ 
public:
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x0040   (0x0010)  MISSED
	FJunoFreeBuildSaveData                             FreeBuildSaveData;                                          // 0x0050   (0x0002)  
	unsigned char                                      UnknownData01_6[0x6];                                       // 0x0052   (0x0006)  MISSED
};

/// Class /Script/JunoGameNative.JunoFreeBuildPersistenceFeatureDataActor
/// Size: 0x0018 (0x0002D0 - 0x0002E8)
class AJunoFreeBuildPersistenceFeatureDataActor : public AJunoPersistenceFeatureDataActor
{ 
public:
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x02D0   (0x0010)  MISSED
	FJunoFreeBuildSaveData                             FreeBuildSaveData;                                          // 0x02E0   (0x0002)  
	unsigned char                                      UnknownData01_6[0x6];                                       // 0x02E2   (0x0006)  MISSED
};

/// Class /Script/JunoGameNative.JunoFreeBuildPersistenceFeatureModule
/// Size: 0x0000 (0x0000E0 - 0x0000E0)
class UJunoFreeBuildPersistenceFeatureModule : public UPersistenceFrameworkModule
{ 
public:
};

/// Class /Script/JunoGameNative.JunoFreeBuildPersistenceFeatureData_Container
/// Size: 0x0000 (0x0001E0 - 0x0001E0)
class UJunoFreeBuildPersistenceFeatureData_Container : public UJunoBasePFWPersistenceFeatureDataContainer
{ 
public:
};

/// Class /Script/JunoGameNative.JunoGameStateComponent_WorldReactionsManager
/// Size: 0x0050 (0x000318 - 0x000368)
class UJunoGameStateComponent_WorldReactionsManager : public UFortGameStateComponent_WorldReactionsManager
{ 
public:
	unsigned char                                      UnknownData00_1[0x50];                                      // 0x0318   (0x0050)  MISSED
};

/// Class /Script/JunoGameNative.JunoGameStateSettings
/// Size: 0x0008 (0x0000A0 - 0x0000A8)
class UJunoGameStateSettings : public UGameStateComponent
{ 
public:
	class UJunoRuntimeSettings*                        PreOverrideRuntimeSettings;                                 // 0x00A0   (0x0008)  
};

/// Class /Script/JunoGameNative.JunoRuntimeSettings
/// Size: 0x0008 (0x000030 - 0x000038)
class UJunoRuntimeSettings : public UDeveloperSettings
{ 
public:
	bool                                               bPawnsUseProbeCollision;                                    // 0x0030   (0x0001)  
	bool                                               bCharacterBasedMovementIgnorePhysicsBase;                   // 0x0031   (0x0001)  
	bool                                               bCharacterStayBasedInAir;                                   // 0x0032   (0x0001)  
	bool                                               bBuoyancyEnabled;                                           // 0x0033   (0x0001)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0034   (0x0004)  MISSED
};

/// Class /Script/JunoGameNative.JunoGameStateTemperatureComponent
/// Size: 0x00C0 (0x0000A0 - 0x000160)
class UJunoGameStateTemperatureComponent : public UGameStateComponent
{ 
public:
	SDK_UNDEFINED(80,11865) /* TMap<FGameplayTag, FScalableFloat> */ __um(TemperatureToFloatMap);                  // 0x00A0   (0x0050)  
	SDK_UNDEFINED(80,11866) /* TMap<FGameplayTag, FScalableFloat> */ __um(TemperatureThresholdsMap);               // 0x00F0   (0x0050)  
	FFloatRange                                        TemperatureRange;                                           // 0x0140   (0x0010)  
	unsigned char                                      UnknownData00_6[0x10];                                      // 0x0150   (0x0010)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoGameStateTemperatureComponent.TemperatureToFloat
	// float TemperatureToFloat(FGameplayTag& Temperature);                                                                  // [0xbba3aa0] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoGameStateTemperatureComponent.GetTemperatureRanges
	// TArray<FTemperatureRange> GetTemperatureRanges();                                                                     // [0xbba3084] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoGameStateTemperatureComponent.GetMinimumTemperature
	// float GetMinimumTemperature();                                                                                        // [0xbba3024] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoGameStateTemperatureComponent.GetMaximumTemperature
	// float GetMaximumTemperature();                                                                                        // [0xbba3004] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/JunoGameNative.JunoGameStateWeatherComponent
/// Size: 0x0030 (0x0000A0 - 0x0000D0)
class UJunoGameStateWeatherComponent : public UGameStateComponent
{ 
public:
	class UDataTable*                                  SeasonTable;                                                // 0x00A0   (0x0008)  
	class UClass*                                      LocalizedWeatherStateSubclass;                              // 0x00A8   (0x0008)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x00B0   (0x0008)  MISSED
	class UJunoPlayspacePersistenceFeatureHelper*      WeatherPersistenceFeatureHelper;                            // 0x00B8   (0x0008)  
	unsigned char                                      UnknownData01_6[0x10];                                      // 0x00C0   (0x0010)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoGameStateWeatherComponent.TransitionWeatherNowTo
	// void TransitionWeatherNowTo(FJunoWeatherPhase& NewWeatherPhase, FJunoWeatherPhase& NewNextWeatherPhase, FJunoWeatherLocation OptionalLocation); // [0xbba3c38] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoGameStateWeatherComponent.TransitionWeatherNow
	// void TransitionWeatherNow(FName OptionalLocation);                                                                    // [0xbba3b78] Final|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoGameStateWeatherComponent.SetAutoTransitioning
	// void SetAutoTransitioning(bool bAutoTransitionWeather);                                                               // [0xbba38bc] Final|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoGameStateWeatherComponent.OnWeatherPhaseChanged
	// void OnWeatherPhaseChanged(class UJunoWeatherStateComponent* WeatherState);                                           // [0x5d5254c] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoGameStateWeatherComponent.OnNextWeatherQueueChanged
	// void OnNextWeatherQueueChanged(class UJunoWeatherStateComponent* WeatherState);                                       // [0x5d5254c] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoGameStateWeatherComponent.IsAutoTransitioning
	// bool IsAutoTransitioning();                                                                                           // [0x7ba7064] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoGameStateWeatherComponent.HandleWeatherStatesSetup
	// void HandleWeatherStatesSetup(TArray<UJunoWeatherStateComponent*>& WeatherStates);                                    // [0x2047e54] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Script/JunoGameNative.JunoGameStateWeatherComponent.GetWeatherStates
	// TArray<UJunoWeatherStateComponent*> GetWeatherStates();                                                               // [0xbba30c0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoGameStateWeatherComponent.ForceWeatherState
	// void ForceWeatherState(FName NewWeatherType, FName OptionalLocation);                                                 // [0xbba2c24] Native|Event|Public|BlueprintEvent 
	// Function /Script/JunoGameNative.JunoGameStateWeatherComponent.FindWeatherState
	// class UJunoWeatherStateComponent* FindWeatherState(FJunoWeatherLocation& Location);                                   // [0xbba2b88] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure 
};

/// Class /Script/JunoGameNative.JunoGeneratePersistenceAssetsReportCommandlet
/// Size: 0x0000 (0x000080 - 0x000080)
class UJunoGeneratePersistenceAssetsReportCommandlet : public UCommandlet
{ 
public:
};

/// Struct /Script/JunoGameNative.JunoGeometryCollectionAssemblerTargetData
/// Size: 0x0008 (0x000000 - 0x000008)
struct FJunoGeometryCollectionAssemblerTargetData
{ 
	float                                              TargetRatio;                                                // 0x0000   (0x0004)  
	float                                              ForcedStartRatio;                                           // 0x0004   (0x0004)  
};

/// Class /Script/JunoGameNative.JunoGeometryCollectionAssemblerComponent
/// Size: 0x0180 (0x0000A0 - 0x000220)
class UJunoGeometryCollectionAssemblerComponent : public UActorComponent
{ 
public:
	float                                              AssemblyRatioInterpSpeed;                                   // 0x00A0   (0x0004)  
	EJunoGeometryCollectionAssemblerDurationType       DurationType;                                               // 0x00A4   (0x0004)  
	float                                              LayerHeight;                                                // 0x00A8   (0x0004)  
	int32_t                                            LayerCount;                                                 // 0x00AC   (0x0004)  
	FScalableFloat                                     TimeToAssemble;                                             // 0x00B0   (0x0028)  
	FScalableFloat                                     SingleGeometryTimeToAssemble;                               // 0x00D8   (0x0028)  
	FScalableFloat                                     DisassembledZDistance;                                      // 0x0100   (0x0028)  
	FScalableFloat                                     DisassembledZDistanceRandomRatio;                           // 0x0128   (0x0028)  
	FScalableFloat                                     DisassembledRotationAmount;                                 // 0x0150   (0x0028)  
	bool                                               bFreeMemoryWhenNotAnimating;                                // 0x0178   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0179   (0x0007)  MISSED
	SDK_UNDEFINED(80,11867) /* TMap<UGeometryCollectionComponent*, FJunoGeometryCollectionAssemblerGCInfo> */ __um(GeometryCollectionInfos); // 0x0180   (0x0050)  
	SDK_UNDEFINED(16,11868) /* FMulticastInlineDelegate */ __um(OnAssemblyVisualsAnimationStart);                  // 0x01D0   (0x0010)  
	SDK_UNDEFINED(16,11869) /* FMulticastInlineDelegate */ __um(OnAssemblyVisualsAnimationUpdated);                // 0x01E0   (0x0010)  
	SDK_UNDEFINED(16,11870) /* FMulticastInlineDelegate */ __um(OnAssemblyVisualsAnimationEnd);                    // 0x01F0   (0x0010)  
	FJunoGeometryCollectionAssemblerTargetData         TargetData;                                                 // 0x0200   (0x0008)  
	unsigned char                                      UnknownData01_6[0x18];                                      // 0x0208   (0x0018)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoGeometryCollectionAssemblerComponent.SetFreeMemoryWhenNotAnimating
	// void SetFreeMemoryWhenNotAnimating(bool bValue);                                                                      // [0xbba3980] Final|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoGeometryCollectionAssemblerComponent.OnRep_TargetData
	// void OnRep_TargetData();                                                                                              // [0xbba3888] Final|Native|Protected 
	// Function /Script/JunoGameNative.JunoGeometryCollectionAssemblerComponent.IsUpdating
	// bool IsUpdating();                                                                                                    // [0x622b358] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoGeometryCollectionAssemblerComponent.IsDisassembling
	// bool IsDisassembling();                                                                                               // [0xbba32a8] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoGeometryCollectionAssemblerComponent.IsDisassembled
	// bool IsDisassembled();                                                                                                // [0xbba3288] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoGeometryCollectionAssemblerComponent.IsAssembling
	// bool IsAssembling();                                                                                                  // [0xbba3264] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoGeometryCollectionAssemblerComponent.IsAssembled
	// bool IsAssembled();                                                                                                   // [0xbba3240] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoGeometryCollectionAssemblerComponent.IsActorAssembled
	// bool IsActorAssembled(class AActor* Actor);                                                                           // [0xbba312c] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoGeometryCollectionAssemblerComponent.GetAssemblyRatio
	// float GetAssemblyRatio();                                                                                             // [0x60590f0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/JunoGameNative.JunoGuidedBuildingBCOInterface
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoGuidedBuildingBCOInterface : public UInterface
{ 
public:


	/// Functions
	// Function /Script/JunoGameNative.JunoGuidedBuildingBCOInterface.SetParentGuidedBuilding
	// void SetParentGuidedBuilding(class AJunoGuidedBuildingActor* OurGuidedBuild);                                         // [0x2047e54] Event|Public|BlueprintEvent 
};

/// Struct /Script/JunoGameNative.JunoInputMapping
/// Size: 0x0010 (0x000000 - 0x000010)
struct FJunoInputMapping
{ 
	class UInputMappingContext*                        Context;                                                    // 0x0000   (0x0008)  
	int32_t                                            Priority;                                                   // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
};

/// Struct /Script/JunoGameNative.JunoInputAlternateDisplayText
/// Size: 0x0028 (0x000000 - 0x000028)
struct FJunoInputAlternateDisplayText
{ 
	class UInputAction*                                InputAction;                                                // 0x0000   (0x0008)  
	FName                                              ActionName;                                                 // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x000C   (0x0004)  MISSED
	SDK_UNDEFINED(24,11871) /* FText */                __um(DisplayText);                                          // 0x0010   (0x0018)  
};

/// Class /Script/JunoGameNative.JunoInputMappingComponent
/// Size: 0x0028 (0x0000A0 - 0x0000C8)
class UJunoInputMappingComponent : public UGameFrameworkComponent
{ 
public:
	bool                                               bPopDefaultContext;                                         // 0x00A0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x00A1   (0x0007)  MISSED
	FJunoInputMapping                                  DesiredInputMapping;                                        // 0x00A8   (0x0010)  
	TArray<FJunoInputAlternateDisplayText>             DisplayTexts;                                               // 0x00B8   (0x0010)  


	/// Functions
	// Function /Script/JunoGameNative.JunoInputMappingComponent.PushContext
	// void PushContext(class UJunoInputControllerComponent* JunoInputController);                                           // [0xbbaecb4] Final|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoInputMappingComponent.PopContext
	// void PopContext(class UJunoInputControllerComponent* JunoInputController);                                            // [0xbbaebd8] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/JunoGameNative.JunoInputQueueComponent
/// Size: 0x0068 (0x0000A0 - 0x000108)
class UJunoInputQueueComponent : public UPawnComponent
{ 
public:
	unsigned char                                      UnknownData00_1[0x68];                                      // 0x00A0   (0x0068)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoInputQueueComponent.StopQueueingInput
	// void StopQueueingInput(int32_t MontageInstanceID, FGameplayTagContainer AbilityTagsToAdd, FGameplayTagContainer AbilityTagsToRemove); // [0xbbaf308] Final|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoInputQueueComponent.StartQueueingInput
	// void StartQueueingInput(int32_t MontageInstanecID, class UGameplayAbility* Ability, bool bQueueMantisInputs, FGameplayTagContainer EventTags); // [0xbbaf080] Final|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoInputQueueComponent.SetInterruptible
	// void SetInterruptible(int32_t MontageInstanceID, FGameplayTagContainer AbilityTagsToAdd, FGameplayTagContainer AbilityTagsToRemove); // [0xbbaee50] Final|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoInputQueueComponent.ResetBlockingTags
	// void ResetBlockingTags(int32_t MontageInstanceID);                                                                    // [0xbbaed90] Final|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoInputQueueComponent.OverrideBlockingTags
	// void OverrideBlockingTags(int32_t MontageInstanceID, class UGameplayAbility* Ability, FGameplayTagContainer AbilityTagsToAdd, FGameplayTagContainer AbilityTagsToRemove); // [0xbbae92c] Final|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoInputQueueComponent.FireQueuedInputs
	// void FireQueuedInputs(int32_t MontageInstanceID);                                                                     // [0xbbae4e8] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/JunoGameNative.JunoInventoryPersistenceFeatureModule
/// Size: 0x0000 (0x0000E0 - 0x0000E0)
class UJunoInventoryPersistenceFeatureModule : public UPersistenceFrameworkModule
{ 
public:
};

/// Class /Script/JunoGameNative.JunoInventoryPersistenceFeatureData_Container
/// Size: 0x0000 (0x0001E0 - 0x0001E0)
class UJunoInventoryPersistenceFeatureData_Container : public UJunoBasePFWPersistenceFeatureDataContainer
{ 
public:
};

/// Class /Script/JunoGameNative.JunoInventoryUIPersistenceFeatureModule
/// Size: 0x0000 (0x0000E0 - 0x0000E0)
class UJunoInventoryUIPersistenceFeatureModule : public UPersistenceFrameworkModule
{ 
public:
};

/// Class /Script/JunoGameNative.JunoInventoryUIPersistenceFeatureData_Container
/// Size: 0x0000 (0x0001E0 - 0x0001E0)
class UJunoInventoryUIPersistenceFeatureData_Container : public UJunoBasePFWPersistenceFeatureDataContainer
{ 
public:
};

/// Class /Script/JunoGameNative.JunoKnowledgeBundle
/// Size: 0x0060 (0x000030 - 0x000090)
class UJunoKnowledgeBundle : public UPrimaryDataAsset
{ 
public:
	class UDataTable*                                  RecipeTable;                                                // 0x0030   (0x0008)  
	SDK_UNDEFINED(24,11872) /* FText */                __um(BundleName);                                           // 0x0038   (0x0018)  
	SDK_UNDEFINED(24,11873) /* FText */                __um(BundleDescription);                                    // 0x0050   (0x0018)  
	SDK_UNDEFINED(32,11874) /* TWeakObjectPtr<UObject*> */ __um(BundleImage);                                      // 0x0068   (0x0020)  
	FGameplayTag                                       BundleIdentifier;                                           // 0x0088   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x008C   (0x0004)  MISSED
};

/// Class /Script/JunoGameNative.JunoKnowledgeCraftingComponent
/// Size: 0x0008 (0x0000A0 - 0x0000A8)
class UJunoKnowledgeCraftingComponent : public UGameFrameworkComponent
{ 
public:
	SDK_UNDEFINED(8,11875) /* TWeakObjectPtr<UCraftingObjectComponent*> */ __um(CachedCraftingObjectComponent);    // 0x00A0   (0x0008)  


	/// Functions
	// Function /Script/JunoGameNative.JunoKnowledgeCraftingComponent.OnCraftingSuccess
	// void OnCraftingSuccess(FCraftingObjectSuccessEvent& Event);                                                           // [0xbbae884] Final|Native|Private|HasOutParms 
	// Function /Script/JunoGameNative.JunoKnowledgeCraftingComponent.HandleCraftingStateChanged
	// void HandleCraftingStateChanged(FCraftingObjectStateChangedEvent& Event);                                             // [0xbbae7e8] Final|Native|Private|HasOutParms 
};

/// Struct /Script/JunoGameNative.JunoKnowledgeSaveRecord
/// Size: 0x00E0 (0x000000 - 0x0000E0)
struct FJunoKnowledgeSaveRecord
{ 
	FGameplayTagContainer                              CraftingObjectTags;                                         // 0x0000   (0x0020)  
	FGameplayTagContainer                              ClaimedBundleIdentifiers;                                   // 0x0020   (0x0020)  
	SDK_UNDEFINED(80,11876) /* TMap<UFortItemDefinition*, FJunoKnowledgeItemStateEntry> */ __um(ItemStates);       // 0x0040   (0x0050)  
	SDK_UNDEFINED(80,11877) /* TMap<FName, FJunoKnowledgeRecipeStateEntry> */ __um(RecipeStates);                  // 0x0090   (0x0050)  
};

/// Struct /Script/JunoGameNative.JunoKnowledgeSaveData
/// Size: 0x00E0 (0x000000 - 0x0000E0)
struct FJunoKnowledgeSaveData
{ 
	FJunoKnowledgeSaveRecord                           WorldKnowledgeRecord;                                       // 0x0000   (0x00E0)  
};

/// Class /Script/JunoGameNative.JunoKnowledgePersistenceFeatureDataActor
/// Size: 0x00E8 (0x0002D0 - 0x0003B8)
class AJunoKnowledgePersistenceFeatureDataActor : public AJunoPersistenceFeatureDataActor
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x02D0   (0x0008)  MISSED
	FJunoKnowledgeSaveData                             KnowledgeSaveData;                                          // 0x02D8   (0x00E0)  
};

/// Class /Script/JunoGameNative.JunoKnowledgePersistenceFeatureModule
/// Size: 0x0000 (0x0000E0 - 0x0000E0)
class UJunoKnowledgePersistenceFeatureModule : public UPersistenceFrameworkModule
{ 
public:
};

/// Class /Script/JunoGameNative.JunoKnowledgePersistenceFeatureData_Container
/// Size: 0x0000 (0x0001E0 - 0x0001E0)
class UJunoKnowledgePersistenceFeatureData_Container : public UJunoBasePFWPersistenceFeatureDataContainer
{ 
public:
};

/// Class /Script/JunoGameNative.JunoLevelProviderInterface
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoLevelProviderInterface : public UInterface
{ 
public:
};

/// Class /Script/JunoGameNative.JunoLifeCycleInterface
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoLifeCycleInterface : public UInterface
{ 
public:
};

/// Class /Script/JunoGameNative.JunoLocalEnvironmentComponentInterface
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoLocalEnvironmentComponentInterface : public UInterface
{ 
public:


	/// Functions
	// Function /Script/JunoGameNative.JunoLocalEnvironmentComponentInterface.GetCaveId
	// FGuid GetCaveId();                                                                                                    // [0xbbae6e8] Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoLocalEnvironmentComponentInterface.GetBiome
	// FJunoBiomeInfoQueryResult GetBiome();                                                                                 // [0xb0ad8e0] Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/JunoGameNative.JunoLocalEnvironmentActorInterface
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoLocalEnvironmentActorInterface : public UInterface
{ 
public:


	/// Functions
	// Function /Script/JunoGameNative.JunoLocalEnvironmentActorInterface.GetBiomeInfo
	// bool GetBiomeInfo(FJunoBiomeInfoQueryResult& OutHabitat);                                                             // [0xbbae644] Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoLocalEnvironmentActorInterface.GetBiome
	// bool GetBiome(EJunoBiome& OutBiome);                                                                                  // [0xbbae5a8] Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/JunoGameNative.JunoLWMCaveEventDataInterface
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoLWMCaveEventDataInterface : public UInterface
{ 
public:
};

/// Class /Script/JunoGameNative.DisplayableTile
/// Size: 0x0018 (0x000028 - 0x000040)
class UDisplayableTile : public UObject
{ 
public:
	int32_t                                            TileId;                                                     // 0x0028   (0x0004)  
	int32_t                                            ClearedPixelCount;                                          // 0x002C   (0x0004)  
	class UTexture2D*                                  FogMask;                                                    // 0x0030   (0x0008)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0038   (0x0008)  MISSED
};

/// Struct /Script/JunoGameNative.JunoExploredTile
/// Size: 0x0024 (0x00000C - 0x000030)
struct FJunoExploredTile : FFastArraySerializerItem
{ 
	int32_t                                            TileId;                                                     // 0x000C   (0x0004)  
	int32_t                                            ClearedPixelCount;                                          // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	TArray<char>                                       PackedTileMask;                                             // 0x0018   (0x0010)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x0028   (0x0008)  MISSED
};

/// Struct /Script/JunoGameNative.MapExplorationData
/// Size: 0x0018 (0x000108 - 0x000120)
struct FMapExplorationData : FFastArraySerializer
{ 
	TArray<FJunoExploredTile>                          ExploredTiles;                                              // 0x0108   (0x0010)  
	int32_t                                            KnownClearedPixelCount;                                     // 0x0118   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x011C   (0x0004)  MISSED
};

/// Struct /Script/JunoGameNative.JunoTileInfo
/// Size: 0x0018 (0x000000 - 0x000018)
struct FJunoTileInfo
{ 
	int32_t                                            TileId;                                                     // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0004   (0x0004)  MISSED
	FVector2D                                          WorldLocation;                                              // 0x0008   (0x0010)  
};

/// Class /Script/JunoGameNative.JunoMapManagerComponent
/// Size: 0x0180 (0x0000F8 - 0x000278)
class UJunoMapManagerComponent : public UFortPlayspaceComponent
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x00F8   (0x0008)  MISSED
	float                                              ExploredRadius;                                             // 0x0100   (0x0004)  
	unsigned char                                      UnknownData01_5[0x14];                                      // 0x0104   (0x0014)  MISSED
	FMapExplorationData                                MapExplorationData;                                         // 0x0118   (0x0120)  
	TArray<class UDisplayableTile*>                    DisplayableTiles;                                           // 0x0238   (0x0010)  
	TArray<FJunoTileInfo>                              LoadedTiles;                                                // 0x0248   (0x0010)  
	class UTexture2D*                                  ClearedFogMask;                                             // 0x0258   (0x0008)  
	unsigned char                                      UnknownData02_6[0x18];                                      // 0x0260   (0x0018)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoMapManagerComponent.GetFOWForTile
	// class UTexture2D* GetFOWForTile(int32_t TileId);                                                                      // [0xbbae718] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/JunoGameNative.JunoBuildLimitGetter
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoBuildLimitGetter : public UObject
{ 
public:
};

/// Class /Script/JunoGameNative.JunoMarkersLimitPool
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoMarkersLimitPool : public UJunoBuildLimitGetter
{ 
public:
};

/// Class /Script/JunoGameNative.JunoMarkersPersistenceFeatureModule
/// Size: 0x0000 (0x0000E0 - 0x0000E0)
class UJunoMarkersPersistenceFeatureModule : public UPersistenceFrameworkModule
{ 
public:
};

/// Class /Script/JunoGameNative.JunoMarkersPersistenceFeatureData_Container
/// Size: 0x0000 (0x0001E0 - 0x0001E0)
class UJunoMarkersPersistenceFeatureData_Container : public UJunoBasePFWPersistenceFeatureDataContainer
{ 
public:
};

/// Class /Script/JunoGameNative.JunoMerchantDatabase
/// Size: 0x0008 (0x0000F8 - 0x000100)
class UJunoMerchantDatabase : public UFortPlayspaceComponent
{ 
public:
	class UDataTable*                                  MerchantSalesDataTable;                                     // 0x00F8   (0x0008)  
};

/// Struct /Script/JunoGameNative.JunoWeatherLocation
/// Size: 0x0002 (0x000000 - 0x000002)
struct FJunoWeatherLocation
{ 
	EJunoBiome                                         Biome;                                                      // 0x0000   (0x0001)  
	EJunoBiomeHabitat                                  Habitat;                                                    // 0x0001   (0x0001)  
};

/// Struct /Script/JunoGameNative.JunoWeatherPhase
/// Size: 0x0038 (0x000000 - 0x000038)
struct FJunoWeatherPhase
{ 
	FGameplayTag                                       WeatherTypeName;                                            // 0x0000   (0x0004)  
	float                                              TransitionIn;                                               // 0x0004   (0x0004)  
	float                                              TransitionOut;                                              // 0x0008   (0x0004)  
	float                                              WindDirectionDegree;                                        // 0x000C   (0x0004)  
	float                                              duration;                                                   // 0x0010   (0x0004)  
	float                                              WeatherIntensity;                                           // 0x0014   (0x0004)  
	float                                              WindSpeed;                                                  // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x001C   (0x0004)  MISSED
	double                                             GameTimeWeatherEnds;                                        // 0x0020   (0x0008)  
	FGameplayTag                                       MorningTemperature;                                         // 0x0028   (0x0004)  
	FGameplayTag                                       DayTemperature;                                             // 0x002C   (0x0004)  
	FGameplayTag                                       EveningTemperature;                                         // 0x0030   (0x0004)  
	FGameplayTag                                       NightTemperature;                                           // 0x0034   (0x0004)  
};

/// Struct /Script/JunoGameNative.JunoSynchronizedWeatherState
/// Size: 0x0078 (0x000000 - 0x000078)
struct FJunoSynchronizedWeatherState
{ 
	FJunoWeatherLocation                               Location;                                                   // 0x0000   (0x0002)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x0002   (0x0006)  MISSED
	FJunoWeatherPhase                                  CurrentWeatherPhase;                                        // 0x0008   (0x0038)  
	FJunoWeatherPhase                                  NextWeatherPhase;                                           // 0x0040   (0x0038)  
};

/// Class /Script/JunoGameNative.JunoMeshNetworkWeatherComponent
/// Size: 0x0058 (0x000150 - 0x0001A8)
class UJunoMeshNetworkWeatherComponent : public UMeshNetworkComponent
{ 
public:
	TArray<FJunoSynchronizedWeatherState>              SynchronizedWeatherStates;                                  // 0x0150   (0x0010)  
	unsigned char                                      UnknownData00_6[0x48];                                      // 0x0160   (0x0048)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoMeshNetworkWeatherComponent.OnRep_OnSynchronizedWeatherStates
	// void OnRep_OnSynchronizedWeatherStates();                                                                             // [0xbbb0dc4] Final|Native|Private 
};

/// Class /Script/JunoGameNative.JunoMoodReactionConfigMappings
/// Size: 0x0050 (0x000030 - 0x000080)
class UJunoMoodReactionConfigMappings : public UDataAsset
{ 
public:
	SDK_UNDEFINED(80,11878) /* TMap<FGameplayTag, FDataTableRowHandle> */ __um(MoodReactionConfigMap);             // 0x0030   (0x0050)  
};

/// Class /Script/JunoGameNative.JunoMutator_AutoPickup
/// Size: 0x0020 (0x000338 - 0x000358)
class AJunoMutator_AutoPickup : public AFortAthenaMutator
{ 
public:
	FGameplayTagContainer                              DoNotAutoPickupGameplayTags;                                // 0x0338   (0x0020)  
};

/// Class /Script/JunoGameNative.JunoNPCMoodReactionDatabase
/// Size: 0x0008 (0x0000F8 - 0x000100)
class UJunoNPCMoodReactionDatabase : public UFortPlayspaceComponent
{ 
public:
	class UJunoMoodReactionConfigMappings*             MoodReactionConfigMappings;                                 // 0x00F8   (0x0008)  
};

/// Struct /Script/JunoGameNative.JunoPassiveCraftingItemAndCount
/// Size: 0x0010 (0x000000 - 0x000010)
struct FJunoPassiveCraftingItemAndCount
{ 
	int32_t                                            Count;                                                      // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0004   (0x0004)  MISSED
	class UFortItemDefinition*                         Item;                                                       // 0x0008   (0x0008)  
};

/// Struct /Script/JunoGameNative.JunoPassiveCraftingContributorAnalytics
/// Size: 0x0028 (0x000000 - 0x000028)
struct FJunoPassiveCraftingContributorAnalytics
{ 
	SDK_UNDEFINED(16,11879) /* FString */              __um(AccountId);                                            // 0x0000   (0x0010)  
	SDK_UNDEFINED(16,11880) /* FString */              __um(SessionId);                                            // 0x0010   (0x0010)  
	double                                             SessionTime;                                                // 0x0020   (0x0008)  
};

/// Class /Script/JunoGameNative.JunoPassiveCraftingAnalyticsComponent
/// Size: 0x0048 (0x0000A0 - 0x0000E8)
class UJunoPassiveCraftingAnalyticsComponent : public UGameFrameworkComponent
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x00A0   (0x0008)  MISSED
	FJunoPassiveCraftingItemAndCount                   AccumulatedItem;                                            // 0x00A8   (0x0010)  
	TArray<FJunoPassiveCraftingContributorAnalytics>   AccumulatedContributors;                                    // 0x00B8   (0x0010)  
	TArray<FJunoPassiveCraftingItemAndCount>           AccumulatedIngredients;                                     // 0x00C8   (0x0010)  
	FName                                              Recipe;                                                     // 0x00D8   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x00DC   (0x0004)  MISSED
	double                                             AccumulatedCraftingTime;                                    // 0x00E0   (0x0008)  
};

/// Class /Script/JunoGameNative.JunoPassiveCraftingComponent
/// Size: 0x0050 (0x0000A0 - 0x0000F0)
class UJunoPassiveCraftingComponent : public UGameFrameworkComponent
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x00A0   (0x0008)  MISSED
	SDK_UNDEFINED(16,11881) /* FMulticastInlineDelegate */ __um(OnPassiveCraftingDone);                            // 0x00A8   (0x0010)  
	SDK_UNDEFINED(8,11882) /* TWeakObjectPtr<UJunoInventoryComponent*> */ __um(CachedInventoryComponent);          // 0x00B8   (0x0008)  
	SDK_UNDEFINED(8,11883) /* TWeakObjectPtr<UCraftingObjectComponent*> */ __um(CachedCraftingObjectComponent);    // 0x00C0   (0x0008)  
	bool                                               bIsAutoCrafting;                                            // 0x00C8   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x00C9   (0x0003)  MISSED
	FName                                              AutoCraftingFormulaRow;                                     // 0x00CC   (0x0004)  
	unsigned char                                      UnknownData02_5[0x8];                                       // 0x00D0   (0x0008)  MISSED
	FDateTime                                          AutoCraftingStartDateTime;                                  // 0x00D8   (0x0008)  
	unsigned char                                      UnknownData03_6[0x10];                                      // 0x00E0   (0x0010)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoPassiveCraftingComponent.SetAutoCraftRecipe
	// void SetAutoCraftRecipe(FName FormulaRow);                                                                            // [0xbbb0e90] Final|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoPassiveCraftingComponent.OnCraftingSuccess
	// void OnCraftingSuccess(FCraftingObjectSuccessEvent& Event);                                                           // [0xbbb0d40] Final|Native|Private|HasOutParms 
	// Function /Script/JunoGameNative.JunoPassiveCraftingComponent.MulticastFireCraftingDone
	// void MulticastFireCraftingDone(EPassiveCraftingDoneReason Reason);                                                    // [0xbbb0c7c] Final|Net|NetReliableNative|Event|NetMulticast|Private 
	// Function /Script/JunoGameNative.JunoPassiveCraftingComponent.IsAutoCrafting
	// bool IsAutoCrafting();                                                                                                // [0xa10f178] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoPassiveCraftingComponent.HandleInventoryDataRestored
	// void HandleInventoryDataRestored();                                                                                   // [0xbbb0c68] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoPassiveCraftingComponent.HandleCraftingStateChanged
	// void HandleCraftingStateChanged(FCraftingObjectStateChangedEvent& Event);                                             // [0xbbb0bcc] Final|Native|Private|HasOutParms 
	// Function /Script/JunoGameNative.JunoPassiveCraftingComponent.GetAutoCraftingFormulaRow
	// FName GetAutoCraftingFormulaRow();                                                                                    // [0xbbb0aa4] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoPassiveCraftingComponent.EnableAutoCrafting
	// void EnableAutoCrafting();                                                                                            // [0xbbb0a90] Final|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoPassiveCraftingComponent.DisableAutoCrafting
	// void DisableAutoCrafting();                                                                                           // [0xbbb0a7c] Final|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoPassiveCraftingComponent.CalculateNumRemainingAutoCraft
	// int32_t CalculateNumRemainingAutoCraft(FName OptionalFormulaRow);                                                     // [0xbbb09b0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/JunoGameNative.JunoPassiveResourcesGathererPawnComponent
/// Size: 0x0090 (0x0000A0 - 0x000130)
class UJunoPassiveResourcesGathererPawnComponent : public UPawnComponent
{ 
public:
	FScalableFloat                                     JobEstimationTimeMultiplier;                                // 0x00A0   (0x0028)  
	class UDataTable*                                  GathererTable;                                              // 0x00C8   (0x0008)  
	SDK_UNDEFINED(16,11884) /* FMulticastInlineDelegate */ __um(OnPassiveResourceGeneratedOnPawnDelegate);         // 0x00D0   (0x0010)  
	unsigned char                                      UnknownData00_6[0x50];                                      // 0x00E0   (0x0050)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoPassiveResourcesGathererPawnComponent.GetTotalJobCompletionTimeInJunoHours
	// float GetTotalJobCompletionTimeInJunoHours();                                                                         // [0xbbb0ba4] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoPassiveResourcesGathererPawnComponent.GetRemainingJobCompletionTimeInJunoHours
	// float GetRemainingJobCompletionTimeInJunoHours();                                                                     // [0xbbb0b7c] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoPassiveResourcesGathererPawnComponent.GetLastUsedGatheringActorItemId
	// FPrimaryAssetId GetLastUsedGatheringActorItemId();                                                                    // [0xbbb0b50] Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoPassiveResourcesGathererPawnComponent.GetLastUsedGatheringActorDisplayText
	// FText GetLastUsedGatheringActorDisplayText();                                                                         // [0xbbb0b0c] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoPassiveResourcesGathererPawnComponent.GetLastGeneratedPercentage
	// float GetLastGeneratedPercentage();                                                                                   // [0xbbb0ae4] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoPassiveResourcesGathererPawnComponent.GetEstimatedTotalJobCompletionTimeInJunoDays
	// float GetEstimatedTotalJobCompletionTimeInJunoDays();                                                                 // [0xbbb0abc] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/JunoGameNative.JunoPassiveResourcesGatheringWorldConditionSchema
/// Size: 0x0010 (0x000038 - 0x000048)
class UJunoPassiveResourcesGatheringWorldConditionSchema : public UWorldConditionSchema
{ 
public:
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0038   (0x0010)  MISSED
};

/// Struct /Script/JunoGameNative.PassiveResourcesGatheringRowRuntime
/// Size: 0x0058 (0x000000 - 0x000058)
struct FPassiveResourcesGatheringRowRuntime
{ 
	unsigned char                                      UnknownData00_2[0x28];                                      // 0x0000   (0x0028)  MISSED
	FWorldConditionQueryState                          SelectionPreconditionsQueryState;                           // 0x0028   (0x0030)  
};

/// Class /Script/JunoGameNative.JunoPassiveResourcesGatheringComponent
/// Size: 0x00D8 (0x0000A0 - 0x000178)
class UJunoPassiveResourcesGatheringComponent : public UGameFrameworkComponent
{ 
public:
	unsigned char                                      UnknownData00_2[0x28];                                      // 0x00A0   (0x0028)  MISSED
	TArray<FPassiveResourcesGatheringRowRuntime>       ActiveGatheringRows;                                        // 0x00C8   (0x0010)  
	SDK_UNDEFINED(16,11885) /* FMulticastInlineDelegate */ __um(OnPassiveResourceGeneratedDelegate);               // 0x00D8   (0x0010)  
	unsigned char                                      UnknownData01_5[0x28];                                      // 0x00E8   (0x0028)  MISSED
	FGameplayTagQuery                                  MatchingRolesQuery;                                         // 0x0110   (0x0048)  
	TArray<FDataTableRowHandle>                        GatheringRows;                                              // 0x0158   (0x0010)  
	FDataTableRowHandle                                SimulationConfigurationRow;                                 // 0x0168   (0x0010)  


	/// Functions
	// Function /Script/JunoGameNative.JunoPassiveResourcesGatheringComponent.RemoveGatheringRowOverride
	// void RemoveGatheringRowOverride();                                                                                    // [0xbbb0e74] Final|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoPassiveResourcesGatheringComponent.OverrideGatheringRow
	// bool OverrideGatheringRow(FDataTableRowHandle& GatheringRow);                                                         // [0xbbb0dd8] Final|Native|Public|HasOutParms|BlueprintCallable 
};

/// Class /Script/JunoGameNative.JunoPersistenceDeveloperSettings
/// Size: 0x0070 (0x000030 - 0x0000A0)
class UJunoPersistenceDeveloperSettings : public UDeveloperSettings
{ 
public:
	bool                                               bCreateNewWorldAlways;                                      // 0x0030   (0x0001)  
	bool                                               bDisablePersistence;                                        // 0x0031   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x0032   (0x0006)  MISSED
	SDK_UNDEFINED(16,11886) /* FString */              __um(WorldNameSuffix);                                      // 0x0038   (0x0010)  
	bool                                               bEnablePersistenceFrameworkDeltas;                          // 0x0048   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0049   (0x0003)  MISSED
	int32_t                                            NewWorldAdventureSeed;                                      // 0x004C   (0x0004)  
	SDK_UNDEFINED(80,11887) /* TMap<FString, FString> */ __um(NewWorldDevProperties);                              // 0x0050   (0x0050)  
};

/// Class /Script/JunoGameNative.JunoPersistenceFeatureData
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoPersistenceFeatureData : public UInterface
{ 
public:
};

/// Class /Script/JunoGameNative.JunoPersistenceFeaturesReportHandler
/// Size: 0x0018 (0x000028 - 0x000040)
class UJunoPersistenceFeaturesReportHandler : public UObject
{ 
public:
	unsigned char                                      UnknownData00_1[0x18];                                      // 0x0028   (0x0018)  MISSED
};

/// Class /Script/JunoGameNative.JunoPersistenceReportGenerator
/// Size: 0x0020 (0x000028 - 0x000048)
class UJunoPersistenceReportGenerator : public UObject
{ 
public:
	unsigned char                                      UnknownData00_1[0x20];                                      // 0x0028   (0x0020)  MISSED
};

/// Class /Script/JunoGameNative.JunoPFWDefaultServiceWrapperSettings
/// Size: 0x0000 (0x000040 - 0x000040)
class UJunoPFWDefaultServiceWrapperSettings : public UPersistenceFrameworkServiceSettingsBase
{ 
public:
};

/// Class /Script/JunoGameNative.JunoPickup
/// Size: 0x0008 (0x0007C0 - 0x0007C8)
class AJunoPickup : public AFortPickupAthena
{ 
public:
	float                                              MaxDropTossSpeed;                                           // 0x07C0   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x07C4   (0x0004)  MISSED
};

/// Struct /Script/JunoGameNative.JunoSlotIndex
/// Size: 0x0008 (0x000000 - 0x000008)
struct FJunoSlotIndex
{ 
	EJunoBuildModeType                                 BuildModeType;                                              // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0001   (0x0003)  MISSED
	int32_t                                            Index;                                                      // 0x0004   (0x0004)  
};

/// Struct /Script/JunoGameNative.JunoSelectedSlot
/// Size: 0x0030 (0x000000 - 0x000030)
struct FJunoSelectedSlot
{ 
	FJunoSlotIndex                                     Slot;                                                       // 0x0000   (0x0008)  
	FName                                              ForcedRecipe;                                               // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x000C   (0x0004)  MISSED
	FGameplayTagContainer                              Tags;                                                       // 0x0010   (0x0020)  
};

/// Struct /Script/JunoGameNative.JunoBuildingSlotData
/// Size: 0x0034 (0x00000C - 0x000040)
struct FJunoBuildingSlotData : FFastArraySerializerItem
{ 
	FName                                              AssociatedRecipe;                                           // 0x000C   (0x0004)  
	int32_t                                            ResultingQuantity;                                          // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	class UFortItemDefinition*                         ResultingItemDefintion;                                     // 0x0018   (0x0008)  
	bool                                               bCanCraft;                                                  // 0x0020   (0x0001)  
	bool                                               bIsPinned;                                                  // 0x0021   (0x0001)  
	unsigned char                                      UnknownData01_5[0x6];                                       // 0x0022   (0x0006)  MISSED
	class UInputAction*                                InputAction;                                                // 0x0028   (0x0008)  
	unsigned char                                      UnknownData02_6[0x10];                                      // 0x0030   (0x0010)  MISSED
};

/// Struct /Script/JunoGameNative.JunoBuildingSlotDataArray
/// Size: 0x0030 (0x000108 - 0x000138)
struct FJunoBuildingSlotDataArray : FFastArraySerializer
{ 
	unsigned char                                      UnknownData00_2[0x18];                                      // 0x0108   (0x0018)  MISSED
	TArray<FJunoBuildingSlotData>                      Entries;                                                    // 0x0120   (0x0010)  
	EJunoBuildModeType                                 BuildModeType;                                              // 0x0130   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0131   (0x0003)  MISSED
	int32_t                                            LastSelectedIndex;                                          // 0x0134   (0x0004)  
};

/// Struct /Script/JunoGameNative.JunoBuildingSessionEntry
/// Size: 0x0040 (0x000000 - 0x000040)
struct FJunoBuildingSessionEntry
{ 
	SDK_UNDEFINED(8,11888) /* TWeakObjectPtr<AActor*> */ __um(SpawnedActor);                                       // 0x0000   (0x0008)  
	FVector                                            SpawnLocation;                                              // 0x0008   (0x0018)  
	FDateTime                                          SpawnTime;                                                  // 0x0020   (0x0008)  
	class UClass*                                      ActorClass;                                                 // 0x0028   (0x0008)  
	SDK_UNDEFINED(8,11889) /* TWeakObjectPtr<UFortItemDefinition*> */ __um(ItemDef);                               // 0x0030   (0x0008)  
	FName                                              Recipe;                                                     // 0x0038   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x003C   (0x0004)  MISSED
};

/// Struct /Script/JunoGameNative.JunoBuildingSessionInfo
/// Size: 0x0028 (0x000000 - 0x000028)
struct FJunoBuildingSessionInfo
{ 
	TArray<FJunoBuildingSessionEntry>                  Entries;                                                    // 0x0000   (0x0010)  
	FGuid                                              SessionId;                                                  // 0x0010   (0x0010)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0020   (0x0008)  MISSED
};

/// Struct /Script/JunoGameNative.JunoBuildingMetricsClientPermissions
/// Size: 0x0010 (0x000000 - 0x000010)
struct FJunoBuildingMetricsClientPermissions
{ 
	FInt32Vector                                       Location;                                                   // 0x0000   (0x000C)  
	int8_t                                             BuildBudgetUsagePercent;                                    // 0x000C   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x000D   (0x0003)  MISSED
};

/// Class /Script/JunoGameNative.JunoPlayerBuildingComponent
/// Size: 0x04C8 (0x0000A8 - 0x000570)
class UJunoPlayerBuildingComponent : public UFortControllerComponent
{ 
public:
	FJunoSelectedSlot                                  ReplicatedSelectedSlot;                                     // 0x00A8   (0x0030)  
	unsigned char                                      UnknownData00_5[0x38];                                      // 0x00D8   (0x0038)  MISSED
	FJunoBuildingSlotDataArray                         BuildBars;                                                  // 0x0110   (0x0270)  
	SDK_UNDEFINED(8,11890) /* TWeakObjectPtr<AJunoGuidedBuildingActor*> */ __um(LastGuidedBuildingActor);          // 0x0380   (0x0008)  
	SDK_UNDEFINED(8,11891) /* TWeakObjectPtr<AJunoGuidedBuildingActor*> */ __um(ReplicatedLastGuidedBuildingActor); // 0x0388   (0x0008)  
	float                                              ReplicateLastGuidedActorTime;                               // 0x0390   (0x0004)  
	float                                              ReplicateBuildingMetricSpatialPrecision;                    // 0x0394   (0x0004)  
	FJunoBuildingSessionInfo                           BuildingSessionInfo;                                        // 0x0398   (0x0028)  
	FJunoInputMapping                                  BuildingMappingContext;                                     // 0x03C0   (0x0010)  
	class UInputAction*                                NextSlot;                                                   // 0x03D0   (0x0008)  
	class UInputAction*                                PrevSlot;                                                   // 0x03D8   (0x0008)  
	class UInputAction*                                ExitBuildMode;                                              // 0x03E0   (0x0008)  
	class UInputAction*                                PinItem;                                                    // 0x03E8   (0x0008)  
	TArray<class UInputAction*>                        BuildBarBindings;                                           // 0x03F0   (0x0010)  
	TArray<FDataTableRowHandle>                        DefaultRecipes;                                             // 0x0400   (0x0010)  
	TArray<FJunoBuildingMetricsClientPermissions>      ClientSpatialMetricsBuildingPermissions;                    // 0x0410   (0x0010)  
	FIntVector                                         LastKnownPawnSpatialCell;                                   // 0x0420   (0x000C)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x042C   (0x0004)  MISSED
	SDK_UNDEFINED(80,11892) /* TSet<FJunoTrackedActorKey> */ __um(DirtyCellLocations);                             // 0x0430   (0x0050)  
	unsigned char                                      UnknownData02_5[0x10];                                      // 0x0480   (0x0010)  MISSED
	int32_t                                            MaxRecentRecipes;                                           // 0x0490   (0x0004)  
	unsigned char                                      UnknownData03_5[0xC4];                                      // 0x0494   (0x00C4)  MISSED
	class UJunoAsyncAction_WaitForEventRouter*         WaitForEventRouterAction;                                   // 0x0558   (0x0008)  
	unsigned char                                      UnknownData04_6[0x10];                                      // 0x0560   (0x0010)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.SetRecipeAtIndex
	// void SetRecipeAtIndex(int32_t InIndex, FName RecipeName, EJunoBuildModeType ModeType);                                // [0xbbbc078] Final|RequiredAPI|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.SetLastGuidedBuildingActor
	// void SetLastGuidedBuildingActor(class AJunoGuidedBuildingActor* InLastGuidedBuildingActor);                           // [0xbbbbfb8] Final|RequiredAPI|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.ServerSetRecipeAtIndex
	// void ServerSetRecipeAtIndex(FJunoSlotIndex NewSlot, FName RecipeName);                                                // [0xbbbbe70] Net|NetReliableNative|Event|Protected|NetServer 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.ServerSetLastGuidedBuildingActor
	// void ServerSetLastGuidedBuildingActor(class AJunoGuidedBuildingActor* InLastActor);                                   // [0x8392544] Net|NetReliableNative|Event|Protected|NetServer 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.ServerSelectSlot
	// void ServerSelectSlot(FJunoSelectedSlot NewSlot);                                                                     // [0xbbbbd54] Net|NetReliableNative|Event|Protected|NetServer 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.ServerEndGuidedBuild
	// void ServerEndGuidedBuild();                                                                                          // [0x8357bf4] RequiredAPI|Net|NetReliableNative|Event|Protected|NetServer 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.OnRep_ReplicateLastGuidedActorTime
	// void OnRep_ReplicateLastGuidedActorTime();                                                                            // [0xbbbbd04] Final|Native|Protected 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.OnRep_ReplicatedSelectedSlot
	// void OnRep_ReplicatedSelectedSlot();                                                                                  // [0xbbbbd2c] Final|Native|Protected 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.OnRep_ReplicatedLastGuidedBuildingActor
	// void OnRep_ReplicatedLastGuidedBuildingActor();                                                                       // [0xbbbbd18] Final|Native|Protected 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.OnGuidedBuildingStageChanged
	// void OnGuidedBuildingStageChanged(FGuidedBuildingUpdate& StageUpdate);                                                // [0xbbbb45c] Final|Native|Protected|HasOutParms 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.OnGuidedBuildDone
	// void OnGuidedBuildDone(FGuidedBuildingUpdate& StageUpdate);                                                           // [0xbbbb3cc] Final|Native|Protected|HasOutParms 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.IsRecipePinned
	// bool IsRecipePinned(FName Recipe);                                                                                    // [0xbbbb300] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.IsBuildModeEnabled
	// bool IsBuildModeEnabled();                                                                                            // [0x2e9f56c] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.HasSelectedRemainingParts
	// bool HasSelectedRemainingParts();                                                                                     // [0xbbbb2dc] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.HasSelectedMissingParts
	// bool HasSelectedMissingParts();                                                                                       // [0xbbbb2b8] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.HandleBuildingMetricsThresholdChange
	// void HandleBuildingMetricsThresholdChange(FInt32Vector& Location);                                                    // [0xbbbb180] Final|Native|Protected|HasOutParms|HasDefaults 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.HandleBuildingMetricsActorCountChange
	// void HandleBuildingMetricsActorCountChange(FInt32Vector& Location, int32_t PreviousActorCount, int32_t NewActorCount); // [0xbbbaf04] Final|Native|Protected|HasOutParms|HasDefaults 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.GetSlotData
	// FJunoBuildingSlotData GetSlotData(int32_t Index, EJunoBuildModeType InType);                                          // [0xbbbacb8] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.GetSelectedSlotIndex
	// int32_t GetSelectedSlotIndex(EJunoBuildModeType InType);                                                              // [0xbbbabe8] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.GetRemainingPartsForSelectedRecipe
	// FJunoGuidedBuildRemainingPartsInfo GetRemainingPartsForSelectedRecipe();                                              // [0xbbbabb4] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.GetLastSelectedRecipe
	// FName GetLastSelectedRecipe();                                                                                        // [0xbbbab9c] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.GetLastLoadedRecipeData
	// FJunoLastLoadedRecipeData GetLastLoadedRecipeData();                                                                  // [0xbbbab84] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.GetLastLoadedRecipe
	// FName GetLastLoadedRecipe();                                                                                          // [0xbbbab6c] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.GetLastGuidedBuildingActor
	// class AJunoGuidedBuildingActor* GetLastGuidedBuildingActor();                                                         // [0xbbbab48] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.GetLastFocusedRecipe
	// FName GetLastFocusedRecipe();                                                                                         // [0xb4687f4] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.GetIsInBuildMode
	// bool GetIsInBuildMode();                                                                                              // [0xbbbab2c] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.GetForcedRecipe
	// FName GetForcedRecipe();                                                                                              // [0x6d470b8] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.GetCurrentRecipe
	// FName GetCurrentRecipe();                                                                                             // [0xbbbab04] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.GetBuildModeType
	// EJunoBuildModeType GetBuildModeType();                                                                                // [0x84381f0] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.EnterGuidedBuilding
	// void EnterGuidedBuilding(class AJunoGuidedBuildingActor* InLastGuidedBuildingActor);                                  // [0xbbbaa44] Final|RequiredAPI|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.EnterBuildingModeAndSelectIndex
	// void EnterBuildingModeAndSelectIndex(int32_t Index, EJunoBuildModeType InType);                                       // [0xbbba8c0] Final|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoPlayerBuildingComponent.AttempEndGuidedBuild
	// void AttempEndGuidedBuild();                                                                                          // [0xbbba8ac] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/JunoGameNative.JunoPlayerCampPawnComponent
/// Size: 0x0070 (0x0000A0 - 0x000110)
class UJunoPlayerCampPawnComponent : public UActorComponent
{ 
public:
	unsigned char                                      UnknownData00_1[0x70];                                      // 0x00A0   (0x0070)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoPlayerCampPawnComponent.HandleAwesomeLevelChanged
	// void HandleAwesomeLevelChanged(FJunoAwesomeLevelChangeData& ChangeData);                                              // [0xbbbae74] Final|Native|Private|HasOutParms 
};

/// Class /Script/JunoGameNative.JunoPlayerControllerComponent_SessionAnalytics
/// Size: 0x0200 (0x0000A0 - 0x0002A0)
class UJunoPlayerControllerComponent_SessionAnalytics : public UControllerComponent
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x00A0   (0x0008)  MISSED
	double                                             JunoPlaySessionStartedTime;                                 // 0x00A8   (0x0008)  
	FGuid                                              JunoPlaySessionID;                                          // 0x00B0   (0x0010)  
	TArray<FName>                                      RecipesUnlockedDuringSession;                               // 0x00C0   (0x0010)  
	float                                              AccumulatedDistanceTraveled;                                // 0x00D0   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x00D4   (0x0004)  MISSED
	FVector                                            LastPlayerPawnLocation;                                     // 0x00D8   (0x0018)  
	unsigned char                                      UnknownData02_5[0x50];                                      // 0x00F0   (0x0050)  MISSED
	SDK_UNDEFINED(16,11893) /* FString */              __um(SavedDisconnectReason);                                // 0x0140   (0x0010)  
	FGameplayEventListenerHandle                       GracefulShutdownInitiatedEventHandle;                       // 0x0150   (0x001C)  
	bool                                               bGracefulShutdownStarted;                                   // 0x016C   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x016D   (0x0003)  MISSED
	int32_t                                            GracefulShutdownExitCode;                                   // 0x0170   (0x0004)  
	int32_t                                            GracefulShutdownMaxTime;                                    // 0x0174   (0x0004)  
	unsigned char                                      UnknownData04_5[0x50];                                      // 0x0178   (0x0050)  MISSED
	FGameplayEventListenerHandle                       PawnEliminatedEventHandle;                                  // 0x01C8   (0x001C)  
	unsigned char                                      UnknownData05_6[0xBC];                                      // 0x01E4   (0x00BC)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoPlayerControllerComponent_SessionAnalytics.ResetHeartbeatStats
	// void ResetHeartbeatStats();                                                                                           // [0xbbbbd40] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoPlayerControllerComponent_SessionAnalytics.OnRep_JunoPlaySessionID
	// void OnRep_JunoPlaySessionID();                                                                                       // [0xbbbbcf0] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoPlayerControllerComponent_SessionAnalytics.OnPlayerStatsUpdateTimer
	// void OnPlayerStatsUpdateTimer();                                                                                      // [0xbbbbcdc] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoPlayerControllerComponent_SessionAnalytics.OnPlayerDisconnecting
	// void OnPlayerDisconnecting(class AFortPlayerController* FortPlayerController, FString DevReason, bool bGracefulDisconnect); // [0xbbbb500] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoPlayerControllerComponent_SessionAnalytics.OnHeartbeatTimer
	// void OnHeartbeatTimer();                                                                                              // [0xbbbb4ec] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoPlayerControllerComponent_SessionAnalytics.HandleInventoryDataRestored
	// void HandleInventoryDataRestored();                                                                                   // [0xbbbb2a4] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoPlayerControllerComponent_SessionAnalytics.HandleGracefulShutdownInitiated
	// void HandleGracefulShutdownInitiated(FFortGracefulShutdownInitiatedEvent& Event);                                     // [0xbbbb208] Final|Native|Private|HasOutParms 
};

/// Class /Script/JunoGameNative.JunoPlayerSaveDataProviderInterface
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoPlayerSaveDataProviderInterface : public UInterface
{ 
public:
};

/// Class /Script/JunoGameNative.JunoPlayerPersistenceFeatureModule
/// Size: 0x0000 (0x0000E0 - 0x0000E0)
class UJunoPlayerPersistenceFeatureModule : public UPersistenceFrameworkModule
{ 
public:
};

/// Class /Script/JunoGameNative.JunoPlayerSaveData_Container
/// Size: 0x0068 (0x0001E0 - 0x000248)
class UJunoPlayerSaveData_Container : public UJunoBasePFWContainer
{ 
public:
	FPersistenceFrameworkPlayerInfo                    PlayerInfo;                                                 // 0x01E0   (0x0020)  
	FUniqueNetIdRepl                                   PlayerNetId;                                                // 0x0200   (0x0030)  
	unsigned char                                      UnknownData00_6[0x18];                                      // 0x0230   (0x0018)  MISSED
};

/// Struct /Script/JunoGameNative.JunoPlayspaceAccountantSaveData
/// Size: 0x0050 (0x000000 - 0x000050)
struct FJunoPlayspaceAccountantSaveData
{ 
	SDK_UNDEFINED(80,11894) /* TMap<FName, int32_t> */ __um(PersistentValueTable);                                 // 0x0000   (0x0050)  
};

/// Class /Script/JunoGameNative.JunoPlayspaceAccountantFeatureData
/// Size: 0x0058 (0x000040 - 0x000098)
class UJunoPlayspaceAccountantFeatureData : public UJunoBasePFWPersistenceFeatureData
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0040   (0x0008)  MISSED
	FJunoPlayspaceAccountantSaveData                   JunoPlayspaceAccountantSaveData;                            // 0x0048   (0x0050)  
};

/// Class /Script/JunoGameNative.JunoPlayspaceAccountantFeatureDataActor
/// Size: 0x0058 (0x0002D0 - 0x000328)
class AJunoPlayspaceAccountantFeatureDataActor : public AJunoPersistenceFeatureDataActor
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x02D0   (0x0008)  MISSED
	SDK_UNDEFINED(80,11895) /* TMap<FName, int32_t> */ __um(PersistentValueTable);                                 // 0x02D8   (0x0050)  
};

/// Class /Script/JunoGameNative.JunoPlayspaceAccountantPersistenceFeatureModule
/// Size: 0x0000 (0x0000E0 - 0x0000E0)
class UJunoPlayspaceAccountantPersistenceFeatureModule : public UPersistenceFrameworkModule
{ 
public:
};

/// Class /Script/JunoGameNative.JunoPlayspaceAccountantPersistenceFeatureData_Container
/// Size: 0x0000 (0x0001E0 - 0x0001E0)
class UJunoPlayspaceAccountantPersistenceFeatureData_Container : public UJunoBasePFWPersistenceFeatureDataContainer
{ 
public:
};

/// Class /Script/JunoGameNative.JunoPlayspaceControllerComponent_PlayerSpawning
/// Size: 0x0018 (0x000118 - 0x000130)
class UJunoPlayspaceControllerComponent_PlayerSpawning : public UPlayspaceControllerComponent_PlayerSpawning
{ 
public:
	unsigned char                                      UnknownData00_1[0x18];                                      // 0x0118   (0x0018)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoPlayspaceControllerComponent_PlayerSpawning.StartRespawn
	// void StartRespawn();                                                                                                  // [0xbbbeef8] Final|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoPlayspaceControllerComponent_PlayerSpawning.ServerQueuePlayerForRespawn
	// void ServerQueuePlayerForRespawn();                                                                                   // [0xbbbecac] Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate 
	// Function /Script/JunoGameNative.JunoPlayspaceControllerComponent_PlayerSpawning.OnPawnPosessed
	// void OnPawnPosessed(class AFortPawn* NewPawn);                                                                        // [0xbbbe7b0] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoPlayspaceControllerComponent_PlayerSpawning.IsAllowedToShowRespawnUI
	// bool IsAllowedToShowRespawnUI();                                                                                      // [0xbbbe780] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/JunoGameNative.JunoPlayspaceIndexPersistenceFeatureModule
/// Size: 0x0000 (0x0000E0 - 0x0000E0)
class UJunoPlayspaceIndexPersistenceFeatureModule : public UPersistenceFrameworkModule
{ 
public:
};

/// Class /Script/JunoGameNative.JunoPlayspaceIndexPersistenceFeatureData_Container
/// Size: 0x0000 (0x0001E0 - 0x0001E0)
class UJunoPlayspaceIndexPersistenceFeatureData_Container : public UJunoBasePFWPersistenceFeatureDataContainer
{ 
public:
};

/// Class /Script/JunoGameNative.JunoPlayspacePersistenceFeatureHelper
/// Size: 0x0028 (0x000028 - 0x000050)
class UJunoPlayspacePersistenceFeatureHelper : public UObject
{ 
public:
	class UClass*                                      PersistenceFeatureDataClass;                                // 0x0028   (0x0008)  
	SDK_UNDEFINED(16,11896) /* TScriptInterface<Class> */ __um(PersistenceFeatureData);                            // 0x0030   (0x0010)  
	unsigned char                                      UnknownData00_6[0x10];                                      // 0x0040   (0x0010)  MISSED
};

/// Class /Script/JunoGameNative.JunoQueryContext_Camp_Center
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoQueryContext_Camp_Center : public UEnvQueryContext
{ 
public:
};

/// Class /Script/JunoGameNative.JunoQueryContext_Camp_Extents
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoQueryContext_Camp_Extents : public UEnvQueryContext
{ 
public:
};

/// Class /Script/JunoGameNative.JunoQuickBuildSelectionData
/// Size: 0x0018 (0x000028 - 0x000040)
class UJunoQuickBuildSelectionData : public UObject
{ 
public:
	int32_t                                            CurrentlySelectedIndex;                                     // 0x0028   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x002C   (0x0004)  MISSED
	TArray<FName>                                      QuickBuildRecipes;                                          // 0x0030   (0x0010)  
};

/// Class /Script/JunoGameNative.JunoRainCapture
/// Size: 0x0030 (0x000290 - 0x0002C0)
class AJunoRainCapture : public AActor
{ 
public:
	class USceneCaptureComponent2D*                    SceneCaptureComponent2D;                                    // 0x0290   (0x0008)  
	class UMaterialParameterCollection*                MaterialParameterCollection;                                // 0x0298   (0x0008)  
	FName                                              RainOccluderSceneCaptureLocationName;                       // 0x02A0   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x02A4   (0x0004)  MISSED
	FVector                                            RainOccluderPositionOffset;                                 // 0x02A8   (0x0018)  
};

/// Class /Script/JunoGameNative.JunoRainCaptureSubsystem
/// Size: 0x0050 (0x000040 - 0x000090)
class UJunoRainCaptureSubsystem : public UTickableWorldSubsystem
{ 
public:
	FSoftObjectPath                                    SubsystemDataAssetPath;                                     // 0x0040   (0x0018)  
	class UJunoRainCaptureSubsystemData*               SubsystemData;                                              // 0x0058   (0x0008)  
	unsigned char                                      UnknownData00_5[0x20];                                      // 0x0060   (0x0020)  MISSED
	class AJunoRainCapture*                            RainCaptureInstance;                                        // 0x0080   (0x0008)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x0088   (0x0008)  MISSED
};

/// Class /Script/JunoGameNative.JunoRainCaptureSubsystemData
/// Size: 0x0038 (0x000030 - 0x000068)
class UJunoRainCaptureSubsystemData : public UPrimaryDataAsset
{ 
public:
	class UMaterialParameterCollection*                MaterialParameterCollection;                                // 0x0030   (0x0008)  
	class UTextureRenderTarget2D*                      TextureTarget;                                              // 0x0038   (0x0008)  
	FName                                              WeatherParameterName;                                       // 0x0040   (0x0004)  
	FName                                              RainOccluderSceneCaptureLocationName;                       // 0x0044   (0x0004)  
	FVector                                            RainOccluderPositionOffset;                                 // 0x0048   (0x0018)  
	float                                              UpdateDistanceThreshold;                                    // 0x0060   (0x0004)  
	float                                              UpdateTimeThreshold;                                        // 0x0064   (0x0004)  
};

/// Class /Script/JunoGameNative.JunoRainOccluderComponent
/// Size: 0x0000 (0x0000A0 - 0x0000A0)
class UJunoRainOccluderComponent : public UGameFrameworkComponent
{ 
public:
};

/// Class /Script/JunoGameNative.JunoReportHandler
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoReportHandler : public UInterface
{ 
public:
};

/// Struct /Script/JunoGameNative.JunoPersistenceFeature
/// Size: 0x00B0 (0x000000 - 0x0000B0)
struct FJunoPersistenceFeature
{ 
	FName                                              Name;                                                       // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0004   (0x0004)  MISSED
	class UClass*                                      Class;                                                      // 0x0008   (0x0008)  
	EJunoPersistenceFeatureCheckoutState               CurrentCheckoutState;                                       // 0x0010   (0x0004)  
	EJunoPersistenceFeatureCheckoutState               TargetCheckoutState;                                        // 0x0014   (0x0004)  
	uint32_t                                           CheckoutStateChangeRequestKey;                              // 0x0018   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4C];                                      // 0x001C   (0x004C)  MISSED
	class UObject*                                     ImplementationCustomStateObject;                            // 0x0068   (0x0008)  
	SDK_UNDEFINED(16,11897) /* TScriptInterface<Class> */ __um(Data);                                              // 0x0070   (0x0010)  
	class UClass*                                      SourceImplementationDataClass;                              // 0x0080   (0x0008)  
	SDK_UNDEFINED(16,11898) /* TScriptInterface<Class> */ __um(DifferentImplementationData);                       // 0x0088   (0x0010)  
	unsigned char                                      UnknownData02_6[0x18];                                      // 0x0098   (0x0018)  MISSED
};

/// Class /Script/JunoGameNative.JunoPlayspacePersistenceComponent
/// Size: 0x0028 (0x0000F8 - 0x000120)
class UJunoPlayspacePersistenceComponent : public UFortPlayspaceComponent
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x00F8   (0x0008)  MISSED
	TArray<class UClass*>                              RequiredPersistenceFeatureDataClasses;                      // 0x0100   (0x0010)  
	TArray<FJunoPersistenceFeature>                    PersistenceFeatures;                                        // 0x0110   (0x0010)  
};

/// Class /Script/JunoGameNative.JunoRootPlayspacePersistenceComponent
/// Size: 0x0000 (0x000120 - 0x000120)
class UJunoRootPlayspacePersistenceComponent : public UJunoPlayspacePersistenceComponent
{ 
public:
};

/// Class /Script/JunoGameNative.JunoSmartObjectComponent
/// Size: 0x0010 (0x0002D0 - 0x0002E0)
class UJunoSmartObjectComponent : public UFortSmartObjectComponent
{ 
public:
	class UCurveFloat*                                 LootTierPercentageToSlotPickingModifier;                    // 0x02D0   (0x0008)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x02D8   (0x0008)  MISSED
};

/// Class /Script/JunoGameNative.JunoSyncTimeOfDayComponent
/// Size: 0x0008 (0x0000A0 - 0x0000A8)
class UJunoSyncTimeOfDayComponent : public UActorComponent
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x00A0   (0x0008)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoSyncTimeOfDayComponent.SetTimeOfDaySyncEnabled
	// void SetTimeOfDaySyncEnabled(bool bNewTimeOfDaySyncEnabled);                                                          // [0xbbbee38] Final|Native|Protected|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoSyncTimeOfDayComponent.GetTimeOfDaySyncEnabled
	// bool GetTimeOfDaySyncEnabled();                                                                                       // [0x80a279c] Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/JunoGameNative.JunoSyncWeatherComponent
/// Size: 0x0050 (0x0000A0 - 0x0000F0)
class UJunoSyncWeatherComponent : public UActorComponent
{ 
public:
	unsigned char                                      UnknownData00_1[0x50];                                      // 0x00A0   (0x0050)  MISSED
};

/// Class /Script/JunoGameNative.JunoTeamStart
/// Size: 0x0008 (0x0002C0 - 0x0002C8)
class AJunoTeamStart : public APlayerStart
{ 
public:
	float                                              CapsuleRadius;                                              // 0x02C0   (0x0004)  
	float                                              CapsuleHeight;                                              // 0x02C4   (0x0004)  
};

/// Class /Script/JunoGameNative.JunoTeleporter
/// Size: 0x0010 (0x000BC8 - 0x000BD8)
class AJunoTeleporter : public ABuildingProp
{ 
public:
	SDK_UNDEFINED(8,11899) /* TWeakObjectPtr<AJunoTeleporter*> */ __um(TargetTeleporter);                          // 0x0BC8   (0x0008)  
	bool                                               bIsTeleporterEnabled;                                       // 0x0BD0   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0BD1   (0x0007)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoTeleporter.SetTargetTeleporter
	// void SetTargetTeleporter(class AJunoTeleporter* TargetTeleportActor);                                                 // [0xbbbecf8] Final|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoTeleporter.IsTeleporterEnabled
	// bool IsTeleporterEnabled();                                                                                           // [0xbbbe798] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoTeleporter.GetTargetTeleporter
	// class AJunoTeleporter* GetTargetTeleporter();                                                                         // [0xbbbe50c] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Struct /Script/JunoGameNative.TemperatureRange
/// Size: 0x0014 (0x000000 - 0x000014)
struct FTemperatureRange
{ 
	FGameplayTag                                       tag;                                                        // 0x0000   (0x0004)  
	FFloatRange                                        Range;                                                      // 0x0004   (0x0010)  
};

/// Class /Script/JunoGameNative.JunoTemperatureAttributeSet
/// Size: 0x0100 (0x000030 - 0x000130)
class UJunoTemperatureAttributeSet : public UFortAttributeSet
{ 
public:
	FGameplayTagContainer                              BlockedTemperatures;                                        // 0x0030   (0x0020)  
	FFortGameplayAttributeData                         Temperature;                                                // 0x0050   (0x0028)  
	FFortGameplayAttributeData                         ColdResistance;                                             // 0x0078   (0x0028)  
	FFortGameplayAttributeData                         HeatResistance;                                             // 0x00A0   (0x0028)  
	FGameplayTag                                       CurrentTemperature;                                         // 0x00C8   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x00CC   (0x0004)  MISSED
	TArray<FTemperatureRange>                          TemperatureRanges;                                          // 0x00D0   (0x0010)  
	SDK_UNDEFINED(16,11900) /* FMulticastInlineDelegate */ __um(OnTemperatureChanged);                             // 0x00E0   (0x0010)  
	SDK_UNDEFINED(16,11901) /* FMulticastInlineDelegate */ __um(OnTemperatureRangesChanged);                       // 0x00F0   (0x0010)  
	bool                                               bAddTemperatureTagToActor;                                  // 0x0100   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0101   (0x0003)  MISSED
	FGameplayTag                                       ForcedTemperature;                                          // 0x0104   (0x0004)  
	unsigned char                                      UnknownData02_6[0x28];                                      // 0x0108   (0x0028)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoTemperatureAttributeSet.OnRep_TemperatureRanges
	// void OnRep_TemperatureRanges();                                                                                       // [0xbbbec98] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoTemperatureAttributeSet.OnRep_Temperature
	// void OnRep_Temperature(FFortGameplayAttributeData& OldValue);                                                         // [0xbbbeb98] Final|Native|Private|HasOutParms 
	// Function /Script/JunoGameNative.JunoTemperatureAttributeSet.OnRep_HeatResistance
	// void OnRep_HeatResistance(FFortGameplayAttributeData& OldValue);                                                      // [0xbbbea98] Final|Native|Private|HasOutParms 
	// Function /Script/JunoGameNative.JunoTemperatureAttributeSet.OnRep_CurrentTemperature
	// void OnRep_CurrentTemperature(FGameplayTag OldTemperature);                                                           // [0xbbbe984] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoTemperatureAttributeSet.OnRep_ColdResistance
	// void OnRep_ColdResistance(FFortGameplayAttributeData& OldValue);                                                      // [0xbbbe884] Final|Native|Private|HasOutParms 
	// Function /Script/JunoGameNative.JunoTemperatureAttributeSet.HandleWeatherTemperatureChanged
	// void HandleWeatherTemperatureChanged(FJunoEvent_TemperatureChanged Payload);                                          // [0xbbbe6a4] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoTemperatureAttributeSet.ForceTemperature
	// void ForceTemperature(FGameplayTag TemperatureToForce);                                                               // [0xbbbe44c] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/JunoGameNative.JunoTemperatureComponent
/// Size: 0x0008 (0x0000A0 - 0x0000A8)
class UJunoTemperatureComponent : public UGameFrameworkComponent
{ 
public:
	SDK_UNDEFINED(8,11902) /* TWeakObjectPtr<UJunoTemperatureAttributeSet*> */ __um(TemperatureAttributeSet);      // 0x00A0   (0x0008)  


	/// Functions
	// Function /Script/JunoGameNative.JunoTemperatureComponent.HandleOwnerASCInvalidated
	// void HandleOwnerASCInvalidated();                                                                                     // [0xbbbe67c] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoTemperatureComponent.HandleOwnerASCInitialized
	// void HandleOwnerASCInitialized(class UFortAbilitySystemComponent* FortAbilitySystemComponent, class AFortPlayerPawn* AffectedPawn); // [0xbbbe534] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoTemperatureComponent.GetTemperatureAttributeSet
	// class UJunoTemperatureAttributeSet* GetTemperatureAttributeSet();                                                     // [0x65745ec] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/JunoGameNative.JunoTemplatesReportHandler
/// Size: 0x0018 (0x000028 - 0x000040)
class UJunoTemplatesReportHandler : public UObject
{ 
public:
	unsigned char                                      UnknownData00_1[0x18];                                      // 0x0028   (0x0018)  MISSED
};

/// Class /Script/JunoGameNative.JunoToyAttachmentFixupComponent
/// Size: 0x0008 (0x0000A0 - 0x0000A8)
class UJunoToyAttachmentFixupComponent : public UActorComponent
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x00A0   (0x0008)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoToyAttachmentFixupComponent.HandleToyAttachementFixupTimer
	// void HandleToyAttachementFixupTimer();                                                                                // [0xbbbe690] Final|Native|Protected 
};

/// Class /Script/JunoGameNative.JunoUpdateActionsReportHandler
/// Size: 0x0018 (0x000028 - 0x000040)
class UJunoUpdateActionsReportHandler : public UObject
{ 
public:
	unsigned char                                      UnknownData00_1[0x18];                                      // 0x0028   (0x0018)  MISSED
};

/// Class /Script/JunoGameNative.JunoWeaponAbility
/// Size: 0x0000 (0x000B60 - 0x000B60)
class UJunoWeaponAbility : public UFortGameplayAbility
{ 
public:
};

/// Class /Script/JunoGameNative.JunoWeaponCreatureItemDefinition
/// Size: 0x0020 (0x000CD0 - 0x000CF0)
class UJunoWeaponCreatureItemDefinition : public UFortWeaponRangedItemDefinition
{ 
public:
	TArray<class UClass*>                              Debug_CreaturesToSpawn;                                     // 0x0CD0   (0x0010)  
	TArray<FDataTableRowHandle>                        SpawnEvents;                                                // 0x0CE0   (0x0010)  
};

/// Class /Script/JunoGameNative.JunoWeaponsBlueprintLibrary
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoWeaponsBlueprintLibrary : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/JunoGameNative.JunoWeaponsBlueprintLibrary.GetSpawnEvents
	// TArray<FDataTableRowHandle> GetSpawnEvents(class UGameplayAbility* GameplayAbility);                                  // [0xbbc12ac] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/JunoGameNative.JunoWeaponsBlueprintLibrary.GetCreaturesToSpawn
	// TArray<UClass*> GetCreaturesToSpawn(class UGameplayAbility* GameplayAbility);                                         // [0xbbc08fc] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
};

/// Class /Script/JunoGameNative.JunoWeatherFXPersistence
/// Size: 0x0058 (0x000290 - 0x0002E8)
class AJunoWeatherFXPersistence : public AActor
{ 
public:
	class UMaterialParameterCollection*                MaterialParameterCollection;                                // 0x0290   (0x0008)  
	class UMaterialParameterCollectionInstance*        CachedMPCInstance;                                          // 0x0298   (0x0008)  
	FLinearColor                                       WindPosition;                                               // 0x02A0   (0x0010)  
	FLinearColor                                       WindValueInCave;                                            // 0x02B0   (0x0010)  
	float                                              MaxWindSpeed;                                               // 0x02C0   (0x0004)  
	FLinearColor                                       GustMaxWindSpeedAddend;                                     // 0x02C4   (0x0010)  
	float                                              WindScalar;                                                 // 0x02D4   (0x0004)  
	FName                                              WindParamName;                                              // 0x02D8   (0x0004)  
	FName                                              WindPositionParamName;                                      // 0x02DC   (0x0004)  
	FName                                              WindPreviousPositionParamName;                              // 0x02E0   (0x0004)  
	bool                                               bInCave;                                                    // 0x02E4   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x02E5   (0x0003)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoWeatherFXPersistence.UpdateWindGust
	// void UpdateWindGust(float IntensityScalar, FVector& GustIntensity, FLinearColor& CurrentWind);                        // [0xbbc1dac] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
};

/// Class /Script/JunoGameNative.JunoWeatherLibrary
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoWeatherLibrary : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/JunoGameNative.JunoWeatherLibrary.StringToLocation
	// FJunoWeatherLocation StringToLocation(FName LocationName);                                                            // [0xbbc1be0] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/JunoGameNative.JunoWeatherLibrary.RollWeatherFromSeason
	// FJunoWeatherPhase RollWeatherFromSeason(FJunoWeatherSeasonRow& Season, FJunoWeatherLocation& Location, FGameplayTag& OptionalWeatherType); // [0xbbc1928] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoWeatherLibrary.RollWeatherFromForecast
	// FJunoWeatherPhase RollWeatherFromForecast(FJunoWeatherPhaseForecast& Forecast);                                       // [0xbbc1868] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoWeatherLibrary.NotEqual_JunoWeatherLocation
	// bool NotEqual_JunoWeatherLocation(FJunoWeatherLocation& A, FJunoWeatherLocation& B);                                  // [0xbbc1538] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/JunoGameNative.JunoWeatherLibrary.FindGameStateWeatherComponent
	// class UJunoGameStateWeatherComponent* FindGameStateWeatherComponent(class UObject* WorldContextObject);               // [0xbbc06f4] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/JunoGameNative.JunoWeatherLibrary.EqualEqual_JunoWeatherLocation
	// bool EqualEqual_JunoWeatherLocation(FJunoWeatherLocation& A, FJunoWeatherLocation& B);                                // [0xbbc0600] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/JunoGameNative.JunoWeatherLibrary.DescribePhase
	// FString DescribePhase(FJunoWeatherPhase& WeatherPhase);                                                               // [0xbbc0558] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoWeatherLibrary.DescribeLocation
	// FString DescribeLocation(FJunoWeatherLocation& WeatherLocation);                                                      // [0xbbc04b4] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoWeatherLibrary.CalculateLocation
	// FJunoWeatherLocation CalculateLocation(class AActor* Actor);                                                          // [0xbbc03e0] Final|Native|Static|Public|BlueprintCallable 
};

/// Class /Script/JunoGameNative.JunoWeatherLocationComponent
/// Size: 0x0018 (0x0000A0 - 0x0000B8)
class UJunoWeatherLocationComponent : public UGameFrameworkComponent
{ 
public:
	SDK_UNDEFINED(16,11903) /* FMulticastInlineDelegate */ __um(OnLocationChanged);                                // 0x00A0   (0x0010)  
	FJunoWeatherLocation                               Location;                                                   // 0x00B0   (0x0002)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x00B2   (0x0006)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoWeatherLocationComponent.OnRep_Location
	// void OnRep_Location(FJunoWeatherLocation& OldLocation);                                                               // [0xbbc1640] Final|Native|Protected|HasOutParms 
	// Function /Script/JunoGameNative.JunoWeatherLocationComponent.HandleLocationChanged
	// void HandleLocationChanged();                                                                                         // [0xbbc1440] Final|Native|Protected|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoWeatherLocationComponent.GetLocation
	// FJunoWeatherLocation GetLocation();                                                                                   // [0xbbc11f8] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoWeatherLocationComponent.BP_CalculateLocation
	// FJunoWeatherLocation BP_CalculateLocation();                                                                          // [0xbbc03b0] Native|Event|Protected|BlueprintEvent|Const 
};

/// Class /Script/JunoGameNative.JunoWeatherPersistenceFeatureModule
/// Size: 0x0000 (0x0000E0 - 0x0000E0)
class UJunoWeatherPersistenceFeatureModule : public UPersistenceFrameworkModule
{ 
public:
};

/// Class /Script/JunoGameNative.JunoWeatherPersistenceFeatureData_Container
/// Size: 0x0000 (0x0001E0 - 0x0001E0)
class UJunoWeatherPersistenceFeatureData_Container : public UJunoBasePFWPersistenceFeatureDataContainer
{ 
public:
};

/// Class /Script/JunoGameNative.JunoWeatherReactionComponent
/// Size: 0x0028 (0x0000A0 - 0x0000C8)
class UJunoWeatherReactionComponent : public UActorComponent
{ 
public:
	SDK_UNDEFINED(16,11904) /* FMulticastInlineDelegate */ __um(OnWeatherPhaseChanged);                            // 0x00A0   (0x0010)  
	SDK_UNDEFINED(16,11905) /* FMulticastInlineDelegate */ __um(OnTemperatureChanged);                             // 0x00B0   (0x0010)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x00C0   (0x0008)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoWeatherReactionComponent.ReceiveOnWeatherPhaseChanged
	// void ReceiveOnWeatherPhaseChanged(FJunoEvent_WeatherPhaseChanged Payload);                                            // [0x2047e54] Event|Public|BlueprintEvent 
	// Function /Script/JunoGameNative.JunoWeatherReactionComponent.ReceiveOnTemperatureChanged
	// void ReceiveOnTemperatureChanged(FJunoEvent_TemperatureChanged Payload);                                              // [0x2047e54] Event|Public|BlueprintEvent 
	// Function /Script/JunoGameNative.JunoWeatherReactionComponent.HandleWeatherLocationChanged
	// void HandleWeatherLocationChanged(FJunoWeatherLocationChangedEvent Payload);                                          // [0xbbc1454] Final|Native|Protected 
	// Function /Script/JunoGameNative.JunoWeatherReactionComponent.GetCurrentWeatherPhase
	// FJunoWeatherPhase GetCurrentWeatherPhase();                                                                           // [0xbbc1128] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoWeatherReactionComponent.GetCurrentTemperatureFloat
	// float GetCurrentTemperatureFloat();                                                                                   // [0xbbc1100] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoWeatherReactionComponent.GetCurrentTemperature
	// FGameplayTag GetCurrentTemperature();                                                                                 // [0xbbc1090] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoWeatherReactionComponent.GetClosestStatefulLocationFor
	// FJunoWeatherLocation GetClosestStatefulLocationFor(FJunoWeatherLocation& WeatherLocation);                            // [0xbbc0868] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoWeatherReactionComponent.FindWeatherState
	// class UJunoWeatherStateComponent* FindWeatherState();                                                                 // [0xbbc07b4] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/JunoGameNative.JunoWeatherStateComponent
/// Size: 0x00E8 (0x0000A0 - 0x000188)
class UJunoWeatherStateComponent : public UGameFrameworkComponent
{ 
public:
	unsigned char                                      UnknownData00_2[0x30];                                      // 0x00A0   (0x0030)  MISSED
	FJunoWeatherLocation                               Location;                                                   // 0x00D0   (0x0002)  
	unsigned char                                      UnknownData01_5[0x6];                                       // 0x00D2   (0x0006)  MISSED
	class UDataTable*                                  SeasonTable;                                                // 0x00D8   (0x0008)  
	unsigned char                                      UnknownData02_5[0x8];                                       // 0x00E0   (0x0008)  MISSED
	FJunoWeatherPhase                                  CurrentWeatherPhase;                                        // 0x00E8   (0x0038)  
	FJunoWeatherPhase                                  NextWeatherPhase;                                           // 0x0120   (0x0038)  
	TArray<FJunoWeatherPhase>                          NextWeatherQueue;                                           // 0x0158   (0x0010)  
	unsigned char                                      UnknownData03_6[0x20];                                      // 0x0168   (0x0020)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoWeatherStateComponent.TransitionWeatherNowTo
	// void TransitionWeatherNowTo(FJunoWeatherPhase& NewWeatherPhase, FJunoWeatherPhase& NewNextWeatherPhase);              // [0xbbc1cb4] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoWeatherStateComponent.TransitionWeatherNow
	// void TransitionWeatherNow();                                                                                          // [0xbbc1ca0] Final|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoWeatherStateComponent.SetAutoTransitioning
	// void SetAutoTransitioning(bool bAutoTransitionWeather);                                                               // [0xbbc1b20] Final|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoWeatherStateComponent.RollWeatherPhase
	// FJunoWeatherPhase RollWeatherPhase();                                                                                 // [0xbbc1ad8] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoWeatherStateComponent.RerollNextWeatherWith
	// void RerollNextWeatherWith(FGameplayTag& WeatherTypeName);                                                            // [0xbbc17a0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoWeatherStateComponent.ReceiveWeatherPhaseChanged
	// void ReceiveWeatherPhaseChanged(FJunoEvent_WeatherPhaseChanged& Payload);                                             // [0x2047e54] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Script/JunoGameNative.JunoWeatherStateComponent.ReceiveTemperatureChanged
	// void ReceiveTemperatureChanged(FJunoEvent_TemperatureChanged& Payload);                                               // [0x2047e54] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Script/JunoGameNative.JunoWeatherStateComponent.QueueNextWeather
	// void QueueNextWeather(FJunoWeatherPhase& QueuedWeather);                                                              // [0xbbc1710] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoWeatherStateComponent.OnRep_CurrentWeatherPhase
	// void OnRep_CurrentWeatherPhase();                                                                                     // [0xbbc162c] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoWeatherStateComponent.IsAutoTransitioning
	// bool IsAutoTransitioning();                                                                                           // [0xbbc1520] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoWeatherStateComponent.GetTransitionOutAlpha
	// float GetTransitionOutAlpha();                                                                                        // [0xbbc1428] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoWeatherStateComponent.GetTransitionInAlpha
	// float GetTransitionInAlpha();                                                                                         // [0xbbc1410] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoWeatherStateComponent.GetNextWeatherQueue
	// TArray<FJunoWeatherPhase> GetNextWeatherQueue();                                                                      // [0xbbc1270] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoWeatherStateComponent.GetNextWeatherPhase
	// FJunoWeatherPhase GetNextWeatherPhase();                                                                              // [0xbbc1230] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoWeatherStateComponent.GetLocation
	// FJunoWeatherLocation GetLocation();                                                                                   // [0xbbc1214] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoWeatherStateComponent.GetCurrentWeatherPhase
	// FJunoWeatherPhase GetCurrentWeatherPhase();                                                                           // [0xbbc11b8] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoWeatherStateComponent.GetCurrentTemperatureFloat
	// float GetCurrentTemperatureFloat();                                                                                   // [0x6d470d0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoWeatherStateComponent.GetCurrentTemperature
	// FGameplayTag GetCurrentTemperature();                                                                                 // [0xbbc10d4] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoWeatherStateComponent.GetCurrentSeason
	// FGameplayTag GetCurrentSeason();                                                                                      // [0xbbc1060] Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoWeatherStateComponent.ForceNextWeatherTo
	// void ForceNextWeatherTo(FJunoWeatherPhase& NewNextWeatherPhase);                                                      // [0xbbc07d8] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoWeatherStateComponent.ClearNextWeatherQueue
	// void ClearNextWeatherQueue();                                                                                         // [0xbbc04a0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/JunoGameNative.JunoWorldPersistenceCheckpointManager
/// Size: 0x0028 (0x000028 - 0x000050)
class UJunoWorldPersistenceCheckpointManager : public UObject
{ 
public:
	int32_t                                            CheckpointIntervalSeconds;                                  // 0x0028   (0x0004)  
	int32_t                                            MinCheckpointIntervalSeconds;                               // 0x002C   (0x0004)  
	int32_t                                            MaxCheckpointCountWithinConfiguredInterval;                 // 0x0030   (0x0004)  
	unsigned char                                      UnknownData00_6[0x1C];                                      // 0x0034   (0x001C)  MISSED
};

/// Class /Script/JunoGameNative.JunoWorldPersistenceFeatureModule
/// Size: 0x0000 (0x0000E0 - 0x0000E0)
class UJunoWorldPersistenceFeatureModule : public UPersistenceFrameworkModule
{ 
public:
};

/// Class /Script/JunoGameNative.JunoWorldPersistenceFeatureData_Container
/// Size: 0x0000 (0x0001E0 - 0x0001E0)
class UJunoWorldPersistenceFeatureData_Container : public UJunoBasePFWPersistenceFeatureDataContainer
{ 
public:
};

/// Class /Script/JunoGameNative.JunoWorldPersistenceSubsystem
/// Size: 0x00F8 (0x000030 - 0x000128)
class UJunoWorldPersistenceSubsystem : public UWorldSubsystem
{ 
public:
	unsigned char                                      UnknownData00_2[0x38];                                      // 0x0030   (0x0038)  MISSED
	bool                                               bEnableWorldPersistence;                                    // 0x0068   (0x0001)  
	bool                                               bEnableWorldPersistenceInPIE;                               // 0x0069   (0x0001)  
	unsigned char                                      UnknownData01_5[0x6];                                       // 0x006A   (0x0006)  MISSED
	class UJunoWorldPersistenceHandler*                WorldPersistenceHandler;                                    // 0x0070   (0x0008)  
	class UJunoWorldPersistencePlayerManager*          WorldPersistencePlayerManager;                              // 0x0078   (0x0008)  
	class UJunoWorldPersistenceSubsystemData*          SubsystemData;                                              // 0x0080   (0x0008)  
	class UJunoWorldPersistenceCheckpointManager*      CheckpointManager;                                          // 0x0088   (0x0008)  
	SDK_UNDEFINED(80,11906) /* TMap<FGuid, TWeakObjectPtr<AJunoPersistentPlayspace*>> */ __um(PersistentPlayspaceMap); // 0x0090   (0x0050)  
	EJunoWorldSaveDataState                            WorldSaveDataState;                                         // 0x00E0   (0x0001)  
	unsigned char                                      UnknownData02_5[0x7];                                       // 0x00E1   (0x0007)  MISSED
	FSoftObjectPath                                    SubsystemDataAssetPath;                                     // 0x00E8   (0x0018)  
	unsigned char                                      UnknownData03_5[0x18];                                      // 0x0100   (0x0018)  MISSED
	SDK_UNDEFINED(16,11907) /* TArray<FString> */      __um(ErrorCodeAllowList);                                   // 0x0118   (0x0010)  


	/// Functions
	// Function /Script/JunoGameNative.JunoWorldPersistenceSubsystem.WasActorSpawnedFromSavedGame
	// bool WasActorSpawnedFromSavedGame(class AActor* Actor);                                                               // [0xbbc43e8] Final|RequiredAPI|Native|Static|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoWorldPersistenceSubsystem.RequestActorSave
	// void RequestActorSave(class AActor* Actor);                                                                           // [0xbbc3ef8] Final|RequiredAPI|Native|Static|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoWorldPersistenceSubsystem.GenerateDeterministicMapActorGUID
	// FGuid GenerateDeterministicMapActorGUID(class AActor* Actor);                                                         // [0xbbc26e0] Final|RequiredAPI|Native|Static|Public|HasDefaults|BlueprintCallable 
};

/// Class /Script/JunoGameNative.JunoWorldPersistenceSubsystemData
/// Size: 0x0018 (0x000030 - 0x000048)
class UJunoWorldPersistenceSubsystemData : public UPrimaryDataAsset
{ 
public:
	TArray<class UClass*>                              AvailableWorldPersistenceHandlerClasses;                    // 0x0030   (0x0010)  
	class UClass*                                      DefaultWorldPersistenceHandlerClass;                        // 0x0040   (0x0008)  
};

/// Class /Script/JunoGameNative.JunoWorldRegistryInterface
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoWorldRegistryInterface : public UInterface
{ 
public:


	/// Functions
	// Function /Script/JunoGameNative.JunoWorldRegistryInterface.GetWorldDebugInfoText
	// void GetWorldDebugInfoText(class AFortPlayerPawn* PlayerPawn, FJunoDebugWorldInfoResult& WorldDebugInfo);             // [0xbbc3080] Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoWorldRegistryInterface.GetWorldAnalyticsInfo
	// void GetWorldAnalyticsInfo(class UObject* WorldContextObject, FVector& WorldLocation, FJunoWorldAnalyticsInfoResult& WorldAnalyticsInfo); // [0xbbc28c0] Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/JunoGameNative.JunoWorldSettingsBlueprintLibrary
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoWorldSettingsBlueprintLibrary : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/JunoGameNative.JunoWorldSettingsBlueprintLibrary.TurnWorldSettingOn
	// void TurnWorldSettingOn(class UObject* WorldContextObject, FGameplayTag& SettingName);                                // [0xbbc4294] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoWorldSettingsBlueprintLibrary.TurnWorldSettingOff
	// void TurnWorldSettingOff(class UObject* WorldContextObject, FGameplayTag& SettingName);                               // [0xbbc4140] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoWorldSettingsBlueprintLibrary.IsWorldSettingTainted
	// bool IsWorldSettingTainted(class UObject* WorldContextObject, FGameplayTag& SettingName);                             // [0xbbc36dc] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoWorldSettingsBlueprintLibrary.IsWorldSettingSaved
	// bool IsWorldSettingSaved(class UObject* WorldContextObject, FGameplayTag& SettingName);                               // [0xbbc3580] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoWorldSettingsBlueprintLibrary.IsWorldSettingOn
	// bool IsWorldSettingOn(class UObject* WorldContextObject, FGameplayTag& SettingName);                                  // [0xbbc3438] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoWorldSettingsBlueprintLibrary.GetAllWorldSettingNames
	// TArray<FGameplayTag> GetAllWorldSettingNames(class UObject* WorldContextObject);                                      // [0xbbc27ec] Final|Native|Static|Public|BlueprintCallable 
};

/// Struct /Script/JunoGameNative.JunoWorldSettingMapping
/// Size: 0x0008 (0x000000 - 0x000008)
struct FJunoWorldSettingMapping
{ 
	FGameplayTag                                       TagName;                                                    // 0x0000   (0x0004)  
	FName                                              SavedName;                                                  // 0x0004   (0x0004)  
};

/// Struct /Script/JunoGameNative.JunoWorldSettingRepState
/// Size: 0x0008 (0x000000 - 0x000008)
struct FJunoWorldSettingRepState
{ 
	FGameplayTag                                       SettingName;                                                // 0x0000   (0x0004)  
	bool                                               bIsSettingOn;                                               // 0x0004   (0x0001)  
	bool                                               bIsSettingTainted;                                          // 0x0005   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x0006   (0x0002)  MISSED
};

/// Class /Script/JunoGameNative.JunoWorldSettingsComponent
/// Size: 0x0030 (0x0000A0 - 0x0000D0)
class UJunoWorldSettingsComponent : public UPlayspaceComponent
{ 
public:
	TArray<FJunoWorldSettingMapping>                   OptionalSettingNames;                                       // 0x00A0   (0x0010)  
	TArray<FJunoWorldSettingRepState>                  WorldSettings;                                              // 0x00B0   (0x0010)  
	unsigned char                                      UnknownData00_6[0x10];                                      // 0x00C0   (0x0010)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoWorldSettingsComponent.TurnSettingOn
	// void TurnSettingOn(FGameplayTag& SettingName);                                                                        // [0xbbc4078] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoWorldSettingsComponent.TurnSettingOff
	// void TurnSettingOff(FGameplayTag& SettingName);                                                                       // [0xbbc3fb0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoWorldSettingsComponent.OnRep_WorldSettings
	// void OnRep_WorldSettings(TArray<FJunoWorldSettingRepState>& OldValue);                                                // [0xbbc3838] Final|Native|Private|HasOutParms 
	// Function /Script/JunoGameNative.JunoWorldSettingsComponent.IsSettingTainted
	// bool IsSettingTainted(FGameplayTag& SettingName);                                                                     // [0xbbc3364] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoWorldSettingsComponent.IsSettingSaved
	// bool IsSettingSaved(FGameplayTag& SettingName);                                                                       // [0xbbc3290] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoWorldSettingsComponent.IsSettingOn
	// bool IsSettingOn(FGameplayTag& SettingName);                                                                          // [0xbbc31bc] Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoWorldSettingsComponent.GetAllSettingNames
	// TArray<FGameplayTag> GetAllSettingNames();                                                                            // [0xbbc27ac] Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Struct /Script/JunoGameNative.JunoWorldSettingsSaveData
/// Size: 0x0010 (0x000000 - 0x000010)
struct FJunoWorldSettingsSaveData
{ 
	TArray<FName>                                      TaintedSettings;                                            // 0x0000   (0x0010)  
};

/// Class /Script/JunoGameNative.JunoWorldSettingsPersistenceFeatureData
/// Size: 0x0068 (0x000040 - 0x0000A8)
class UJunoWorldSettingsPersistenceFeatureData : public UJunoBasePFWPersistenceFeatureData
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0040   (0x0008)  MISSED
	SDK_UNDEFINED(80,11908) /* TMap<FName, bool> */    __um(BoolWorldSettings);                                    // 0x0048   (0x0050)  
	FJunoWorldSettingsSaveData                         WorldSettingsSaveData;                                      // 0x0098   (0x0010)  
};

/// Class /Script/JunoGameNative.JunoWorldSettingsPersistenceFeatureModule
/// Size: 0x0000 (0x0000E0 - 0x0000E0)
class UJunoWorldSettingsPersistenceFeatureModule : public UPersistenceFrameworkModule
{ 
public:
};

/// Class /Script/JunoGameNative.JunoWorldSettingsPersistenceFeatureData_Container
/// Size: 0x0000 (0x0001E0 - 0x0001E0)
class UJunoWorldSettingsPersistenceFeatureData_Container : public UJunoBasePFWPersistenceFeatureDataContainer
{ 
public:
};

/// Class /Script/JunoGameNative.JunoMapMarkerCustomizationInitData
/// Size: 0x00C0 (0x000028 - 0x0000E8)
class UJunoMapMarkerCustomizationInitData : public UObject
{ 
public:
	FGuid                                              MarkerID;                                                   // 0x0028   (0x0010)  
	FJunoMarker                                        NewMarker;                                                  // 0x0038   (0x0098)  
	SDK_UNDEFINED(24,11909) /* FText */                __um(DisplayName);                                          // 0x00D0   (0x0018)  
};

/// Class /Script/JunoGameNative.PhysicalStrainHealthSubsystem
/// Size: 0x0018 (0x000040 - 0x000058)
class UPhysicalStrainHealthSubsystem : public UTickableWorldSubsystem
{ 
public:
	unsigned char                                      UnknownData00_1[0x18];                                      // 0x0040   (0x0018)  MISSED
};

/// Class /Script/JunoGameNative.PhysicalStrainHealthRuntimeSettings
/// Size: 0x0010 (0x000030 - 0x000040)
class UPhysicalStrainHealthRuntimeSettings : public UDeveloperSettings
{ 
public:
	EPhysicalStrainHealthMode                          Mode;                                                       // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0031   (0x0003)  MISSED
	float                                              FatigueDamageThresholdPercent;                              // 0x0034   (0x0004)  
	float                                              FatigueDamageThresholdMinimum;                              // 0x0038   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x003C   (0x0004)  MISSED
};

/// Class /Script/JunoGameNative.JunoCampWorldConditionSchema
/// Size: 0x0008 (0x000038 - 0x000040)
class UJunoCampWorldConditionSchema : public UWorldConditionSchema
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0038   (0x0008)  MISSED
};

/// Struct /Script/JunoGameNative.ReplicatedCampData
/// Size: 0x0058 (0x000000 - 0x000058)
struct FReplicatedCampData
{ 
	FGuid                                              CampActorID;                                                // 0x0000   (0x0010)  
	FPrimaryAssetId                                    CampCenterAssetID;                                          // 0x0010   (0x0008)  
	FBox                                               CampBounds;                                                 // 0x0018   (0x0038)  
	bool                                               bIsSoftRemoved;                                             // 0x0050   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0051   (0x0007)  MISSED
};

/// Struct /Script/JunoGameNative.POIEncounterDataForCamps
/// Size: 0x0040 (0x000000 - 0x000040)
struct FPOIEncounterDataForCamps
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
	FBox                                               Bounds;                                                     // 0x0008   (0x0038)  
};

/// Class /Script/JunoGameNative.PlayspaceComponent_JunoRootCampManagement
/// Size: 0x04D8 (0x0000F8 - 0x0005D0)
class UPlayspaceComponent_JunoRootCampManagement : public UFortPlayspaceComponent
{ 
public:
	FScalableFloat                                     TimeBeforeSoftRemovedCampBecomesHardRemovedInJunoGameTimeHours; // 0x00F8   (0x0028)  
	FScalableFloat                                     RunValidityChecksForCampPlacementOnServer;                  // 0x0120   (0x0028)  
	FScalableFloat                                     RunValidityChecksForCampPlacementOnClients;                 // 0x0148   (0x0028)  
	FScalableFloat                                     BoxExtentsForCampValidityCheck;                             // 0x0170   (0x0028)  
	FScalableFloat                                     BoxExtentsForCampValidityCheckForPOIs;                      // 0x0198   (0x0028)  
	FScalableFloat                                     MoveCampWhenNewSquareIsAddedAfterSoftRemoval;               // 0x01C0   (0x0028)  
	SDK_UNDEFINED(80,11910) /* TMap<int32_t, UDataTable*> */ __um(PlayerPerksPerAwesomenessLevel);                 // 0x01E8   (0x0050)  
	SDK_UNDEFINED(80,11911) /* TMap<int32_t, UDataTable*> */ __um(NPCPerksPerAwesomenessLevel);                    // 0x0238   (0x0050)  
	SDK_UNDEFINED(80,11912) /* TMap<EJunoBiome, UDataTable*> */ __um(NPCPerksPerBiome);                            // 0x0288   (0x0050)  
	unsigned char                                      UnknownData00_5[0x30];                                      // 0x02D8   (0x0030)  MISSED
	class UJunoAsyncAction_WaitForEventRouter*         WaitForEventRouterAction;                                   // 0x0308   (0x0008)  
	unsigned char                                      UnknownData01_5[0x10];                                      // 0x0310   (0x0010)  MISSED
	TArray<FReplicatedCampData>                        ReplicatedCampDatas;                                        // 0x0320   (0x0010)  
	unsigned char                                      UnknownData02_5[0x150];                                     // 0x0330   (0x0150)  MISSED
	TArray<FPOIEncounterDataForCamps>                  LoadedPOIEncounters;                                        // 0x0480   (0x0010)  
	unsigned char                                      UnknownData03_6[0x140];                                     // 0x0490   (0x0140)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.PlayspaceComponent_JunoRootCampManagement.IsAValidLocationForANewCamp
	// bool IsAValidLocationForANewCamp(FVector& Location, FGameplayTagContainer& OutFailureReasons);                        // [0xbbf1b9c] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.PlayspaceComponent_JunoRootCampManagement.GetRootPlayspaceJunoCampManagementComponent
	// class UPlayspaceComponent_JunoRootCampManagement* GetRootPlayspaceJunoCampManagementComponent(class UObject* WorldContextObject); // [0xbbf1a28] Final|RequiredAPI|Native|Static|Public|BlueprintCallable 
};

/// Class /Script/JunoGameNative.JunoAwesomeInteractionConfigMappings
/// Size: 0x0050 (0x000030 - 0x000080)
class UJunoAwesomeInteractionConfigMappings : public UDataAsset
{ 
public:
	SDK_UNDEFINED(80,11913) /* TMap<FGameplayTag, FDataTableRowHandle> */ __um(InteractionConfigMap);              // 0x0030   (0x0050)  
};

/// Class /Script/JunoGameNative.JunoAwesomePlacementConfigMappings
/// Size: 0x00B0 (0x000030 - 0x0000E0)
class UJunoAwesomePlacementConfigMappings : public UDataAsset
{ 
public:
	unsigned char                                      UnknownData00_2[0x50];                                      // 0x0030   (0x0050)  MISSED
	class UDataTable*                                  PlacementConfigTable;                                       // 0x0080   (0x0008)  
	unsigned char                                      UnknownData01_5[0x50];                                      // 0x0088   (0x0050)  MISSED
	class UDataTable*                                  CategoryConfigTable;                                        // 0x00D8   (0x0008)  
};

/// Class /Script/JunoGameNative.JunoAwesomePoiConfigMappings
/// Size: 0x0060 (0x000030 - 0x000090)
class UJunoAwesomePoiConfigMappings : public UDataAsset
{ 
public:
	SDK_UNDEFINED(80,11914) /* TMap<EJunoBiome, FDataTableRowHandle> */ __um(PoiConfigMap);                        // 0x0030   (0x0050)  
	FDataTableRowHandle                                DefaultConfig;                                              // 0x0080   (0x0010)  
};

/// Class /Script/JunoGameNative.JunoAwesomeSystemDatabaseComponent
/// Size: 0x0018 (0x0000F8 - 0x000110)
class UJunoAwesomeSystemDatabaseComponent : public UFortPlayspaceComponent
{ 
public:
	class UJunoAwesomeInteractionConfigMappings*       InteractionConfigMappings;                                  // 0x00F8   (0x0008)  
	class UJunoAwesomePlacementConfigMappings*         PlacementConfigMappings;                                    // 0x0100   (0x0008)  
	class UJunoAwesomePoiConfigMappings*               PoiConfigMappings;                                          // 0x0108   (0x0008)  
};

/// Struct /Script/JunoGameNative.JunoAwesomeThresholdMapping
/// Size: 0x0090 (0x000000 - 0x000090)
struct FJunoAwesomeThresholdMapping
{ 
	TArray<class UJunoActionConfig*>                   ThresholdActionConfigs;                                     // 0x0000   (0x0010)  
	FScalableFloat                                     AwesomeLevelThreshold;                                      // 0x0010   (0x0028)  
	FScalableFloat                                     AwesomeLevelRangeMinThreshold;                              // 0x0038   (0x0028)  
	FScalableFloat                                     AwesomeLevelRangeMaxThreshold;                              // 0x0060   (0x0028)  
	EJunoAwesomeThresholdTestMode                      ThresholdTestMode;                                          // 0x0088   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x008C   (0x0004)  MISSED
};

/// Class /Script/JunoGameNative.JunoAwesomeThresholdsComponent
/// Size: 0x0038 (0x0000A0 - 0x0000D8)
class UJunoAwesomeThresholdsComponent : public UGameFrameworkComponent
{ 
public:
	SDK_UNDEFINED(16,11915) /* FMulticastInlineDelegate */ __um(OnAwesomeLevelChanged);                            // 0x00A0   (0x0010)  
	TArray<FJunoAwesomeThresholdMapping>               AwesomeThresholdToActionsMappings;                          // 0x00B0   (0x0010)  
	unsigned char                                      UnknownData00_6[0x18];                                      // 0x00C0   (0x0018)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoAwesomeThresholdsComponent.HandleJunoAwesomeLevelChanged
	// void HandleJunoAwesomeLevelChanged(FJunoAwesomeLevelChangeData& ChangeData);                                          // [0xbbf1ae8] Final|Native|Private|HasOutParms 
};

/// Struct /Script/JunoGameNative.JunoAwesomeUpgradeResourceCost
/// Size: 0x0028 (0x000000 - 0x000028)
struct FJunoAwesomeUpgradeResourceCost
{ 
	SDK_UNDEFINED(32,11916) /* TWeakObjectPtr<UFortItemDefinition*> */ __um(ResourceCostItemDefinition);           // 0x0000   (0x0020)  
	int32_t                                            ItemAmount;                                                 // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/JunoGameNative.JunoAwesomeUpgradeResourceCostList
/// Size: 0x0010 (0x000000 - 0x000010)
struct FJunoAwesomeUpgradeResourceCostList
{ 
	TArray<FJunoAwesomeUpgradeResourceCost>            ResourceCostList;                                           // 0x0000   (0x0010)  
};

/// Struct /Script/JunoGameNative.JunoAwesomePointModificationData
/// Size: 0x0028 (0x000000 - 0x000028)
struct FJunoAwesomePointModificationData
{ 
	int32_t                                            AwesomePointAmount;                                         // 0x0000   (0x0004)  
	int32_t                                            AwesomePointsPostModification;                              // 0x0004   (0x0004)  
	class AActor*                                      SourceActor;                                                // 0x0008   (0x0008)  
	class AActor*                                      TargetActor;                                                // 0x0010   (0x0008)  
	EJunoAwesomePointModificationContext               ModificationContext;                                        // 0x0018   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0019   (0x0007)  MISSED
	class AJunoCampActor*                              OwningCamp;                                                 // 0x0020   (0x0008)  
};

/// Struct /Script/JunoGameNative.JunoAwesomeLevelChangeData
/// Size: 0x0018 (0x000000 - 0x000018)
struct FJunoAwesomeLevelChangeData
{ 
	int32_t                                            NewAwesomeLevel;                                            // 0x0000   (0x0004)  
	int32_t                                            OldAwesomeLevel;                                            // 0x0004   (0x0004)  
	int32_t                                            CurrentAwesomePoints;                                       // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x000C   (0x0004)  MISSED
	class AJunoCampActor*                              OwningCamp;                                                 // 0x0010   (0x0008)  
};

/// Struct /Script/JunoGameNative.AwesomePerkReward
/// Size: 0x0050 (0x000000 - 0x000050)
struct FAwesomePerkReward
{ 
	SDK_UNDEFINED(24,11917) /* FText */                __um(Title);                                                // 0x0000   (0x0018)  
	SDK_UNDEFINED(24,11918) /* FText */                __um(Description);                                          // 0x0018   (0x0018)  
	FGameplayTagContainer                              GameplayTags;                                               // 0x0030   (0x0020)  
};

/// Struct /Script/JunoGameNative.AwesomeLevelRewardEntry
/// Size: 0x0028 (0x000000 - 0x000028)
struct FAwesomeLevelRewardEntry
{ 
	int32_t                                            MaxVillagerCapacity;                                        // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0004   (0x0004)  MISSED
	TArray<FAwesomePerkReward>                         PlayerPerkRewards;                                          // 0x0008   (0x0010)  
	TArray<FAwesomePerkReward>                         NPCPerkRewards;                                             // 0x0018   (0x0010)  
};

/// Class /Script/JunoGameNative.JunoAwesomeLevelComponent
/// Size: 0x0100 (0x0000A0 - 0x0001A0)
class UJunoAwesomeLevelComponent : public UJunoCampComponentBase
{ 
public:
	SDK_UNDEFINED(16,11919) /* FMulticastInlineDelegate */ __um(OnJunoAwesomeLevelChangedDelegate);                // 0x00A0   (0x0010)  
	SDK_UNDEFINED(16,11920) /* FMulticastInlineDelegate */ __um(OnJunoAwesomePointModification);                   // 0x00B0   (0x0010)  
	SDK_UNDEFINED(16,11921) /* FMulticastInlineDelegate */ __um(OnJunoAwesomeComponentReadyDelegate);              // 0x00C0   (0x0010)  
	int32_t                                            AwesomeLevel;                                               // 0x00D0   (0x0004)  
	int32_t                                            CurrentAwesomePoints;                                       // 0x00D4   (0x0004)  
	TArray<int32_t>                                    AwesomePointGoals;                                          // 0x00D8   (0x0010)  
	TArray<FJunoAwesomeUpgradeResourceCostList>        AwesomeUpgradeResourceCosts;                                // 0x00E8   (0x0010)  
	FJunoAwesomeUpgradeResourceCostList                CurrentUpgradeResourceCosts;                                // 0x00F8   (0x0010)  
	FGameplayTag                                       PoiType;                                                    // 0x0108   (0x0004)  
	EJunoBiome                                         CampBiomeType;                                              // 0x010C   (0x0001)  
	unsigned char                                      UnknownData00_5[0x13];                                      // 0x010D   (0x0013)  MISSED
	bool                                               bIsReadyForUse;                                             // 0x0120   (0x0001)  
	bool                                               bIsFromPersistence;                                         // 0x0121   (0x0001)  
	unsigned char                                      UnknownData01_5[0x26];                                      // 0x0122   (0x0026)  MISSED
	FJunoAwesomePointModificationData                  CachedAwesomePointModificationData;                         // 0x0148   (0x0028)  
	FJunoAwesomeLevelChangeData                        CachedAwesomeLevelChangeData;                               // 0x0170   (0x0018)  
	bool                                               bSkipAwesomeUpgradeResourceChecks;                          // 0x0188   (0x0001)  
	unsigned char                                      UnknownData02_5[0x7];                                       // 0x0189   (0x0007)  MISSED
	TArray<FAwesomeLevelRewardEntry>                   AwesomeLevelRewardEntries;                                  // 0x0190   (0x0010)  


	/// Functions
	// Function /Script/JunoGameNative.JunoAwesomeLevelComponent.TriggerAwesomeLevelChange
	// void TriggerAwesomeLevelChange(class AFortPlayerController* TriggeringPlayer);                                        // [0xbbf23e0] Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoAwesomeLevelComponent.ProcessAwesomePointModifierCheat
	// bool ProcessAwesomePointModifierCheat(int32_t AwesomePointAmount, class AActor* SourceActor);                         // [0xbbf1f8c] Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoAwesomeLevelComponent.OnRep_CurrentAwesomePoints
	// void OnRep_CurrentAwesomePoints();                                                                                    // [0xbbf1f14] Final|Native|Protected 
	// Function /Script/JunoGameNative.JunoAwesomeLevelComponent.OnRep_bIsReadyForUse
	// void OnRep_bIsReadyForUse();                                                                                          // [0xbbf1f60] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoAwesomeLevelComponent.OnRep_AwesomeLevel
	// void OnRep_AwesomeLevel();                                                                                            // [0xbbf1efc] Final|Native|Protected 
	// Function /Script/JunoGameNative.JunoAwesomeLevelComponent.OnAwesomeSettingsInitialized
	// void OnAwesomeSettingsInitialized();                                                                                  // [0xbbf1ee8] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoAwesomeLevelComponent.IsReadyForUse
	// bool IsReadyForUse();                                                                                                 // [0xa838358] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoAwesomeLevelComponent.IsAwesomeLevelUpPending
	// EJunoAwesomeLevelUpgradeQueryResult IsAwesomeLevelUpPending(class AFortPlayerController* TriggeringPlayer);           // [0xbbf1cf8] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoAwesomeLevelComponent.HasEnoughAwesomePointsForALevelUp
	// bool HasEnoughAwesomePointsForALevelUp();                                                                             // [0xbbf1b78] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoAwesomeLevelComponent.GetMaxAwesomeLevel
	// int32_t GetMaxAwesomeLevel();                                                                                         // [0xbbf19f0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoAwesomeLevelComponent.GetMaxAwesomeIndex
	// int32_t GetMaxAwesomeIndex();                                                                                         // [0x6d470b8] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoAwesomeLevelComponent.GetCurrentUpgradeResourceCosts
	// FJunoAwesomeUpgradeResourceCostList GetCurrentUpgradeResourceCosts();                                                 // [0xbbf19b8] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoAwesomeLevelComponent.GetCurrentAwesomePointGoal
	// int32_t GetCurrentAwesomePointGoal();                                                                                 // [0xbbf1994] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoAwesomeLevelComponent.GetCurrentAwesomePointFloor
	// int32_t GetCurrentAwesomePointFloor();                                                                                // [0xbbf1970] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoAwesomeLevelComponent.GetBiomeType
	// EJunoBiome GetBiomeType();                                                                                            // [0x6371d2c] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoAwesomeLevelComponent.GetAwesomePointsNeededForNextLevel
	// int32_t GetAwesomePointsNeededForNextLevel();                                                                         // [0xbbf194c] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoAwesomeLevelComponent.GetAwesomePoints
	// int32_t GetAwesomePoints();                                                                                           // [0x9a67a5c] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoAwesomeLevelComponent.GetAwesomeLevelRewardEntries
	// TArray<FAwesomeLevelRewardEntry> GetAwesomeLevelRewardEntries();                                                      // [0xbbf1930] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoAwesomeLevelComponent.GetAwesomeLevelFromCurrentPoints
	// int32_t GetAwesomeLevelFromCurrentPoints();                                                                           // [0xbbf190c] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoAwesomeLevelComponent.GetAwesomeLevel
	// int32_t GetAwesomeLevel();                                                                                            // [0x8757b10] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoAwesomeLevelComponent.BP_OnAwesomePointsModified
	// void BP_OnAwesomePointsModified(FJunoAwesomePointModificationData& ModificationData);                                 // [0x2047e54] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Script/JunoGameNative.JunoAwesomeLevelComponent.BP_OnAwesomeLevelChanged
	// void BP_OnAwesomeLevelChanged(FJunoAwesomeLevelChangeData& ChangeData);                                               // [0x2047e54] Event|Protected|HasOutParms|BlueprintEvent 
};

/// Class /Script/JunoGameNative.JunoNamedPOIComponent
/// Size: 0x00D8 (0x0000A0 - 0x000178)
class UJunoNamedPOIComponent : public UJunoCampComponentBase
{ 
public:
	SDK_UNDEFINED(16,11922) /* FMulticastInlineDelegate */ __um(OnJunoPOIMarkerChangedDelegate);                   // 0x00A0   (0x0010)  
	unsigned char                                      UnknownData00_5[0x10];                                      // 0x00B0   (0x0010)  MISSED
	SDK_UNDEFINED(24,11923) /* FText */                __um(POIName);                                              // 0x00C0   (0x0018)  
	FJunoMarker                                        Marker;                                                     // 0x00D8   (0x0098)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x0170   (0x0008)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoNamedPOIComponent.SetPOIName
	// void SetPOIName(FText& NewPOIName);                                                                                   // [0xbbf2344] Final|BlueprintAuthorityOnly|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoNamedPOIComponent.SetMarker
	// void SetMarker(FJunoMarker& NewMarker);                                                                               // [0xbbf2280] Final|BlueprintAuthorityOnly|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoNamedPOIComponent.ProcessCampReadyLogic
	// void ProcessCampReadyLogic(FJunoCampAwesomeStatsData& ReadyData);                                                     // [0xbbf2130] Final|Native|Private|HasOutParms 
	// Function /Script/JunoGameNative.JunoNamedPOIComponent.PrepareForCampReadyLogic
	// void PrepareForCampReadyLogic();                                                                                      // [0xbbf1f78] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoNamedPOIComponent.OnRep_Marker
	// void OnRep_Marker();                                                                                                  // [0xbbf1f2c] Final|Native|Private 
	// Function /Script/JunoGameNative.JunoNamedPOIComponent.OnAwesomePointsModifiedCosmetic
	// void OnAwesomePointsModifiedCosmetic(FJunoAwesomePointModificationData& ModificationData);                            // [0xbbf1e58] Final|Native|Protected|HasOutParms 
	// Function /Script/JunoGameNative.JunoNamedPOIComponent.OnAwesomeLevelChangedCosmetic
	// void OnAwesomeLevelChangedCosmetic(FJunoAwesomeLevelChangeData& ChangeData);                                          // [0xbbf1dc8] Final|Native|Protected|HasOutParms 
	// Function /Script/JunoGameNative.JunoNamedPOIComponent.K2_OnPlayerExitedCampCosmetic
	// void K2_OnPlayerExitedCampCosmetic(int32_t CurrentAwesomeLevel, int32_t AwesomePoints, class AJunoCampActor* OwningCamp); // [0x2047e54] Event|Protected|BlueprintEvent 
	// Function /Script/JunoGameNative.JunoNamedPOIComponent.K2_OnPlayerEnteredCampCosmetic
	// void K2_OnPlayerEnteredCampCosmetic(int32_t CurrentAwesomeLevel, int32_t AwesomePoints, class AJunoCampActor* OwningCamp); // [0x2047e54] Event|Protected|BlueprintEvent 
	// Function /Script/JunoGameNative.JunoNamedPOIComponent.K2_OnAwesomePointsModifiedCosmetic
	// void K2_OnAwesomePointsModifiedCosmetic(FJunoAwesomePointModificationData& ModificationData);                         // [0x2047e54] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Script/JunoGameNative.JunoNamedPOIComponent.K2_OnAwesomeLevelChangedCosmetic
	// void K2_OnAwesomeLevelChangedCosmetic(FJunoAwesomeLevelChangeData& ChangeData);                                       // [0x2047e54] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Script/JunoGameNative.JunoNamedPOIComponent.GetPOIName
	// FText GetPOIName();                                                                                                   // [0xbbf1a0c] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoNamedPOIComponent.GetMarker
	// FJunoMarker GetMarker();                                                                                              // [0xbbf19d4] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/JunoGameNative.JunoAdventurePlayspaceBase
/// Size: 0x0028 (0x0006C0 - 0x0006E8)
class AJunoAdventurePlayspaceBase : public AFortPlayspace
{ 
public:
	bool                                               bShouldPersist;                                             // 0x06C0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x06C1   (0x0007)  MISSED
	FGameplayTagContainer                              AdventureTags;                                              // 0x06C8   (0x0020)  


	/// Functions
	// Function /Script/JunoGameNative.JunoAdventurePlayspaceBase.RemoveAdventureTags
	// void RemoveAdventureTags(FGameplayTagContainer& TagsToRemove);                                                        // [0xbbf21c4] Final|BlueprintAuthorityOnly|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoAdventurePlayspaceBase.GetAdventureTags
	// FGameplayTagContainer GetAdventureTags();                                                                             // [0xbbf18f0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoAdventurePlayspaceBase.ContainsController
	// bool ContainsController(class AController* Controller);                                                               // [0xbbf17f4] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoAdventurePlayspaceBase.AppendAdventureTags
	// void AppendAdventureTags(FGameplayTagContainer& TagsToAdd);                                                           // [0xbbf1738] Final|BlueprintAuthorityOnly|Native|Public|HasOutParms|BlueprintCallable 
};

/// Struct /Script/JunoGameNative.JunoCampRewardRecipeResult
/// Size: 0x0028 (0x000000 - 0x000028)
struct FJunoCampRewardRecipeResult
{ 
	SDK_UNDEFINED(32,11924) /* TWeakObjectPtr<UJunoBuildInstructionsItemDefinition*> */ __um(KnowledgeItemDefinition); // 0x0000   (0x0020)  
	EJunoKnowledgeState                                NewState;                                                   // 0x0020   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0021   (0x0007)  MISSED
};

/// Struct /Script/JunoGameNative.JunoCampRewardResults
/// Size: 0x0020 (0x000000 - 0x000020)
struct FJunoCampRewardResults
{ 
	TArray<FFortItemEntry>                             Items;                                                      // 0x0000   (0x0010)  
	TArray<FJunoCampRewardRecipeResult>                Recipes;                                                    // 0x0010   (0x0010)  
};

/// Struct /Script/JunoGameNative.JunoCampSaveData
/// Size: 0x00A0 (0x000000 - 0x0000A0)
struct FJunoCampSaveData
{ 
	FGuid                                              CampCenterID;                                               // 0x0000   (0x0010)  
	FPrimaryAssetId                                    CampCenterAssetID;                                          // 0x0010   (0x0008)  
	FGuid                                              CampActorID;                                                // 0x0018   (0x0010)  
	FBox                                               CampBounds;                                                 // 0x0028   (0x0038)  
	int64_t                                            SoftRemovedElapsedJunoGameTime;                             // 0x0060   (0x0008)  
	int64_t                                            LastRewardsRollInJunoGameTime;                              // 0x0068   (0x0008)  
	FJunoCampRewardResults                             LastRewardResults;                                          // 0x0070   (0x0020)  
	FName                                              LastRewardsRollLootTierGroupToSave;                         // 0x0090   (0x0004)  
	int32_t                                            LastAwesomenessLevel;                                       // 0x0094   (0x0004)  
	EJunoBiome                                         CampBiome;                                                  // 0x0098   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0099   (0x0007)  MISSED
};

/// Struct /Script/JunoGameNative.JunoAllCampsSaveData
/// Size: 0x0010 (0x000000 - 0x000010)
struct FJunoAllCampsSaveData
{ 
	TArray<FJunoCampSaveData>                          Camps;                                                      // 0x0000   (0x0010)  
};

/// Class /Script/JunoGameNative.JunoCampPersistenceFeatureData
/// Size: 0x0018 (0x000040 - 0x000058)
class UJunoCampPersistenceFeatureData : public UJunoBasePFWPersistenceFeatureData
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0040   (0x0008)  MISSED
	FJunoAllCampsSaveData                              SavedAllCamps;                                              // 0x0048   (0x0010)  
};

/// Class /Script/JunoGameNative.JunoCampPersistenceFeatureDataActor
/// Size: 0x0018 (0x0002D0 - 0x0002E8)
class AJunoCampPersistenceFeatureDataActor : public AJunoPersistenceFeatureDataActor
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x02D0   (0x0008)  MISSED
	TArray<FJunoCampSaveData>                          SavedCamps;                                                 // 0x02D8   (0x0010)  
};

/// Class /Script/JunoGameNative.JunoCampPersistenceFeatureDataInterface
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoCampPersistenceFeatureDataInterface : public UInterface
{ 
public:
};

/// Class /Script/JunoGameNative.JunoQuestActorSpawnPoint
/// Size: 0x0020 (0x000290 - 0x0002B0)
class AJunoQuestActorSpawnPoint : public AActor
{ 
public:
	FGameplayTagContainer                              SpawnTags;                                                  // 0x0290   (0x0020)  
};

/// Class /Script/JunoGameNative.JunoVerbProcessor_AwesomeLevelIncreased
/// Size: 0x0000 (0x0000A0 - 0x0000A0)
class UJunoVerbProcessor_AwesomeLevelIncreased : public UFortObjectiveProcessor
{ 
public:
};

/// Class /Script/JunoGameNative.JunoVerbProcessor_GuidedBuildCompleted
/// Size: 0x0000 (0x0000A0 - 0x0000A0)
class UJunoVerbProcessor_GuidedBuildCompleted : public UFortObjectiveProcessor
{ 
public:
};

/// Class /Script/JunoGameNative.JunoVerbProcessor_GuidedBuildStageCompleted
/// Size: 0x0000 (0x0000A0 - 0x0000A0)
class UJunoVerbProcessor_GuidedBuildStageCompleted : public UFortObjectiveProcessor
{ 
public:
};

/// Class /Script/JunoGameNative.JunoVerbProcessor_RecruitNPC
/// Size: 0x0000 (0x0000A0 - 0x0000A0)
class UJunoVerbProcessor_RecruitNPC : public UFortObjectiveProcessor
{ 
public:
};

/// Class /Script/JunoGameNative.JunoVerbProcessor_TemperatureUpdated
/// Size: 0x0000 (0x0000A0 - 0x0000A0)
class UJunoVerbProcessor_TemperatureUpdated : public UFortObjectiveProcessor
{ 
public:
};

/// Class /Script/JunoGameNative.JunoAdventureGameplayVolume
/// Size: 0x0040 (0x000330 - 0x000370)
class AJunoAdventureGameplayVolume : public AGameplayVolume
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0330   (0x0008)  MISSED
	bool                                               bShouldPersist;                                             // 0x0338   (0x0001)  
	bool                                               bDestroyLinkedPlayspaceOnEndPlay;                           // 0x0339   (0x0001)  
	unsigned char                                      UnknownData01_5[0x1E];                                      // 0x033A   (0x001E)  MISSED
	FGuid                                              SavedActorGuid;                                             // 0x0358   (0x0010)  
	unsigned char                                      UnknownData02_6[0x8];                                       // 0x0368   (0x0008)  MISSED
};

/// Class /Script/JunoGameNative.JunoAINavInvokerComponent
/// Size: 0x0000 (0x0000B0 - 0x0000B0)
class UJunoAINavInvokerComponent : public UNavigationInvokerComponent
{ 
public:


	/// Functions
	// Function /Script/JunoGameNative.JunoAINavInvokerComponent.OnPlayerPossessed
	// void OnPlayerPossessed(class APawn* Pawn);                                                                            // [0xbc260e4] Final|Native|Protected 
	// Function /Script/JunoGameNative.JunoAINavInvokerComponent.OnNPCPossessed
	// void OnNPCPossessed(class APawn* Pawn);                                                                               // [0xbc26024] Final|Native|Protected 
};

/// Class /Script/JunoGameNative.JunoNavSystemConfig
/// Size: 0x0000 (0x0000B8 - 0x0000B8)
class UJunoNavSystemConfig : public UAthenaNavSystemConfig
{ 
public:
};

/// Class /Script/JunoGameNative.JunoPhysicsObjectNavigationComponent
/// Size: 0x00A0 (0x0000A0 - 0x000140)
class UJunoPhysicsObjectNavigationComponent : public UActorComponent
{ 
public:
	float                                              LowSpeedThreshold;                                          // 0x00A0   (0x0004)  
	float                                              LowSpeedDistanceThreshold;                                  // 0x00A4   (0x0004)  
	float                                              LowSpeedRotationThreshold;                                  // 0x00A8   (0x0004)  
	float                                              LowSpeedScaleThreshold;                                     // 0x00AC   (0x0004)  
	float                                              LowSpeedDurationTrigger;                                    // 0x00B0   (0x0004)  
	unsigned char                                      UnknownData00_5[0x6C];                                      // 0x00B4   (0x006C)  MISSED
	class UPrimitiveComponent*                         PrimitiveComponentAffectingNavMesh;                         // 0x0120   (0x0008)  
	unsigned char                                      UnknownData01_6[0x18];                                      // 0x0128   (0x0018)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoPhysicsObjectNavigationComponent.OnWake
	// void OnWake(class UPrimitiveComponent* SimulatingComponent, FName BoneName);                                          // [0xbc26800] Final|RequiredAPI|Native|Protected 
	// Function /Script/JunoGameNative.JunoPhysicsObjectNavigationComponent.OnSleep
	// void OnSleep(class UPrimitiveComponent* SimulatingComponent, FName BoneName);                                         // [0xbc264c0] Final|RequiredAPI|Native|Protected 
	// Function /Script/JunoGameNative.JunoPhysicsObjectNavigationComponent.OnRemovedFromClusterUnion
	// void OnRemovedFromClusterUnion(class UClusterUnionComponent* ClusterUnion, class UPrimitiveComponent* Component);     // [0xbc26358] Final|RequiredAPI|Native|Protected 
	// Function /Script/JunoGameNative.JunoPhysicsObjectNavigationComponent.OnClusterUnionPhysicsObjectAwakeChanged
	// void OnClusterUnionPhysicsObjectAwakeChanged(class UPrimitiveComponent* SimulatingComponent, bool bIsAwake);          // [0xbc25ee4] Final|RequiredAPI|Native|Protected 
	// Function /Script/JunoGameNative.JunoPhysicsObjectNavigationComponent.OnAddedToClusterUnion
	// void OnAddedToClusterUnion(class UClusterUnionComponent* ClusterUnion, class UPrimitiveComponent* Component);         // [0xbc25c6c] Final|RequiredAPI|Native|Protected 
};

/// Class /Script/JunoGameNative.JunoGameFeatureAction_AddJunoAnalytics
/// Size: 0x0008 (0x000028 - 0x000030)
class UJunoGameFeatureAction_AddJunoAnalytics : public UGameFeatureAction
{ 
public:
	class UJunoAnalytics*                              JunoAnalytics;                                              // 0x0028   (0x0008)  
};

/// Class /Script/JunoGameNative.JunoAnimationBlueprintLibrary
/// Size: 0x0000 (0x000028 - 0x000028)
class UJunoAnimationBlueprintLibrary : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/JunoGameNative.JunoAnimationBlueprintLibrary.ImpactOrDamage
	// void ImpactOrDamage(FGameplayTagContainer& DamageTags, class AFortPawn* DamageInstigator, class AActor* DamageSource, EImpactOrDamage_ExecutionPin& ExecutionPin); // [0xbc258f4] Final|Native|Static|Private|HasOutParms|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoAnimationBlueprintLibrary.HasMatchingImpactCue
	// bool HasMatchingImpactCue(FGameplayTagContainer& DamageTags, class AFortPawn* DamageInstigator, class AActor* DamageSource); // [0xbc25734] Final|Native|Static|Private|HasOutParms|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoAnimationBlueprintLibrary.GetFacingTargetRotation
	// FRotator GetFacingTargetRotation(class USceneComponent* Source, class USceneComponent* Target, bool bYawOnly);        // [0xbc24b74] Final|Native|Static|Private|HasDefaults|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoAnimationBlueprintLibrary.GetFacingRotation
	// FRotator GetFacingRotation(FVector SourceLocation, FVector TargetLocation);                                           // [0xbc249ec] Final|Native|Static|Private|HasDefaults|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoAnimationBlueprintLibrary.GetClampedWarpTargetLocation
	// void GetClampedWarpTargetLocation(FVector WarpStartLocation, FVector WarpTargetLocation, float WarpTargetRadius, float WarpDistanceMax, bool ConstrainToPawnForwardVector, FVector PawnForward, FVector& ClampedTargetLocation, FRotator& FaceTargetRotation); // [0xbc245b4] Final|Native|Static|Private|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoAnimationBlueprintLibrary.GetCapsuleActorSpaceBounds
	// void GetCapsuleActorSpaceBounds(class UCapsuleComponent* Capsule, FVector& Origin, FVector& Extents);                 // [0xbc243e8] Final|Native|Static|Private|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoAnimationBlueprintLibrary.AbilityMontage_SetNextSection
	// void AbilityMontage_SetNextSection(class AFortPawn* FortPawn, FName NextSection);                                     // [0xbc227d0] Final|Native|Static|Private|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoAnimationBlueprintLibrary.AbilityMontage_ReplicatePosition
	// void AbilityMontage_ReplicatePosition(class AFortPawn* FortPawn, bool bReplicatePosition);                            // [0xbc2266c] Final|Native|Static|Private|BlueprintCallable 
};

/// Class /Script/JunoGameNative.JunoAnimInstance
/// Size: 0x0010 (0x000460 - 0x000470)
class UJunoAnimInstance : public UFortBaseAnimInstance
{ 
public:
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0460   (0x0010)  MISSED


	/// Functions
	// Function /Script/JunoGameNative.JunoAnimInstance.UpdateAnimationTimer
	// void UpdateAnimationTimer(float& TimeRemaining, bool& bTimeIsExpired, EUpdateAnimationTimer_ExecutionPin& ExecutionPin); // [0xbc276c0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoAnimInstance.RandomizeAnimationTimer
	// void RandomizeAnimationTimer(float MinTime, float MaxTime, float& TimeRemaining, bool& bTimeIsExpired);               // [0xbc2693c] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/JunoGameNative.JunoAnimInstance.GetMainAnimInstance
	// class UJunoAnimInstance* GetMainAnimInstance();                                                                       // [0xbc252d0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/JunoGameNative.JunoAnimInstance.BlendCurvesByName
	// float BlendCurvesByName(FName CurveA, FName CurveB, float Alpha);                                                     // [0xbc2293c] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/JunoGameNative.JunoGliderAnimInstance
/// Size: 0x0010 (0x000830 - 0x000840)
class UJunoGliderAnimInstance : public UFortGliderAnimInstance
{ 
public:
	bool                                               bIsSkydiving : 1;                                           // 0x0828:0 (0x0001)  
	bool                                               bIsParachuteOpen : 1;                                       // 0x0828:1 (0x0001)  
	bool                                               bGliderUseFastDeploy : 1;                                   // 0x0828:2 (0x0001)  
	unsigned char                                      UnknownData00_4[0x3];                                       // 0x0829   (0x0003)  MISSED
	float                                              GliderPitch;                                                // 0x082C   (0x0004)  
	float                                              GliderRoll;                                                 // 0x0830   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0834   (0x0004)  MISSED
	class UJunoPlayerAnimInstance*                     PlayerAnimInstance;                                         // 0x0838   (0x0008)  
};

/// Class /Script/JunoGameNative.JunoMinifigAnimationComponent
/// Size: 0x0018 (0x0000A0 - 0x0000B8)
class UJunoMinifigAnimationComponent : public UPawnComponent
{ 
public:
	FRotator                                           MinifigLookAtRotation;                                      // 0x00A0   (0x0018)  
};

/// Class /Script/JunoGameNative.JunoPawnAnimInstance
/// Size: 0x0100 (0x000470 - 0x000570)
class UJunoPawnAnimInstance : public UJunoAnimInstance
{ 
public:
	float                                              PawnMovingSpeedThreshold;                                   // 0x0470   (0x0004)  
	bool                                               bIsFalling;                                                 // 0x0474   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0475   (0x0003)  MISSED
	float                                              PawnSpeed2D;                                                // 0x0478   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x047C   (0x0004)  MISSED
	FVector                                            PawnVelocity;                                               // 0x0480   (0x0018)  
	FRotator                                           PawnRotationRate;                                           // 0x0498   (0x0018)  
	bool                                               bPawnIsDying : 1;                                           // 0x04B0:0 (0x0001)  
	bool                                               bPawnIsFalling : 1;                                         // 0x04B0:1 (0x0001)  
	bool                                               bPawnIsOnGround : 1;                                        // 0x04B0:2 (0x0001)  
	bool                                               bPawnIsIdling : 1;                                          // 0x04B0:3 (0x0001)  
	bool                                               bPawnIsJumping : 1;                                         // 0x04B0:4 (0x0001)  
	bool                                               bPawnIsMoving2D : 1;                                        // 0x04B0:5 (0x0001)  
	bool                                               bPawnIsMovingOnGround : 1;                                  // 0x04B0:6 (0x0001)  
	bool                                               bPawnWasMoving2D : 1;                                       // 0x04B0:7 (0x0001)  
	bool                                               bPawnHasAcceleration : 1;                                   // 0x04B1:0 (0x0001)  
	bool                                               bPawnHasRootMotion : 1;                                     // 0x04B1:1 (0x0001)  
	bool                                               bPawnHasVelocity : 1;                                       // 0x04B1:2 (0x0001)  
	bool                                               bPawnIdleBreakTimeIsExpired : 1;                            // 0x04B1:3 (0x0001)  
	bool                                               bPawnMovingIdleBreakTimeIsExpired : 1;                      // 0x04B1:4 (0x0001)  
	unsigned char                                      UnknownData02_4[0x6];                                       // 0x04B2   (0x0006)  MISSED
	FVector                                            PawnAcceleration;                                           // 0x04B8   (0x0018)  
	float                                              PawnAccelerationDirection;                                  // 0x04D0   (0x0004)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x04D4   (0x0004)  MISSED
	FRotator                                           PawnRotation;                                               // 0x04D8   (0x0018)  
	FRotator                                           PawnRotationDelta;                                          // 0x04F0   (0x0018)  
	FRotator                                           PawnRotationRateNormalized;                                 // 0x0508   (0x0018)  
	FRotator                                           PawnRootRotation;                                           // 0x0520   (0x0018)  
	float                                              PawnVelocityDirection;                                      // 0x0538   (0x0004)  
	unsigned char                                      UnknownData04_5[0x4];                                       // 0x053C   (0x0004)  MISSED
	FVector                                            PawnPreviousVelocity;                                       // 0x0540   (0x0018)  
	float                                              PawnIdleBreakTime;                                          // 0x0558   (0x0004)  
	float                                              PawnMovingIdleBreakTime;                                    // 0x055C   (0x0004)  
