
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: AI
/// dependency: AIModule
/// dependency: AmbientAudio
/// dependency: AnimationLayeringRuntime
/// dependency: AnimationWarpingRuntime
/// dependency: AnimGraphRuntime
/// dependency: AudioExtensions
/// dependency: AudioGameplay
/// dependency: AudioModulation
/// dependency: Balance
/// dependency: BlendStack
/// dependency: Blueprints
/// dependency: BP_ProjectileTrajectory
/// dependency: Building
/// dependency: CommonInput
/// dependency: CommonUI
/// dependency: CommonUILegacy
/// dependency: ContextualAnimation
/// dependency: CoreUObject
/// dependency: Effects
/// dependency: Engine
/// dependency: Environments
/// dependency: FluidSimulation
/// dependency: FortniteAI
/// dependency: FortniteGame
/// dependency: FortniteGameFramework
/// dependency: FortniteUI
/// dependency: GameplayAbilities
/// dependency: GameplayCameras
/// dependency: GameplayEffectTemplates
/// dependency: GameplayEventRouter
/// dependency: GameplayTags
/// dependency: InputCore
/// dependency: MetasoundEngine
/// dependency: ModularGameplay
/// dependency: MotionWarping
/// dependency: NavigationSystem
/// dependency: Niagara
/// dependency: PlayerAugmentsUI
/// dependency: PoseSearch
/// dependency: RidingCodeRuntime
/// dependency: SlateCore
/// dependency: SocialUMG
/// dependency: SoundLibrary
/// dependency: SubtitlesWidgets
/// dependency: UMG
/// dependency: Valkyrie
/// dependency: Water

/// Enum /Game/Athena/AI/Pawns/NPC/Parents/Enum_NPC_ModifyAlertLevelReason.Enum_NPC_ModifyAlertLevelReason
/// Size: 0x04
enum class Enum_NPC_ModifyAlertLevelReason : uint8_t
{
	Enum_NPC_ModifyAlertLevelReason__NewEnumerator4                                  = 0,
	Enum_NPC_ModifyAlertLevelReason__NewEnumerator0                                  = 1,
	Enum_NPC_ModifyAlertLevelReason__NewEnumerator5                                  = 2,
	Enum_NPC_ModifyAlertLevelReason__Enum_NPC_MAX                                    = 3
};

/// Enum /Game/Athena/AI/Pawns/NPC/Parents/Enum_NPC_AlertLevel.Enum_NPC_AlertLevel
/// Size: 0x06
enum class Enum_NPC_AlertLevel : uint8_t
{
	Enum_NPC_AlertLevel__NewEnumerator4                                              = 0,
	Enum_NPC_AlertLevel__NewEnumerator0                                              = 1,
	Enum_NPC_AlertLevel__NewEnumerator1                                              = 2,
	Enum_NPC_AlertLevel__NewEnumerator2                                              = 3,
	Enum_NPC_AlertLevel__NewEnumerator3                                              = 4,
	Enum_NPC_AlertLevel__Enum_NPC_MAX                                                = 5
};

/// Enum /Game/Athena/AI/Pawns/NPC/Parents/Enum_NPC_TargetSlots.Enum_NPC_TargetSlots
/// Size: 0x03
enum class Enum_NPC_TargetSlots : uint8_t
{
	Enum_NPC_TargetSlots__NewEnumerator0                                             = 0,
	Enum_NPC_TargetSlots__NewEnumerator1                                             = 1,
	Enum_NPC_TargetSlots__Enum_NPC_MAX                                               = 2
};

/// Enum /Game/Athena/Items/Gameplay/BackPacks/BoostJumpPack/Enum_BoostJumpStates.Enum_BoostJumpStates
/// Size: 0x06
enum class Enum_BoostJumpStates : uint8_t
{
	Enum_BoostJumpStates__NewEnumerator3                                             = 0,
	Enum_BoostJumpStates__NewEnumerator0                                             = 1,
	Enum_BoostJumpStates__NewEnumerator1                                             = 2,
	Enum_BoostJumpStates__NewEnumerator2                                             = 3,
	Enum_BoostJumpStates__NewEnumerator4                                             = 4,
	Enum_BoostJumpStates__Enum_MAX                                                   = 5
};

/// Enum /Game/Athena/Items/PhysicsActors/PhysicsTreeLog/PhysicsLogAnalytics_DamageCategory.PhysicsLogAnalytics_DamageCategory
/// Size: 0x05
enum class PhysicsLogAnalytics_DamageCategory : uint8_t
{
	PhysicsLogAnalytics_DamageCategory__NewEnumerator0                               = 0,
	PhysicsLogAnalytics_DamageCategory__NewEnumerator1                               = 1,
	PhysicsLogAnalytics_DamageCategory__NewEnumerator2                               = 2,
	PhysicsLogAnalytics_DamageCategory__NewEnumerator3                               = 3,
	PhysicsLogAnalytics_DamageCategory__PhysicsLogAnalytics_MAX                      = 4
};

/// Enum /Game/Characters/Player/Male/Male_Avg_Base/ECardinalDirection.ECardinalDirection
/// Size: 0x05
enum class ECardinalDirection : uint8_t
{
	ECardinalDirection__NewEnumerator0                                               = 0,
	ECardinalDirection__NewEnumerator2                                               = 1,
	ECardinalDirection__NewEnumerator1                                               = 2,
	ECardinalDirection__NewEnumerator3                                               = 3,
	ECardinalDirection__ECardinalDirection_MAX                                       = 4
};

/// Enum /Game/Creative/Devices/Common/Enums/EAwardScoreType.EAwardScoreType
/// Size: 0x05
enum class EAwardScoreType : uint8_t
{
	EAwardScoreType__NewEnumerator0                                                  = 0,
	EAwardScoreType__NewEnumerator1                                                  = 1,
	EAwardScoreType__NewEnumerator2                                                  = 2,
	EAwardScoreType__NewEnumerator3                                                  = 3,
	EAwardScoreType__EAwardScoreType_MAX                                             = 4
};

/// Enum /Game/Creative/Devices/Common/EBoolWithUnset.EBoolWithUnset
/// Size: 0x04
enum class EBoolWithUnset : uint8_t
{
	EBoolWithUnset__NewEnumerator0                                                   = 0,
	EBoolWithUnset__NewEnumerator1                                                   = 1,
	EBoolWithUnset__NewEnumerator2                                                   = 2,
	EBoolWithUnset__EBoolWithUnset_MAX                                               = 3
};

/// Enum /Game/Creative/Devices/Common/Enums/ECreativeColorSetType.ECreativeColorSetType
/// Size: 0x05
enum class ECreativeColorSetType : uint8_t
{
	ECreativeColorSetType__NewEnumerator0                                            = 0,
	ECreativeColorSetType__NewEnumerator1                                            = 1,
	ECreativeColorSetType__NewEnumerator2                                            = 2,
	ECreativeColorSetType__NewEnumerator3                                            = 3,
	ECreativeColorSetType__ECreativeColorSetType_MAX                                 = 4
};

/// Enum /Game/Creative/Devices/Common/Enums/ECreativeTeamColor.ECreativeTeamColor
/// Size: 0x19
enum class ECreativeTeamColor : uint8_t
{
	ECreativeTeamColor__NewEnumerator0                                               = 0,
	ECreativeTeamColor__NewEnumerator1                                               = 1,
	ECreativeTeamColor__NewEnumerator2                                               = 2,
	ECreativeTeamColor__NewEnumerator3                                               = 3,
	ECreativeTeamColor__NewEnumerator4                                               = 4,
	ECreativeTeamColor__NewEnumerator5                                               = 5,
	ECreativeTeamColor__NewEnumerator6                                               = 6,
	ECreativeTeamColor__NewEnumerator7                                               = 7,
	ECreativeTeamColor__NewEnumerator8                                               = 8,
	ECreativeTeamColor__NewEnumerator9                                               = 9,
	ECreativeTeamColor__NewEnumerator10                                              = 10,
	ECreativeTeamColor__NewEnumerator11                                              = 11,
	ECreativeTeamColor__NewEnumerator12                                              = 12,
	ECreativeTeamColor__NewEnumerator13                                              = 13,
	ECreativeTeamColor__NewEnumerator14                                              = 14,
	ECreativeTeamColor__NewEnumerator15                                              = 15,
	ECreativeTeamColor__NewEnumerator17                                              = 16,
	ECreativeTeamColor__NewEnumerator18                                              = 17,
	ECreativeTeamColor__ECreativeTeamColor_MAX                                       = 18
};

/// Enum /Game/Sounds/Fort_Audio_Blueprints/AudioParameterComponent/PlayerWaterDepthEnum.PlayerWaterDepthEnum
/// Size: 0x06
enum class PlayerWaterDepthEnum : uint8_t
{
	PlayerWaterDepthEnum__NewEnumerator5                                             = 0,
	PlayerWaterDepthEnum__NewEnumerator4                                             = 1,
	PlayerWaterDepthEnum__NewEnumerator3                                             = 2,
	PlayerWaterDepthEnum__NewEnumerator2                                             = 3,
	PlayerWaterDepthEnum__NewEnumerator1                                             = 4,
	PlayerWaterDepthEnum__PlayerWaterDepthEnum_MAX                                   = 5
};

/// Enum /Game/UI/ContentControls/E_UI_InputField_ContentSize.E_UI_InputField_ContentSize
/// Size: 0x04
enum class E_UI_InputField_ContentSize : uint8_t
{
	E_UI_InputField_ContentSize__NewEnumerator0                                      = 0,
	E_UI_InputField_ContentSize__NewEnumerator1                                      = 1,
	E_UI_InputField_ContentSize__NewEnumerator2                                      = 2,
	E_UI_InputField_ContentSize__E_UI_InputField_MAX                                 = 3
};

/// Enum /Game/UI/ContentControls/E_UI_InputField_State.E_UI_InputField_State
/// Size: 0x04
enum class E_UI_InputField_State : uint8_t
{
	E_UI_InputField_State__NewEnumerator0                                            = 0,
	E_UI_InputField_State__NewEnumerator1                                            = 1,
	E_UI_InputField_State__NewEnumerator2                                            = 2,
	E_UI_InputField_State__E_UI_InputField_MAX                                       = 3
};

/// Enum /Game/UI/Foundation/Toasts/Data/E_PositiveNegativeNeutral.E_PositiveNegativeNeutral
/// Size: 0x04
enum class E_PositiveNegativeNeutral : uint8_t
{
	E_PositiveNegativeNeutral__NewEnumerator0                                        = 0,
	E_PositiveNegativeNeutral__NewEnumerator1                                        = 1,
	E_PositiveNegativeNeutral__NewEnumerator2                                        = 2,
	E_PositiveNegativeNeutral__E_MAX                                                 = 3
};

/// Enum /FortUILibrary/Systems/ModularButton/Data/E_UI_ButtonSize.E_UI_ButtonSize
/// Size: 0x04
enum class E_UI_ButtonSize : uint8_t
{
	E_UI_ButtonSize__NewEnumerator0                                                  = 0,
	E_UI_ButtonSize__NewEnumerator1                                                  = 1,
	E_UI_ButtonSize__NewEnumerator2                                                  = 2,
	E_UI_ButtonSize__E_UI_MAX                                                        = 3
};

/// Enum /FortUILibrary/Systems/ModularButton/Data/E_UI_CTAButtonType.E_UI_CTAButtonType
/// Size: 0x03
enum class E_UI_CTAButtonType : uint8_t
{
	E_UI_CTAButtonType__NewEnumerator0                                               = 0,
	E_UI_CTAButtonType__NewEnumerator1                                               = 1,
	E_UI_CTAButtonType__E_UI_MAX                                                     = 2
};

/// Enum /FortUILibrary/Systems/StatusIndicator/Data/E_UI_StatusIndicator_Size.E_UI_StatusIndicator_Size
/// Size: 0x03
enum class E_UI_StatusIndicator_Size : uint8_t
{
	E_UI_StatusIndicator_Size__NewEnumerator2                                        = 0,
	E_UI_StatusIndicator_Size__NewEnumerator3                                        = 1,
	E_UI_StatusIndicator_Size__E_UI_StatusIndicator_MAX                              = 2
};

/// Enum /FortUILibrary/Systems/Backplate/Data/E_UI_BackplateCornerRadius.E_UI_BackplateCornerRadius
/// Size: 0x06
enum class E_UI_BackplateCornerRadius : uint8_t
{
	E_UI_BackplateCornerRadius__NewEnumerator0                                       = 0,
	E_UI_BackplateCornerRadius__NewEnumerator1                                       = 1,
	E_UI_BackplateCornerRadius__NewEnumerator3                                       = 2,
	E_UI_BackplateCornerRadius__NewEnumerator6                                       = 3,
	E_UI_BackplateCornerRadius__NewEnumerator4                                       = 4,
	E_UI_BackplateCornerRadius__E_UI_MAX                                             = 5
};

/// Enum /FortUILibrary/Systems/StatusIndicator/Data/E_UI_StatusIndicator_Type.E_UI_StatusIndicator_Type
/// Size: 0x04
enum class E_UI_StatusIndicator_Type : uint8_t
{
	E_UI_StatusIndicator_Type__NewEnumerator0                                        = 0,
	E_UI_StatusIndicator_Type__NewEnumerator2                                        = 1,
	E_UI_StatusIndicator_Type__NewEnumerator3                                        = 2,
	E_UI_StatusIndicator_Type__E_UI_StatusIndicator_MAX                              = 3
};

/// Enum /FortUILibrary/Systems/Tabs/Data/E_UI_Alignment.E_UI_Alignment
/// Size: 0x05
enum class E_UI_Alignment : uint8_t
{
	E_UI_Alignment__NewEnumerator0                                                   = 0,
	E_UI_Alignment__NewEnumerator1                                                   = 1,
	E_UI_Alignment__NewEnumerator2                                                   = 2,
	E_UI_Alignment__NewEnumerator3                                                   = 3,
	E_UI_Alignment__E_UI_MAX                                                         = 4
};

/// Enum /FortUILibrary/Systems/StatusIndicator/Data/E_UI_StatusIndicator_Configuration.E_UI_StatusIndicator_Configuration
/// Size: 0x04
enum class E_UI_StatusIndicator_Configuration : uint8_t
{
	E_UI_StatusIndicator_Configuration__NewEnumerator0                               = 0,
	E_UI_StatusIndicator_Configuration__NewEnumerator2                               = 1,
	E_UI_StatusIndicator_Configuration__NewEnumerator3                               = 2,
	E_UI_StatusIndicator_Configuration__E_UI_StatusIndicator_MAX                     = 3
};

/// Enum /FortUILibrary/Systems/Backplate/Data/E_UI_BackplateBrightness.E_UI_BackplateBrightness
/// Size: 0x05
enum class E_UI_BackplateBrightness : uint8_t
{
	E_UI_BackplateBrightness__NewEnumerator0                                         = 0,
	E_UI_BackplateBrightness__NewEnumerator1                                         = 1,
	E_UI_BackplateBrightness__NewEnumerator2                                         = 2,
	E_UI_BackplateBrightness__NewEnumerator3                                         = 3,
	E_UI_BackplateBrightness__E_UI_MAX                                               = 4
};

/// Enum /FortUILibrary/Systems/Tabs/Data/E_UI_TabsInputActionType.E_UI_TabsInputActionType
/// Size: 0x05
enum class E_UI_TabsInputActionType : uint8_t
{
	E_UI_TabsInputActionType__NewEnumerator2                                         = 0,
	E_UI_TabsInputActionType__NewEnumerator0                                         = 1,
	E_UI_TabsInputActionType__NewEnumerator1                                         = 2,
	E_UI_TabsInputActionType__NewEnumerator3                                         = 3,
	E_UI_TabsInputActionType__E_UI_MAX                                               = 4
};

/// Enum /FortUILibrary/Systems/Dialog/Data/E_UI_DialogTextType.E_UI_DialogTextType
/// Size: 0x04
enum class E_UI_DialogTextType : uint8_t
{
	E_UI_DialogTextType__NewEnumerator0                                              = 0,
	E_UI_DialogTextType__NewEnumerator1                                              = 1,
	E_UI_DialogTextType__NewEnumerator2                                              = 2,
	E_UI_DialogTextType__E_UI_MAX                                                    = 3
};

/// Enum /FortUILibrary/Systems/Dialog/Data/E_UI_ButtonVisualType.E_UI_ButtonVisualType
/// Size: 0x04
enum class E_UI_ButtonVisualType : uint8_t
{
	E_UI_ButtonVisualType__NewEnumerator0                                            = 0,
	E_UI_ButtonVisualType__NewEnumerator1                                            = 1,
	E_UI_ButtonVisualType__NewEnumerator2                                            = 2,
	E_UI_ButtonVisualType__E_UI_MAX                                                  = 3
};

/// Enum /FortUILibrary/Systems/Throbber/Data/E_UI_ThrobberSize.E_UI_ThrobberSize
/// Size: 0x04
enum class E_UI_ThrobberSize : uint8_t
{
	E_UI_ThrobberSize__NewEnumerator0                                                = 0,
	E_UI_ThrobberSize__NewEnumerator1                                                = 1,
	E_UI_ThrobberSize__NewEnumerator2                                                = 2,
	E_UI_ThrobberSize__E_UI_MAX                                                      = 3
};

/// Enum /FortUILibrary/Systems/Throbber/Data/E_UI_ThrobberType.E_UI_ThrobberType
/// Size: 0x02
enum class E_UI_ThrobberType : uint8_t
{
	E_UI_ThrobberType__NewEnumerator0                                                = 0,
	E_UI_ThrobberType__E_UI_MAX                                                      = 1
};

/// Class /Game/Abilities/Player/Generic/GameplayEffects/GE_HealthRegen_Delay_Damaged.GE_HealthRegen_Delay_Damaged_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_HealthRegen_Delay_Damaged_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Abilities/Player/Generic/GameplayEffects/GE_Generic_HealthRegen.GE_Generic_HealthRegen_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_Generic_HealthRegen_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Abilities/Player/Generic/GameplayEffects/GE_Generic_Revive.GE_Generic_Revive_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_Generic_Revive_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Abilities/Player/Generic/GameplayEffects/GE_ExtraLifeRevive.GE_ExtraLifeRevive_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_ExtraLifeRevive_C : public UGE_Generic_Revive_C
{ 
public:
};

/// Class /Game/Abilities/NPC/Generic/GE_TransferFullBodyHit.GE_TransferFullBodyHit_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_TransferFullBodyHit_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Abilities/Player/Generic/GameplayEffects/GE_Generic_ShieldRegen.GE_Generic_ShieldRegen_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_Generic_ShieldRegen_C : public UGameplayEffect
{ 
public:
};

/// Struct /Game/Abilities/Player/Pawns/CharacterPartMidArrayStruct.CharacterPartMidArrayStruct
/// Size: 0x0018 (0x000000 - 0x000018)
struct FCharacterPartMidArrayStruct
{ 
	SDK_UNDEFINED(1,11232) /* TEnumAsByte<EFortCustomPartType> */ __um(PartType_5_EBDFFF5740627902CC51DD966B8EE419); // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0001   (0x0007)  MISSED
	TArray<class UMaterialInstanceDynamic*>            MID_7_A0D19AC74319389A5DF2019166F976F0;                     // 0x0008   (0x0010)  
};

/// Class /Game/Abilities/Player/Pawns/PlayerPawn_Generic_Parent.PlayerPawn_Generic_Parent_C
/// Size: 0x00E0 (0x004AA0 - 0x004B80)
class APlayerPawn_Generic_Parent_C : public AFortPlayerPawn
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x4AA0   (0x0008)  
	TArray<class UMaterialInterface*>                  Default_Weapon_Materials;                                   // 0x4AA8   (0x0010)  
	TArray<class UMaterialInstanceDynamic*>            PawnBackpackMaterials;                                      // 0x4AB8   (0x0010)  
	TArray<class UMaterialInstanceDynamic*>            PawnHatMaterials;                                           // 0x4AC8   (0x0010)  
	TArray<class UMaterialInstanceDynamic*>            PawnHeadMaterials;                                          // 0x4AD8   (0x0010)  
	TArray<class UMaterialInstanceDynamic*>            PawnBodyMaterials;                                          // 0x4AE8   (0x0010)  
	TArray<class UMaterialInstanceDynamic*>            PawnCharmMaterials;                                         // 0x4AF8   (0x0010)  
	TArray<class UMaterialInstanceDynamic*>            PawnFaceMaterials;                                          // 0x4B08   (0x0010)  
	class UPostProcessComponent*                       PlayerPostProcessFX;                                        // 0x4B18   (0x0008)  
	TArray<class USkeletalMeshComponent*>              SkeletalMeshes;                                             // 0x4B20   (0x0010)  
	TArray<class UMaterialInstanceDynamic*>            PawnMaterials_ALL;                                          // 0x4B30   (0x0010)  
	int32_t                                            WaterCounter;                                               // 0x4B40   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x4B44   (0x0004)  MISSED
	class AActor*                                      CurrentWaterMeshActor;                                      // 0x4B48   (0x0008)  
	bool                                               IsInWater;                                                  // 0x4B50   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x4B51   (0x0007)  MISSED
	double                                             Time_when_you_ll_be_able_to_splash_again;                   // 0x4B58   (0x0008)  
	SDK_UNDEFINED(16,11233) /* FMulticastInlineDelegate */ __um(OnOverlapWaterVolume);                             // 0x4B60   (0x0010)  
	TArray<FCharacterPartMidArrayStruct>               PawnPartMaterials;                                          // 0x4B70   (0x0010)  


	/// Functions
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic_Parent.PlayerPawn_Generic_Parent_C.Find Stored Char Part Materials
	// void Find Stored Char Part Materials(TEnumAsByte<EFortCustomPartType> PartType, bool& Found, int32_t& Index, TArray<UMaterialInstanceDynamic*>& MIDs); // [0x130d900] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic_Parent.PlayerPawn_Generic_Parent_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic_Parent.PlayerPawn_Generic_Parent_C.Exited/Entered Water Volume
	// void Exited/Entered Water Volume();                                                                                   // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic_Parent.PlayerPawn_Generic_Parent_C.Player Creates a Splash
	// void Player Creates a Splash(FTransform& NewTransform);                                                               // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic_Parent.PlayerPawn_Generic_Parent_C.ReinitializeWeaponMaterials
	// void ReinitializeWeaponMaterials();                                                                                   // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic_Parent.PlayerPawn_Generic_Parent_C.ExecuteUbergraph_PlayerPawn_Generic_Parent
	// void ExecuteUbergraph_PlayerPawn_Generic_Parent(int32_t EntryPoint);                                                  // [0x130d900] Final|HasDefaults    
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic_Parent.PlayerPawn_Generic_Parent_C.OnOverlapWaterVolume__DelegateSignature
	// void OnOverlapWaterVolume__DelegateSignature(bool bIsInWater, class AFortPlayerPawn* Pawn, class AActor* Water);      // [0x130d900] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Abilities/NPC/Generic/GE_ImpactImmunity.GE_ImpactImmunity_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_ImpactImmunity_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Abilities/NPC/Generic/GE_RestoreControlResistance.GE_RestoreControlResistance_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_RestoreControlResistance_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Abilities/NPC/Generic/GAB_GenericApplyFullBodyHit.GAB_GenericApplyFullBodyHit_C
/// Size: 0x0071 (0x000B60 - 0x000BD1)
class UGAB_GenericApplyFullBodyHit_C : public UFortGameplayAbility
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0B60   (0x0008)  
	class UClass*                                      GE_FullBodyHitActiveEffect;                                 // 0x0B68   (0x0008)  
	FVector                                            HitImpulse;                                                 // 0x0B70   (0x0018)  
	class UClass*                                      GE_RestoreControlResistance;                                // 0x0B88   (0x0008)  
	FActiveGameplayEffectHandle                        ActiveImpactImmunity;                                       // 0x0B90   (0x0008)  
	class UClass*                                      GE_ImpactImmunity;                                          // 0x0B98   (0x0008)  
	FActiveGameplayEffectHandle                        ActiveFullBodyHit;                                          // 0x0BA0   (0x0008)  
	FGameplayTag                                       Event_Triggered_FullBodyHit;                                // 0x0BA8   (0x0004)  
	FGameplayTag                                       Event_Control_Ended;                                        // 0x0BAC   (0x0004)  
	class UClass*                                      GE_TransferFullBodyHit;                                     // 0x0BB0   (0x0008)  
	class UAnimMontage*                                FullBodyHitMontage;                                         // 0x0BB8   (0x0008)  
	FName                                              FullBodyHitMontageSection;                                  // 0x0BC0   (0x0004)  
	bool                                               EndAbilityOnBlendOut;                                       // 0x0BC4   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0BC5   (0x0003)  MISSED
	double                                             Duration_NoAnim;                                            // 0x0BC8   (0x0008)  
	bool                                               DebugFullBodyHitReact;                                      // 0x0BD0   (0x0001)  


	/// Functions
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyFullBodyHit.GAB_GenericApplyFullBodyHit_C.K2_CanActivateAbility
	// bool K2_CanActivateAbility(FGameplayAbilityActorInfo ActorInfo, FGameplayAbilitySpecHandle Handle, FGameplayTagContainer& RelevantTags); // [0x130d900] Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyFullBodyHit.GAB_GenericApplyFullBodyHit_C.OnCancelled_25E5E66442E815EB40A6DB8205FE0D98
	// void OnCancelled_25E5E66442E815EB40A6DB8205FE0D98();                                                                  // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyFullBodyHit.GAB_GenericApplyFullBodyHit_C.OnInterrupted_25E5E66442E815EB40A6DB8205FE0D98
	// void OnInterrupted_25E5E66442E815EB40A6DB8205FE0D98();                                                                // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyFullBodyHit.GAB_GenericApplyFullBodyHit_C.OnBlendOut_25E5E66442E815EB40A6DB8205FE0D98
	// void OnBlendOut_25E5E66442E815EB40A6DB8205FE0D98();                                                                   // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyFullBodyHit.GAB_GenericApplyFullBodyHit_C.OnCompleted_25E5E66442E815EB40A6DB8205FE0D98
	// void OnCompleted_25E5E66442E815EB40A6DB8205FE0D98();                                                                  // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyFullBodyHit.GAB_GenericApplyFullBodyHit_C.OnHitPawn
	// void OnHitPawn(class AActor* SelfActor, class AActor* OtherActor, FVector NormalImpulse, FHitResult& Hit);            // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyFullBodyHit.GAB_GenericApplyFullBodyHit_C.K2_ActivateAbilityFromEvent
	// void K2_ActivateAbilityFromEvent(FGameplayEventData& EventData);                                                      // [0x130d900] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyFullBodyHit.GAB_GenericApplyFullBodyHit_C.K2_OnEndAbility
	// void K2_OnEndAbility(bool bWasCancelled);                                                                             // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyFullBodyHit.GAB_GenericApplyFullBodyHit_C.PickFullBodyHitMontageSection
	// void PickFullBodyHitMontageSection();                                                                                 // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyFullBodyHit.GAB_GenericApplyFullBodyHit_C.ExecuteUbergraph_GAB_GenericApplyFullBodyHit
	// void ExecuteUbergraph_GAB_GenericApplyFullBodyHit(int32_t EntryPoint);                                                // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/B_FortGlobalAbilityTargetingActor.B_FortGlobalAbilityTargetingActor_C
/// Size: 0x0000 (0x000290 - 0x000290)
class AB_FortGlobalAbilityTargetingActor_C : public AFortGlobalAbilityTargetingActor
{ 
public:
};

/// Class /Game/Abilities/Traps/Generic/GE_TrapArmGeneric.GE_TrapArmGeneric_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_TrapArmGeneric_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Abilities/Player/Generic/GE_HealthRegen.GE_HealthRegen_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_HealthRegen_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Abilities/Traps/Generic/GA_TrapBuildGeneric.GA_TrapBuildGeneric_C
/// Size: 0x000C (0x000B60 - 0x000B6C)
class UGA_TrapBuildGeneric_C : public UFortGameplayAbility
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0B60   (0x0008)  
	FGameplayTag                                       PlacedCue;                                                  // 0x0B68   (0x0004)  


	/// Functions
	// Function /Game/Abilities/Traps/Generic/GA_TrapBuildGeneric.GA_TrapBuildGeneric_C.K2_ActivateAbility
	// void K2_ActivateAbility();                                                                                            // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Traps/Generic/GA_TrapBuildGeneric.GA_TrapBuildGeneric_C.ExecuteUbergraph_GA_TrapBuildGeneric
	// void ExecuteUbergraph_GA_TrapBuildGeneric(int32_t EntryPoint);                                                        // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/Player/Generic/GameplayEffects/GE_ShieldRegen_Delay_Damaged.GE_ShieldRegen_Delay_Damaged_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_ShieldRegen_Delay_Damaged_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Abilities/Player/Sliding/GE_AthenaPlayer_DisableSliding.GE_AthenaPlayer_DisableSliding_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_AthenaPlayer_DisableSliding_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C
/// Size: 0x0611 (0x004B80 - 0x005191)
class APlayerPawn_Generic_C : public APlayerPawn_Generic_Parent_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x4B80   (0x0008)  
	class UMotionWarpingComponent*                     MotionWarping;                                              // 0x4B88   (0x0008)  
	class UParticleSystemComponent*                    SplashEffectsForEnteringOrExitingWater;                     // 0x4B90   (0x0008)  
	class UParticleSystemComponent*                    GamplayWindInteractionEffects;                              // 0x4B98   (0x0008)  
	class UParticleSystemComponent*                    Effect_Player_Run_Land;                                     // 0x4BA0   (0x0008)  
	class UParticleSystemComponent*                    Effect_Player_Walk_Land;                                    // 0x4BA8   (0x0008)  
	class UParticleSystemComponent*                    Effect_Player_Walk_Water;                                   // 0x4BB0   (0x0008)  
	class UParticleSystemComponent*                    Effect_Player_Run_Water;                                    // 0x4BB8   (0x0008)  
	class UParticleSystemComponent*                    Effect_WaterInteraction_FX;                                 // 0x4BC0   (0x0008)  
	class UParticleSystemComponent*                    HitDamageParticles;                                         // 0x4BC8   (0x0008)  
	class UWidgetComponent*                            SpeechBubbleComponent;                                      // 0x4BD0   (0x0008)  
	class USpotLightComponent*                         PlayerLight;                                                // 0x4BD8   (0x0008)  
	float                                              ShatterShield_Push_3B96BD02488A8F69F3D086A2B7978EC8;        // 0x4BE0   (0x0004)  
	float                                              ShatterShield_Opacity_3B96BD02488A8F69F3D086A2B7978EC8;     // 0x4BE4   (0x0004)  
	float                                              ShatterShield_Highlight_Cracks_3B96BD02488A8F69F3D086A2B7978EC8; // 0x4BE8   (0x0004)  
	SDK_UNDEFINED(1,11234) /* TEnumAsByte<ETimelineDirection> */ __um(ShatterShield__Direction_3B96BD02488A8F69F3D086A2B7978EC8); // 0x4BEC   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x4BED   (0x0003)  MISSED
	class UTimelineComponent*                          ShatterShield;                                              // 0x4BF0   (0x0008)  
	class USoundBase*                                  HitByHuskRangedSound;                                       // 0x4BF8   (0x0008)  
	class USoundBase*                                  HitByHuskMeleeSound;                                        // 0x4C00   (0x0008)  
	class UAnimMontage*                                SoulSuckVictimMontage;                                      // 0x4C08   (0x0008)  
	double                                             PlayerSpeed;                                                // 0x4C10   (0x0008)  
	double                                             Run_Particle_Activate_Speed;                                // 0x4C18   (0x0008)  
	double                                             Walk_Dust_Activate_Speed;                                   // 0x4C20   (0x0008)  
	double                                             Walk_Particle_Reset_Speed;                                  // 0x4C28   (0x0008)  
	FVector                                            PreviousVelocityVector;                                     // 0x4C30   (0x0018)  
	bool                                               CanSpawnRunKickupFX_;                                       // 0x4C48   (0x0001)  
	bool                                               CanSpawnWalkKickupFX_;                                      // 0x4C49   (0x0001)  
	bool                                               CanSpawnDustLandFX_;                                        // 0x4C4A   (0x0001)  
	unsigned char                                      UnknownData01_5[0x5];                                       // 0x4C4B   (0x0005)  MISSED
	FRotator                                           RunWalkParticleRotation;                                    // 0x4C50   (0x0018)  
	bool                                               IsNinjaInShadowStance_;                                     // 0x4C68   (0x0001)  
	unsigned char                                      UnknownData02_5[0x7];                                       // 0x4C69   (0x0007)  MISSED
	FGameplayTagContainer                              GameplayTagsForHitByHuskMeleeSound;                         // 0x4C70   (0x0020)  
	class UMaterialInterface*                          Shield_Material;                                            // 0x4C90   (0x0008)  
	TArray<class UMaterialInstanceDynamic*>            BodyShieldMIDArray;                                         // 0x4C98   (0x0010)  
	TArray<class UMaterialInstanceDynamic*>            HeadShieldMIDArray;                                         // 0x4CA8   (0x0010)  
	bool                                               Shield_Active;                                              // 0x4CB8   (0x0001)  
	unsigned char                                      UnknownData03_5[0x7];                                       // 0x4CB9   (0x0007)  MISSED
	class USoundBase*                                  Sound_Shield_Impact;                                        // 0x4CC0   (0x0008)  
	class USoundBase*                                  Sound_Shield_Destroyed;                                     // 0x4CC8   (0x0008)  
	class USoundBase*                                  Sound_Shield_FullyCharged;                                  // 0x4CD0   (0x0008)  
	double                                             Shield_Shatter_Opacity;                                     // 0x4CD8   (0x0008)  
	double                                             Regen_Opacity;                                              // 0x4CE0   (0x0008)  
	double                                             Damage_Opacity;                                             // 0x4CE8   (0x0008)  
	double                                             Default_Shield_opacity;                                     // 0x4CF0   (0x0008)  
	double                                             Shield_PushMinValue;                                        // 0x4CF8   (0x0008)  
	bool                                               ShieldVisible_Hit;                                          // 0x4D00   (0x0001)  
	bool                                               ShieldVisible_Recover;                                      // 0x4D01   (0x0001)  
	bool                                               ShieldVisible_Shatter;                                      // 0x4D02   (0x0001)  
	bool                                               ShieldVisible_FullHealth;                                   // 0x4D03   (0x0001)  
	unsigned char                                      UnknownData04_5[0x4];                                       // 0x4D04   (0x0004)  MISSED
	double                                             Fully_Regened_Shield_health_Opacity;                        // 0x4D08   (0x0008)  
	FGameplayTagContainer                              TC_GameplayCueDamageShielded;                               // 0x4D10   (0x0020)  
	bool                                               LatestDamageIsShieldDamage;                                 // 0x4D30   (0x0001)  
	unsigned char                                      UnknownData05_5[0x7];                                       // 0x4D31   (0x0007)  MISSED
	double                                             Damage_Taken;                                               // 0x4D38   (0x0008)  
	double                                             Last_Shield_Damage_Time;                                    // 0x4D40   (0x0008)  
	TArray<class UMaterialInstanceDynamic*>            CharmShieldMIDArray;                                        // 0x4D48   (0x0010)  
	bool                                               BodyValid;                                                  // 0x4D58   (0x0001)  
	bool                                               BackpackValid;                                              // 0x4D59   (0x0001)  
	bool                                               HatValid;                                                   // 0x4D5A   (0x0001)  
	bool                                               FaceValid;                                                  // 0x4D5B   (0x0001)  
	bool                                               CharmValid;                                                 // 0x4D5C   (0x0001)  
	bool                                               HeadValid;                                                  // 0x4D5D   (0x0001)  
	bool                                               On_Player_Built_Floor;                                      // 0x4D5E   (0x0001)  
	unsigned char                                      UnknownData06_5[0x1];                                       // 0x4D5F   (0x0001)  MISSED
	FGameplayTag                                       Event_NeedRoadsActive;                                      // 0x4D60   (0x0004)  
	FGameplayTag                                       Event_NeedRoadsDeactive;                                    // 0x4D64   (0x0004)  
	FGameplayTagContainer                              TC_WhereWereGoingWeNeedRoads;                               // 0x4D68   (0x0020)  
	class UParticleSystem*                             Effect_Player_LandedDust;                                   // 0x4D88   (0x0008)  
	class USkeletalMeshComponent*                      Shield_BodySkeletalMesh;                                    // 0x4D90   (0x0008)  
	class USkeletalMeshComponent*                      Shield_HeadSkeletalMesh;                                    // 0x4D98   (0x0008)  
	class USkeletalMeshComponent*                      Shield_CharmSkeletalMesh;                                   // 0x4DA0   (0x0008)  
	class USceneComponent*                             Sound_Player_Hit;                                           // 0x4DA8   (0x0008)  
	class UForceFeedbackEffect*                        DamageForceFeedback;                                        // 0x4DB0   (0x0008)  
	class UParticleSystem*                             Effect_Player_Landed_WindVector_P;                          // 0x4DB8   (0x0008)  
	class UClass*                                      SpeechBubbleWidgetClass;                                    // 0x4DC0   (0x0008)  
	SDK_UNDEFINED(24,11235) /* FText */                __um(LastSpeechText);                                       // 0x4DC8   (0x0018)  
	class UClass*                                      DamageCameraShake;                                          // 0x4DE0   (0x0008)  
	bool                                               UseAnimTrailsNotifies;                                      // 0x4DE8   (0x0001)  
	unsigned char                                      UnknownData07_5[0x7];                                       // 0x4DE9   (0x0007)  MISSED
	FVector                                            StableVelocityVector;                                       // 0x4DF0   (0x0018)  
	bool                                               TickWaterLevel;                                             // 0x4E08   (0x0001)  
	unsigned char                                      UnknownData08_5[0x7];                                       // 0x4E09   (0x0007)  MISSED
	class UTextureRenderTarget2D*                      WetnessDepthTexture;                                        // 0x4E10   (0x0008)  
	class UMaterialInstanceDynamic*                    WaterLevelMID;                                              // 0x4E18   (0x0008)  
	class UMaterialInstanceDynamic*                    WaterDecayMID;                                              // 0x4E20   (0x0008)  
	bool                                               Was_RTT_Enabled_Var_Set;                                    // 0x4E28   (0x0001)  
	bool                                               Is_the_Wind_Water_Scene_Capture_Enabled;                    // 0x4E29   (0x0001)  
	unsigned char                                      UnknownData09_5[0x6];                                       // 0x4E2A   (0x0006)  MISSED
	class AActor*                                      CachedEffect;                                               // 0x4E30   (0x0008)  
	TArray<class UMaterialInstanceDynamic*>            WaterInteractionWakeMIDS;                                   // 0x4E38   (0x0010)  
	FLinearColor                                       WaterTraceImpactNormalAndZHeightLocation;                   // 0x4E48   (0x0010)  
	FVector                                            PlayerVelocity;                                             // 0x4E58   (0x0018)  
	bool                                               EnableRunWalkWaterGroundFX;                                 // 0x4E70   (0x0001)  
	unsigned char                                      UnknownData10_5[0x7];                                       // 0x4E71   (0x0007)  MISSED
	TArray<class UMaterialInstanceDynamic*>            Previous_MID;                                               // 0x4E78   (0x0010)  
	TArray<class UMaterialInstanceDynamic*>            Previous_Weapon_MID;                                        // 0x4E88   (0x0010)  
	class USkeletalMeshComponent*                      DuplicateCharacterMesh;                                     // 0x4E98   (0x0008)  
	TArray<class UMaterialInstanceDynamic*>            Previous_Head_MID;                                          // 0x4EA0   (0x0010)  
	TArray<class UMaterialInstanceDynamic*>            Previous_Body_MID;                                          // 0x4EB0   (0x0010)  
	TArray<class UMaterialInstanceDynamic*>            Previous_Hat_MID;                                           // 0x4EC0   (0x0010)  
	TArray<class UMaterialInstanceDynamic*>            Previous_Backpack_MID;                                      // 0x4ED0   (0x0010)  
	TArray<class UMaterialInstanceDynamic*>            Previous_Charm_MID;                                         // 0x4EE0   (0x0010)  
	TArray<class UMaterialInstanceDynamic*>            Previous_Face_MID;                                          // 0x4EF0   (0x0010)  
	SDK_UNDEFINED(16,11236) /* FMulticastInlineDelegate */ __um(SwingRight);                                       // 0x4F00   (0x0010)  
	SDK_UNDEFINED(16,11237) /* FMulticastInlineDelegate */ __um(SwingRightEnd);                                    // 0x4F10   (0x0010)  
	SDK_UNDEFINED(16,11238) /* FMulticastInlineDelegate */ __um(SwingLeft);                                        // 0x4F20   (0x0010)  
	SDK_UNDEFINED(16,11239) /* FMulticastInlineDelegate */ __um(SwingLeftEnd);                                     // 0x4F30   (0x0010)  
	SDK_UNDEFINED(16,11240) /* FMulticastInlineDelegate */ __um(AnimNotify_Begin);                                 // 0x4F40   (0x0010)  
	SDK_UNDEFINED(16,11241) /* FMulticastInlineDelegate */ __um(AnimNotify_End);                                   // 0x4F50   (0x0010)  
	class UFXSystemComponent*                          OverrideAnimTrail;                                          // 0x4F60   (0x0008)  
	SDK_UNDEFINED(16,11242) /* FMulticastInlineDelegate */ __um(SwingRight2);                                      // 0x4F68   (0x0010)  
	SDK_UNDEFINED(16,11243) /* FMulticastInlineDelegate */ __um(SwingLeft2);                                       // 0x4F78   (0x0010)  
	class UFXSystemComponent*                          AnimTrailFx;                                                // 0x4F88   (0x0008)  
	bool                                               BlockedByPawns;                                             // 0x4F90   (0x0001)  
	unsigned char                                      UnknownData11_5[0x7];                                       // 0x4F91   (0x0007)  MISSED
	FGameplayAttribute                                 Attribute_CurrentShield_Const;                              // 0x4F98   (0x0038)  
	FGameplayAttribute                                 Attribute_Shield_Const;                                     // 0x4FD0   (0x0038)  
	FGameplayAttribute                                 Attribute_CurrentHealth_Const;                              // 0x5008   (0x0038)  
	FGameplayAttribute                                 Attribute_Max_Health_Const;                                 // 0x5040   (0x0038)  
	FCameraLensInterfaceClassSupport                   LensEffectInterfaceClass_PlayerHealthDamage;                // 0x5078   (0x0008)  
	FCameraLensInterfaceClassSupport                   LensEffectInterfaceClass_PlayerShieldDamage;                // 0x5080   (0x0008)  
	FCameraLensInterfaceClassSupport                   LensEffectInterfaceClass_Directional_PlayerShieldDamage;    // 0x5088   (0x0008)  
	FCameraLensInterfaceClassSupport                   LensEffectInterfaceClass_Directional_PlayerHealthDamage;    // 0x5090   (0x0008)  
	TArray<class UMaterialInstanceDynamic*>            Temp_DIM_Array;                                             // 0x5098   (0x0010)  
	SDK_UNDEFINED(80,11244) /* TMap<TEnumAsByte<EFortCustomPartType>, bool> */ __um(PartValid);                    // 0x50A8   (0x0050)  
	SDK_UNDEFINED(16,11245) /* TArray<TEnumAsByte<EFortCustomPartType>> */ __um(ShieldPartList);                   // 0x50F8   (0x0010)  
	TArray<FCharacterPartMidArrayStruct>               ShieldMIDArrays;                                            // 0x5108   (0x0010)  
	SDK_UNDEFINED(80,11246) /* TMap<TEnumAsByte<EFortCustomPartType>, USkeletalMeshComponent*> */ __um(ShieldSkMeshes); // 0x5118   (0x0050)  
	int32_t                                            L_ShieldMIDIndex;                                           // 0x5168   (0x0004)  
	unsigned char                                      UnknownData12_5[0x4];                                       // 0x516C   (0x0004)  MISSED
	class USkeletalMeshComponent*                      NullPart_Mesh;                                              // 0x5170   (0x0008)  
	class UAnimMontage*                                PlayerDeath_Montage;                                        // 0x5178   (0x0008)  
	class UAnimMontage*                                PlayerDeathDBNO_Montage;                                    // 0x5180   (0x0008)  
	class UAnimMontage*                                PlayerDeathSkydive_Montage;                                 // 0x5188   (0x0008)  
	bool                                               PlayerDeath_EnableDeathDissolve;                            // 0x5190   (0x0001)  


	/// Functions
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.Melee_Effect_Color
	// void Melee_Effect_Color(FVector& Melee_Color_Set);                                                                    // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.On Set Material Part
	// void On Set Material Part(class AFortPlayerPawn* Pawn, class UCustomCharacterPart* Part, class USkeletalMeshComponent* MeshPart, TEnumAsByte<EFortCustomPartType> PartType); // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.Set Part Material
	// void Set Part Material(TArray<UMaterialInstanceDynamic*>& Array, class USkeletalMeshComponent* MeshPart);             // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.Find Shield MID Array
	// void Find Shield MID Array(TEnumAsByte<EFortCustomPartType> PartType, bool& Found, int32_t& Index, TArray<UMaterialInstanceDynamic*>& MIDs); // [0x130d900] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.Setup Duplicate FX Mesh
	// void Setup Duplicate FX Mesh(class UMaterialInterface*& Material to Apply, TEnumAsByte<EFortCustomPartType> PartType, TArray<UMaterialInstanceDynamic*>& Empty MID Array, class USkeletalMeshComponent*& Duplicated Mesh, bool Transfer Material Parameters, int32_t Translucent Sort Order, class USkeletalMeshComponent* MeshPart, bool& ObjectsValid); // [0x130d900] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.GetHealthPercent2
	// double GetHealthPercent2();                                                                                           // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.GetShieldPercent2
	// double GetShieldPercent2();                                                                                           // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.OnRep_BlockedByPawns
	// void OnRep_BlockedByPawns();                                                                                          // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.PlayHitSound
	// void PlayHitSound(class AFortPawn* Instigator, class AActor* Damage Causer);                                          // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.EnableWaterAudio
	// void EnableWaterAudio(bool IsEnteringWater);                                                                          // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.Set Body Type Sounds
	// void Set Body Type Sounds();                                                                                          // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.Set Scalar Parameter on Duplicate Mesh MIDs
	// void Set Scalar Parameter on Duplicate Mesh MIDs(FName Parameter Name, double Parameter Value);                       // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.Restore Previous Materials on Weapons Mesh
	// void Restore Previous Materials on Weapons Mesh(class AFortWeapon* Weapon to Restore);                                // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.Restore Previous Materials on Character Mesh
	// void Restore Previous Materials on Character Mesh();                                                                  // [0x130d900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.Override Materials and Copy Parameters on Weapons Mesh
	// void Override Materials and Copy Parameters on Weapons Mesh(class UMaterialInterface* Material to Apply);             // [0x130d900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.TriggerGameplayWindEmitter
	// void TriggerGameplayWindEmitter(TEnumAsByte<PlayerWindParticleEmitters> Player Wind Particle Emitter To Fire);        // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.Are the wind and water RTT passes enabled
	// void Are the wind and water RTT passes enabled(bool& NewParam);                                                       // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.DisableWaterLevelTick
	// void DisableWaterLevelTick();                                                                                         // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.OnRep_On_Player_Built_Floor
	// void OnRep_On_Player_Built_Floor();                                                                                   // [0x130d900] HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.Create and Duplicate Effect Poseable Skeletal Mesh
	// void Create and Duplicate Effect Poseable Skeletal Mesh(class UMaterialInterface* Material to Apply, TArray<UMaterialInstanceDynamic*>& Empty MID Array, int32_t TranslucentSortPriority, class UPoseableMeshComponent*& PoseableMesh, TEnumAsByte<EFortCustomPartType> CustomBodyType, class USkeletalMeshComponent* PartMesh); // [0x130d900] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.SlaveAMeshToTheBody
	// void SlaveAMeshToTheBody(class USkeletalMeshComponent* Mesh, class USkeletalMeshComponent* Master);                   // [0x130d900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.SetShieldMids_InternalLoop
	// void SetShieldMids_InternalLoop(double Highlight Cracks, bool Set Highlight Cracks, double Push, bool Set Push, TArray<UMaterialInstanceDynamic*>& MID Array); // [0x130d900] Private|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.SetShieldMids
	// void SetShieldMids(double Highlight Cracks, bool Set Highlight Cracks, double Push, bool Set Push);                   // [0x130d900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.FindShieldOpacity
	// void FindShieldOpacity();                                                                                             // [0x130d900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.Create and Duplicate Effect Skeletal Meshes Parent
	// void Create and Duplicate Effect Skeletal Meshes Parent(class USkeletalMeshComponent*& DuplicatedSkeletalMeshComponent, class UMaterialInterface* Material to Apply, TArray<UMaterialInstanceDynamic*>& Empty MID Array, int32_t TranslucentSortPriority, class USkeletalMeshComponent* MeshPart, TEnumAsByte<EFortCustomPartType> CustomBodyType); // [0x130d900] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x130d900] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.ShatterShield__FinishedFunc
	// void ShatterShield__FinishedFunc();                                                                                   // [0x130d900] BlueprintEvent       
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.ShatterShield__UpdateFunc
	// void ShatterShield__UpdateFunc();                                                                                     // [0x130d900] BlueprintEvent       
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.OnDamagePlayEffects
	// void OnDamagePlayEffects(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // [0x130d900] BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.OnLanded
	// void OnLanded(FHitResult& Hit);                                                                                       // [0x130d900] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.OnWeaponEquipped
	// void OnWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);                                   // [0x130d900] Event|Public|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                 // [0x130d900] Event|Public|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.FootStepLeft
	// void FootStepLeft();                                                                                                  // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.FootStepRight
	// void FootStepRight();                                                                                                 // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.OnCharacterPartsReinitialized
	// void OnCharacterPartsReinitialized();                                                                                 // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.GameplayCue.Abilities.Activation.Generic.HarvestBuff.Tier1
	// void GameplayCue.Abilities.Activation.Generic.HarvestBuff.Tier1(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.GameplayCue.Abilities.Activation.Generic.HarvestBuff.Tier2
	// void GameplayCue.Abilities.Activation.Generic.HarvestBuff.Tier2(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.SetFirstPersonCamera
	// void SetFirstPersonCamera(bool bNewUseFirstPersonCamera);                                                             // [0x130d900] Event|Public|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.InternalSetFirstPersonCamera
	// void InternalSetFirstPersonCamera(bool NewUseFirstPersonCamera);                                                      // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.OnBaseChanged
	// void OnBaseChanged(class AActor* NewBase);                                                                            // [0x130d900] Event|Public|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.ReceivePossessed
	// void ReceivePossessed(class AController* NewController);                                                              // [0x130d900] BlueprintAuthorityOnly|Event|Public|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.OnDisplaySentence
	// void OnDisplaySentence(FText& SpeechText);                                                                            // [0x130d900] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.OnClearSentence
	// void OnClearSentence();                                                                                               // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.ClientBindWeaponSwap
	// void ClientBindWeaponSwap(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);                               // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.BindWeaponSwap
	// void BindWeaponSwap(double InDuration);                                                                               // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.MultiSwapWeapon
	// void MultiSwapWeapon(class AFortWeapon* New, class AFortWeapon* Prev);                                                // [0x130d900] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.UnBindWeaponSwap
	// void UnBindWeaponSwap();                                                                                              // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.MultiEndSwap
	// void MultiEndSwap(class AFortWeapon* CurrentWeapon);                                                                  // [0x130d900] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.OnDeathServer
	// void OnDeathServer(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // [0x130d900] BlueprintAuthorityOnly|Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.PlayGameplayWindEffect
	// void PlayGameplayWindEffect(TEnumAsByte<PlayerWindParticleEmitters> Player Wind Particle Emitter To Fire);            // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.Exited/Entered Water Volume
	// void Exited/Entered Water Volume();                                                                                   // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.Player Creates a Splash
	// void Player Creates a Splash(FTransform& NewTransform);                                                               // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.ReinitializeWeaponMaterials
	// void ReinitializeWeaponMaterials();                                                                                   // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.OnDeathPlayEffects
	// void OnDeathPlayEffects(float Damage, FGameplayTagContainer& DamageTags, FVector Momentum, FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // [0x130d900] BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.GameplayCue.Shield.FullyCharged
	// void GameplayCue.Shield.FullyCharged(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters);   // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.GameplayCue.Damage.Shielded
	// void GameplayCue.Damage.Shielded(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters);       // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.GameplayCue.Shield.Destroyed
	// void GameplayCue.Shield.Destroyed(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters);      // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.GameplayCue.Damage
	// void GameplayCue.Damage(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters);                // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.OnEnteredVehicle
	// void OnEnteredVehicle();                                                                                              // [0x130d900] Event|Public|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.OnExitedVehicle
	// void OnExitedVehicle();                                                                                               // [0x130d900] Event|Public|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.MeleeSwingLeft
	// void MeleeSwingLeft(bool First Left);                                                                                 // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.MeleeSwingRight
	// void MeleeSwingRight(bool First Right);                                                                               // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.MeleeSwingLeft_End
	// void MeleeSwingLeft_End();                                                                                            // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.MeleeSwingRight_End
	// void MeleeSwingRight_End();                                                                                           // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.OnEnteredWaterVolume
	// void OnEnteredWaterVolume(FVector& WaterSurfaceLocation);                                                             // [0x130d900] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.OnExitedWaterVolume
	// void OnExitedWaterVolume(FVector& WaterSurfaceLocation);                                                              // [0x130d900] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.SetBlockedByPawns
	// void SetBlockedByPawns(bool bLocked);                                                                                 // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.ToggleLandFX
	// void ToggleLandFX(bool NewHidden);                                                                                    // [0x130d900] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.ToggleShieldVisibility
	// void ToggleShieldVisibility();                                                                                        // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.OnPartApplied
	// void OnPartApplied(class AFortPlayerPawn* Pawn, class UCustomCharacterPart* Part, class USkeletalMeshComponent* MeshPart, TEnumAsByte<EFortCustomPartType> PartType); // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.OnBackpack
	// void OnBackpack(class AFortPlayerPawn* Pawn, class UCustomCharacterPart* Part, class USkeletalMeshComponent* MeshPart, TEnumAsByte<EFortCustomPartType> PartType); // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.Set Scalar Parameter on Character MIDs
	// void Set Scalar Parameter on Character MIDs(FName Parameter Name, double Parameter Value);                            // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.OnMeshPart
	// void OnMeshPart(class AFortPlayerPawn* Pawn, class UCustomCharacterPart* Part, class USkeletalMeshComponent* MeshPart, TEnumAsByte<EFortCustomPartType> PartType); // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.GameplayCue.Athena.Equipping
	// void GameplayCue.Athena.Equipping(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters);      // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.ManualDeathDissolve
	// void ManualDeathDissolve();                                                                                           // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.OnLand_CE
	// void OnLand_CE();                                                                                                     // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.OnMeshPart3
	// void OnMeshPart3(class AFortPlayerPawn* Pawn, class UCustomCharacterPart* Part, class USkeletalMeshComponent* MeshPart, TEnumAsByte<EFortCustomPartType> PartType); // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.OnMeshPartComplete
	// void OnMeshPartComplete(class AFortPlayerPawn* Pawn, class USkeletalMeshComponent* BaseMesh, TArray<UCustomCharacterPart*>& PartsArray, TArray<USkeletalMeshComponent*>& ValidSkeletalMeshComponentPartArray); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.OnMeshPart2
	// void OnMeshPart2(class AFortPlayerPawn* Pawn, class UCustomCharacterPart* Part, class USkeletalMeshComponent* MeshPart, TEnumAsByte<EFortCustomPartType> PartType); // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.OnBackpackPart
	// void OnBackpackPart(class AFortPlayerPawn* Pawn, class UCustomCharacterPart* Part, class USkeletalMeshComponent* MeshPart, TEnumAsByte<EFortCustomPartType> PartType); // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.AnimTrailsDisable
	// void AnimTrailsDisable();                                                                                             // [0x130d900] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.AnimTrailsSetup
	// void AnimTrailsSetup(class UParticleSystem* ParticleSystemReference, class UNiagaraSystem* NiagaraSystemReference, FName FirstSocketName, FName SecondSocketName, float Width, class UFXSystemComponent* OverrideParticleComp, FName OverideFirstSocketName, FName OverideSecondSocketName); // [0x130d900] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.AnimTrailsNotify
	// void AnimTrailsNotify(bool bActive);                                                                                  // [0x130d900] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.ExecuteUbergraph_PlayerPawn_Generic
	// void ExecuteUbergraph_PlayerPawn_Generic(int32_t EntryPoint);                                                         // [0x130d900] Final|HasDefaults    
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.SwingLeft2__DelegateSignature
	// void SwingLeft2__DelegateSignature();                                                                                 // [0x130d900] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.SwingRight2__DelegateSignature
	// void SwingRight2__DelegateSignature();                                                                                // [0x130d900] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.AnimNotify_End__DelegateSignature
	// void AnimNotify_End__DelegateSignature();                                                                             // [0x130d900] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.AnimNotify_Begin__DelegateSignature
	// void AnimNotify_Begin__DelegateSignature(bool bActive);                                                               // [0x130d900] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.SwingLeftEnd__DelegateSignature
	// void SwingLeftEnd__DelegateSignature();                                                                               // [0x130d900] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.SwingLeft__DelegateSignature
	// void SwingLeft__DelegateSignature();                                                                                  // [0x130d900] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.SwingRightEnd__DelegateSignature
	// void SwingRightEnd__DelegateSignature();                                                                              // [0x130d900] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic.PlayerPawn_Generic_C.SwingRight__DelegateSignature
	// void SwingRight__DelegateSignature();                                                                                 // [0x130d900] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Abilities/Emotes/GameplayCues/GCNS_GM_OnDisplayEmoji.GCNS_GM_OnDisplayEmoji_C
/// Size: 0x0000 (0x000230 - 0x000230)
class UGCNS_GM_OnDisplayEmoji_C : public UGameplayCueNotify_OnDisplayEmoji
{ 
public:
};

/// Class /Game/Abilities/Emotes/GameplayCues/GCNS_GM_OnPreviewEmoji.GCNS_GM_OnPreviewEmoji_C
/// Size: 0x0000 (0x000248 - 0x000248)
class UGCNS_GM_OnPreviewEmoji_C : public UGameplayCueNotify_OnPreviewEmoji
{ 
public:
};

/// Class /Game/Abilities/Emotes/GameplayCues/GCNS_GM_OnDisplayChatEmoji.GCNS_GM_OnDisplayChatEmoji_C
/// Size: 0x0020 (0x000068 - 0x000088)
class UGCNS_GM_OnDisplayChatEmoji_C : public UFortGameplayCueNotify_Simple
{ 
public:
	FVector                                            ParticleRelativeOffset;                                     // 0x0068   (0x0018)  
	class USoundBase*                                  BubbleSound;                                                // 0x0080   (0x0008)  


	/// Functions
	// Function /Game/Abilities/Emotes/GameplayCues/GCNS_GM_OnDisplayChatEmoji.GCNS_GM_OnDisplayChatEmoji_C.K2_HandleGameplayCue
	// void K2_HandleGameplayCue(class AActor* MyTarget, TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters); // [0x130d900] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/Abilities/Emotes/GameplayCues/GCNS_GM_OnDisplayChatEmoji.GCNS_GM_OnDisplayChatEmoji_C.OnActive
	// bool OnActive(class AActor* MyTarget, FGameplayCueParameters& Parameters);                                            // [0x130d900] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/Abilities/Emotes/GameplayCues/GCNS_GM_OnDisplayChatEmoji.GCNS_GM_OnDisplayChatEmoji_C.OnRemove
	// bool OnRemove(class AActor* MyTarget, FGameplayCueParameters& Parameters);                                            // [0x130d900] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/Abilities/Emotes/GameplayCues/GCNS_GM_OnDisplayChatEmoji.GCNS_GM_OnDisplayChatEmoji_C.OnExecute
	// bool OnExecute(class AActor* MyTarget, FGameplayCueParameters& Parameters);                                           // [0x130d900] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/Abilities/Emotes/GameplayCues/GCNS_GM_OnDisplayChatEmoji.GCNS_GM_OnDisplayChatEmoji_C.OnStartParticleSystemSpawned
	// void OnStartParticleSystemSpawned(class UParticleSystemComponent* SpawnedParticleSysComponent, FGameplayCueParameters& Parameters); // [0x130d900] Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|Const 
};

/// Class /Game/Abilities/Player/Athena/GCNL_Athena_Tether.GCNL_Athena_Tether_C
/// Size: 0x0088 (0x0009B0 - 0x000A38)
class AGCNL_Athena_Tether_C : public AFortGameplayCueNotify_Loop
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x09B0   (0x0008)  
	class UFortLayeredAudioComponent*                  FortLayeredAudio;                                           // 0x09B8   (0x0008)  
	class UNiagaraComponent*                           LandFX;                                                     // 0x09C0   (0x0008)  
	class UNiagaraComponent*                           WaterFX;                                                    // 0x09C8   (0x0008)  
	class UStaticMeshComponent*                        RightSki;                                                   // 0x09D0   (0x0008)  
	class UStaticMeshComponent*                        LeftSki;                                                    // 0x09D8   (0x0008)  
	float                                              ScaleInSkis_SkiScalar_93783D4A4F91BF9F887B16977978DDB4;     // 0x09E0   (0x0004)  
	SDK_UNDEFINED(1,11247) /* TEnumAsByte<ETimelineDirection> */ __um(ScaleInSkis__Direction_93783D4A4F91BF9F887B16977978DDB4); // 0x09E4   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x09E5   (0x0003)  MISSED
	class UTimelineComponent*                          ScaleInSkis;                                                // 0x09E8   (0x0008)  
	class AFortPlayerPawn*                             OwningFPP;                                                  // 0x09F0   (0x0008)  
	bool                                               IsInWater;                                                  // 0x09F8   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x09F9   (0x0007)  MISSED
	double                                             NormalizedSpeed;                                            // 0x0A00   (0x0008)  
	double                                             TurnSpeed;                                                  // 0x0A08   (0x0008)  
	double                                             ForceFeedbackIntensity;                                     // 0x0A10   (0x0008)  
	FTimerHandle                                       ScaleInSkisTimerHandle;                                     // 0x0A18   (0x0008)  
	double                                             SkiScaleInDelay;                                            // 0x0A20   (0x0008)  
	SDK_UNDEFINED(16,11248) /* TScriptInterface<Class> */ __um(CameraLensEffectInterface);                         // 0x0A28   (0x0010)  


	/// Functions
	// Function /Game/Abilities/Player/Athena/GCNL_Athena_Tether.GCNL_Athena_Tether_C.OnRemove
	// bool OnRemove(class AActor* MyTarget, FGameplayCueParameters& Parameters);                                            // [0x130d900] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCNL_Athena_Tether.GCNL_Athena_Tether_C.WhileActive
	// bool WhileActive(class AActor* MyTarget, FGameplayCueParameters& Parameters);                                         // [0x130d900] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCNL_Athena_Tether.GCNL_Athena_Tether_C.UpdateAudio
	// void UpdateAudio(int32_t Surface);                                                                                    // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCNL_Athena_Tether.GCNL_Athena_Tether_C.ScaleInSkis__FinishedFunc
	// void ScaleInSkis__FinishedFunc();                                                                                     // [0x130d900] BlueprintEvent       
	// Function /Game/Abilities/Player/Athena/GCNL_Athena_Tether.GCNL_Athena_Tether_C.ScaleInSkis__UpdateFunc
	// void ScaleInSkis__UpdateFunc();                                                                                       // [0x130d900] BlueprintEvent       
	// Function /Game/Abilities/Player/Athena/GCNL_Athena_Tether.GCNL_Athena_Tether_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                 // [0x130d900] Event|Public|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCNL_Athena_Tether.GCNL_Athena_Tether_C.OnApplication
	// void OnApplication(class AActor* MyTarget, FGameplayCueParameters& Parameters, TArray<UParticleSystemComponent*>& ParticleComponents, TArray<UAudioComponent*>& AudioComponents, class ULegacyCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance); // [0x130d900] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCNL_Athena_Tether.GCNL_Athena_Tether_C.OnRemoval
	// void OnRemoval(class AActor* MyTarget, FGameplayCueParameters& Parameters, TArray<UParticleSystemComponent*>& ParticleComponents, TArray<UAudioComponent*>& AudioComponents, class ULegacyCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance); // [0x130d900] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCNL_Athena_Tether.GCNL_Athena_Tether_C.BndEvt__FortLayeredAudio_K2Node_ComponentBoundEvent_0_OnLayeredAudioComponentOneshot__DelegateSignature
	// void BndEvt__FortLayeredAudio_K2Node_ComponentBoundEvent_0_OnLayeredAudioComponentOneshot__DelegateSignature(class UAudioComponent* AudioComponent, FName ParameterName, int32_t OneshotIndex); // [0x130d900] BlueprintEvent       
	// Function /Game/Abilities/Player/Athena/GCNL_Athena_Tether.GCNL_Athena_Tether_C.StartFF
	// void StartFF();                                                                                                       // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCNL_Athena_Tether.GCNL_Athena_Tether_C.UpdateFF
	// void UpdateFF();                                                                                                      // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCNL_Athena_Tether.GCNL_Athena_Tether_C.StopFF
	// void StopFF();                                                                                                        // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCNL_Athena_Tether.GCNL_Athena_Tether_C.InitializeTetherGCNL
	// void InitializeTetherGCNL(class UObject* Object);                                                                     // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCNL_Athena_Tether.GCNL_Athena_Tether_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCNL_Athena_Tether.GCNL_Athena_Tether_C.ScaleInSkisForPlayer
	// void ScaleInSkisForPlayer();                                                                                          // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCNL_Athena_Tether.GCNL_Athena_Tether_C.ExecuteUbergraph_GCNL_Athena_Tether
	// void ExecuteUbergraph_GCNL_Athena_Tether(int32_t EntryPoint);                                                         // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/Player/Athena/GCN_Athena_Bush.GCN_Athena_Bush_C
/// Size: 0x0090 (0x0009B0 - 0x000A40)
class AGCN_Athena_Bush_C : public AFortGameplayCueNotify_Loop
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x09B0   (0x0008)  
	class UStaticMeshComponent*                        OwningPlayer_BushMesh;                                      // 0x09B8   (0x0008)  
	class UArrowComponent*                             Arrow2;                                                     // 0x09C0   (0x0008)  
	class UArrowComponent*                             Arrow1;                                                     // 0x09C8   (0x0008)  
	class UStaticMeshComponent*                        BushMesh;                                                   // 0x09D0   (0x0008)  
	class UArrowComponent*                             Arrow;                                                      // 0x09D8   (0x0008)  
	class UParticleSystemComponent*                    Trail_Leaves;                                               // 0x09E0   (0x0008)  
	float                                              OpacityFade_OpacityFadeOut_B989988545DAA0B2E69D77AE069A4437; // 0x09E8   (0x0004)  
	SDK_UNDEFINED(1,11249) /* TEnumAsByte<ETimelineDirection> */ __um(OpacityFade__Direction_B989988545DAA0B2E69D77AE069A4437); // 0x09EC   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x09ED   (0x0003)  MISSED
	class UTimelineComponent*                          OpacityFade;                                                // 0x09F0   (0x0008)  
	class AActor*                                      PlayerPawn;                                                 // 0x09F8   (0x0008)  
	class UMaterialInstanceDynamic*                    MID_Bush;                                                   // 0x0A00   (0x0008)  
	bool                                               IsActive;                                                   // 0x0A08   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0A09   (0x0007)  MISSED
	class UMaterialInstanceDynamic*                    MID_OwningClientBush;                                       // 0x0A10   (0x0008)  
	FCurveTableRowHandle                               ClientBushOpacity;                                          // 0x0A18   (0x0010)  
	double                                             TargetOpacity;                                              // 0x0A28   (0x0008)  
	class UParticleSystem*                             BushDestructionVFX;                                         // 0x0A30   (0x0008)  
	class USoundBase*                                  BushDestructionSFX;                                         // 0x0A38   (0x0008)  


	/// Functions
	// Function /Game/Abilities/Player/Athena/GCN_Athena_Bush.GCN_Athena_Bush_C.OpacityFade__FinishedFunc
	// void OpacityFade__FinishedFunc();                                                                                     // [0x130d900] BlueprintEvent       
	// Function /Game/Abilities/Player/Athena/GCN_Athena_Bush.GCN_Athena_Bush_C.OpacityFade__UpdateFunc
	// void OpacityFade__UpdateFunc();                                                                                       // [0x130d900] BlueprintEvent       
	// Function /Game/Abilities/Player/Athena/GCN_Athena_Bush.GCN_Athena_Bush_C.On Player Step
	// void On Player Step();                                                                                                // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCN_Athena_Bush.GCN_Athena_Bush_C.OnLoopingStart
	// void OnLoopingStart(class AActor* MyTarget, FGameplayCueParameters& Parameters, TArray<UParticleSystemComponent*>& ParticleComponents, TArray<UAudioComponent*>& AudioComponents); // [0x130d900] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCN_Athena_Bush.GCN_Athena_Bush_C.OnRemoval
	// void OnRemoval(class AActor* MyTarget, FGameplayCueParameters& Parameters, TArray<UParticleSystemComponent*>& ParticleComponents, TArray<UAudioComponent*>& AudioComponents, class ULegacyCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance); // [0x130d900] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCN_Athena_Bush.GCN_Athena_Bush_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                 // [0x130d900] Event|Public|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCN_Athena_Bush.GCN_Athena_Bush_C.ExecuteUbergraph_GCN_Athena_Bush
	// void ExecuteUbergraph_GCN_Athena_Bush(int32_t EntryPoint);                                                            // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/Emotes/GAB_Emote_Generic.GAB_Emote_Generic_C
/// Size: 0x0059 (0x000B60 - 0x000BB9)
class UGAB_Emote_Generic_C : public UFortGameplayAbility_Emote
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0B60   (0x0008)  
	class AFortPlayerPawn*                             PlayerPawn;                                                 // 0x0B68   (0x0008)  
	double                                             PostTriggerCancelDelay;                                     // 0x0B70   (0x0008)  
	bool                                               HideReticle;                                                // 0x0B78   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0B79   (0x0007)  MISSED
	FGameplayTagContainer                              ReticleHUDElementTags;                                      // 0x0B80   (0x0020)  
	FName                                              MontageOverrideSection;                                     // 0x0BA0   (0x0004)  
	bool                                               bAbilityStopped;                                            // 0x0BA4   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0BA5   (0x0003)  MISSED
	FName                                              EmoteHolsterId;                                             // 0x0BA8   (0x0004)  
	bool                                               bHolstered;                                                 // 0x0BAC   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x0BAD   (0x0003)  MISSED
	FName                                              HUDElementVisibilityReasonName;                             // 0x0BB0   (0x0004)  
	int32_t                                            WaitForLoadedCount;                                         // 0x0BB4   (0x0004)  
	bool                                               bClearInteractOnActivate;                                   // 0x0BB8   (0x0001)  


	/// Functions
	// Function /Game/Abilities/Emotes/GAB_Emote_Generic.GAB_Emote_Generic_C.ShouldPlayFailedMontage
	// bool ShouldPlayFailedMontage(FGameplayTagContainer& FailedReason);                                                    // [0x130d900] Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/Abilities/Emotes/GAB_Emote_Generic.GAB_Emote_Generic_C.K2_CanActivateAbility
	// bool K2_CanActivateAbility(FGameplayAbilityActorInfo ActorInfo, FGameplayAbilitySpecHandle Handle, FGameplayTagContainer& RelevantTags); // [0x130d900] Event|Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/Abilities/Emotes/GAB_Emote_Generic.GAB_Emote_Generic_C.IsMontagePlaying
	// void IsMontagePlaying(class UAnimMontage* Montage, bool& Result);                                                     // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Emotes/GAB_Emote_Generic.GAB_Emote_Generic_C.ForceStopMontage
	// void ForceStopMontage();                                                                                              // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Emotes/GAB_Emote_Generic.GAB_Emote_Generic_C.SetReticleVisibility
	// void SetReticleVisibility(bool ShouldHide);                                                                           // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Emotes/GAB_Emote_Generic.GAB_Emote_Generic_C.GetMontageToPlay
	// TWeakObjectPtr<UAnimMontage*> GetMontageToPlay(class UFortMontageItemDefinitionBase* EmoteAsset, TEnumAsByte<EFortCustomBodyType> BodyType, TEnumAsByte<EFortCustomGender> Gender); // [0x130d900] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Emotes/GAB_Emote_Generic.GAB_Emote_Generic_C.GetBodyTypeAndGender
	// void GetBodyTypeAndGender(TEnumAsByte<EFortCustomBodyType>& BodyType, TEnumAsByte<EFortCustomGender>& Gender);        // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Emotes/GAB_Emote_Generic.GAB_Emote_Generic_C.K2_OnEndAbility
	// void K2_OnEndAbility(bool bWasCancelled);                                                                             // [0x130d900] Event|Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Emotes/GAB_Emote_Generic.GAB_Emote_Generic_C.Completed_DE7019AA4E006879EDD264899869FEE2
	// void Completed_DE7019AA4E006879EDD264899869FEE2(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Emotes/GAB_Emote_Generic.GAB_Emote_Generic_C.Cancelled_DE7019AA4E006879EDD264899869FEE2
	// void Cancelled_DE7019AA4E006879EDD264899869FEE2(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Emotes/GAB_Emote_Generic.GAB_Emote_Generic_C.Triggered_DE7019AA4E006879EDD264899869FEE2
	// void Triggered_DE7019AA4E006879EDD264899869FEE2(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Emotes/GAB_Emote_Generic.GAB_Emote_Generic_C.OnLoaded_D5C2B0D14DEB9277D15965B97800FD1D
	// void OnLoaded_D5C2B0D14DEB9277D15965B97800FD1D(class UObject* Loaded);                                                // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Emotes/GAB_Emote_Generic.GAB_Emote_Generic_C.OnLoaded_DA96775D40CD998BF2FF0085FE5AB126
	// void OnLoaded_DA96775D40CD998BF2FF0085FE5AB126(class UObject* Loaded);                                                // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Emotes/GAB_Emote_Generic.GAB_Emote_Generic_C.K2_ActivateAbility
	// void K2_ActivateAbility();                                                                                            // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Emotes/GAB_Emote_Generic.GAB_Emote_Generic_C.OnMontageStartedPlaying
	// void OnMontageStartedPlaying();                                                                                       // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Emotes/GAB_Emote_Generic.GAB_Emote_Generic_C.PlayInitialEmoteMontage
	// void PlayInitialEmoteMontage();                                                                                       // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Emotes/GAB_Emote_Generic.GAB_Emote_Generic_C.NonMontageAsyncAssetsReady
	// void NonMontageAsyncAssetsReady();                                                                                    // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Emotes/GAB_Emote_Generic.GAB_Emote_Generic_C.ExecuteUbergraph_GAB_Emote_Generic
	// void ExecuteUbergraph_GAB_Emote_Generic(int32_t EntryPoint);                                                          // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/Sprays/GAB_Spray_Generic.GAB_Spray_Generic_C
/// Size: 0x0067 (0x000BB9 - 0x000C20)
class UGAB_Spray_Generic_C : public UGAB_Emote_Generic_C
{ 
public:
	unsigned char                                      UnknownData00_3[0x7];                                       // 0x0BB9   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0BC0   (0x0008)  
	double                                             DecalSize;                                                  // 0x0BC8   (0x0008)  
	class UAthenaSprayItemDefinition*                  MySpray;                                                    // 0x0BD0   (0x0008)  
	double                                             DecalTraceDistance;                                         // 0x0BD8   (0x0008)  
	SDK_UNDEFINED(32,11250) /* TWeakObjectPtr<UAnimMontage*> */ __um(DefaultSprayMontage_M);                       // 0x0BE0   (0x0020)  
	SDK_UNDEFINED(32,11251) /* TWeakObjectPtr<UAnimMontage*> */ __um(DefaultSprayMontage_F);                       // 0x0C00   (0x0020)  


	/// Functions
	// Function /Game/Abilities/Sprays/GAB_Spray_Generic.GAB_Spray_Generic_C.GetMontageToPlay
	// TWeakObjectPtr<UAnimMontage*> GetMontageToPlay(class UFortMontageItemDefinitionBase* EmoteAsset, TEnumAsByte<EFortCustomBodyType> BodyType, TEnumAsByte<EFortCustomGender> Gender); // [0x130d900] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Sprays/GAB_Spray_Generic.GAB_Spray_Generic_C.TargetLineTrace
	// void TargetLineTrace(class AFortPawn* ActivatingPawn, bool& HitSomething, FVector& Location, FVector& Normal);        // [0x130d900] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Sprays/GAB_Spray_Generic.GAB_Spray_Generic_C.OnMontageStartedPlaying
	// void OnMontageStartedPlaying();                                                                                       // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Sprays/GAB_Spray_Generic.GAB_Spray_Generic_C.ExecuteUbergraph_GAB_Spray_Generic
	// void ExecuteUbergraph_GAB_Spray_Generic(int32_t EntryPoint);                                                          // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/Emotes/GAB_Emote_Generic_Transformation.GAB_Emote_Generic_Transformation_C
/// Size: 0x0000 (0x000BB9 - 0x000BB9)
class UGAB_Emote_Generic_Transformation_C : public UGAB_Emote_Generic_C
{ 
public:
};

/// Class /Game/Abilities/Player/Commando/TacticalPerks/Clusterbomb/GE_Commando_Tactical_ClusterBomb_Damage.GE_Commando_Tactical_ClusterBomb_Damage_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_Commando_Tactical_ClusterBomb_Damage_C : public UGET_DirectPhysicalDamage_C
{ 
public:
};

/// Class /Game/Abilities/Player/Generic/GameplayEffects/GE_Generic_Character_Launch.GE_Generic_Character_Launch_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_Generic_Character_Launch_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Abilities/Player/Parents/GE_Hero_PulsingEnergyCost.GE_Hero_PulsingEnergyCost_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_Hero_PulsingEnergyCost_C : public UGET_EnergyCost_C
{ 
public:
};

/// Class /Game/Abilities/Weapons/Ranged/GE_Ranged_GenericDamage_Explosive.GE_Ranged_GenericDamage_Explosive_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_Ranged_GenericDamage_Explosive_C : public UGET_DirectPhysicalDamage_C
{ 
public:
};

/// Class /Game/Abilities/Player/Commando/Perks/ClusterBomb/GE_Commando_ClusterBombDamage.GE_Commando_ClusterBombDamage_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_Commando_ClusterBombDamage_C : public UGET_DirectPhysicalDamage_C
{ 
public:
};

/// Class /Game/Abilities/Player/Commando/Actives/FragGrenade/GE_Commando_FragGrenadeKeepOutDamage.GE_Commando_FragGrenadeKeepOutDamage_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_Commando_FragGrenadeKeepOutDamage_C : public UGET_DirectEnergyDamage_C
{ 
public:
};

/// Class /Game/Abilities/Player/Interrogation/Athena_PlayerCameraMode_Interrogation_Map.Athena_PlayerCameraMode_Interrogation_Map_C
/// Size: 0x0000 (0x001BA0 - 0x001BA0)
class UAthena_PlayerCameraMode_Interrogation_Map_C : public UAthena_PlayerCameraModeBase_C
{ 
public:
};

/// Class /Game/Abilities/Player/Interrogation/GA_Interrogate_GC.GA_Interrogate_GC_C
/// Size: 0x000C (0x000B60 - 0x000B6C)
class UGA_Interrogate_GC_C : public UFortGameplayAbility
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0B60   (0x0008)  
	FGameplayTag                                       Cue;                                                        // 0x0B68   (0x0004)  


	/// Functions
	// Function /Game/Abilities/Player/Interrogation/GA_Interrogate_GC.GA_Interrogate_GC_C.K2_ActivateAbility
	// void K2_ActivateAbility();                                                                                            // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GA_Interrogate_GC.GA_Interrogate_GC_C.FailedToActivatePassiveAbility
	// void FailedToActivatePassiveAbility(FGameplayAbilityActorInfo ActorInfo);                                             // [0x130d900] Event|Public|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GA_Interrogate_GC.GA_Interrogate_GC_C.ExecuteUbergraph_GA_Interrogate_GC
	// void ExecuteUbergraph_GA_Interrogate_GC(int32_t EntryPoint);                                                          // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/Player/Interrogation/GE_Interrogate_GC.GE_Interrogate_GC_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_Interrogate_GC_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Abilities/Player/Generic/GameplayEffects/GE_Generic_StaminaRegenLockout.GE_Generic_StaminaRegenLockout_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_Generic_StaminaRegenLockout_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Abilities/Player/Sliding/Athena_PlayerCameraMode_Sliding.Athena_PlayerCameraMode_Sliding_C
/// Size: 0x0000 (0x001BA0 - 0x001BA0)
class UAthena_PlayerCameraMode_Sliding_C : public UAthena_PlayerCameraModeBase_C
{ 
public:
};

/// Class /Game/Abilities/NPC/Generic/GE_KnockbackActive.GE_KnockbackActive_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_KnockbackActive_C : public UGET_TagContainer_C
{ 
public:
};

/// Class /Game/Abilities/Player/Interrogation/GE_Interrogation_Cooldown.GE_Interrogation_Cooldown_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_Interrogation_Cooldown_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Abilities/Weapons/Ranged/GE_Damage_Explosive_NoLineOfSight.GE_Damage_Explosive_NoLineOfSight_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_Damage_Explosive_NoLineOfSight_C : public UGE_Ranged_GenericDamage_Explosive_C
{ 
public:
};

/// Class /Game/Abilities/Player/Sliding/CameraModifier_Athena_Sliding.CameraModifier_Athena_Sliding_C
/// Size: 0x0008 (0x000100 - 0x000108)
class UCameraModifier_Athena_Sliding_C : public USlidingCameraModifier
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0100   (0x0008)  


	/// Functions
	// Function /Game/Abilities/Player/Sliding/CameraModifier_Athena_Sliding.CameraModifier_Athena_Sliding_C.BlendOut
	// void BlendOut();                                                                                                      // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Sliding/CameraModifier_Athena_Sliding.CameraModifier_Athena_Sliding_C.ExecuteUbergraph_CameraModifier_Athena_Sliding
	// void ExecuteUbergraph_CameraModifier_Athena_Sliding(int32_t EntryPoint);                                              // [0x130d900] Final                
};

/// Class /Game/Abilities/Player/Parents/GAT_TriggeredAbility.GAT_TriggeredAbility_C
/// Size: 0x000D (0x000B60 - 0x000B6D)
class UGAT_TriggeredAbility_C : public UFortGameplayAbility
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0B60   (0x0008)  
	FGameplayTag                                       TC_AbilitiesGenericTriggeredAbilityActivate;                // 0x0B68   (0x0004)  
	bool                                               bPlayerHolsterState;                                        // 0x0B6C   (0x0001)  


	/// Functions
	// Function /Game/Abilities/Player/Parents/GAT_TriggeredAbility.GAT_TriggeredAbility_C.EndAbilityWithReason
	// void EndAbilityWithReason(FString Reason);                                                                            // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Parents/GAT_TriggeredAbility.GAT_TriggeredAbility_C.SetHolsterWeaponWithName
	// void SetHolsterWeaponWithName(class AFortPawn* Target Fort Pawn, bool ShouldHolster, bool PlayEquipAnim, bool ShowDebugPrintName, bool& IsWeaponHolstered, bool& OperationSuccessful); // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Parents/GAT_TriggeredAbility.GAT_TriggeredAbility_C.TriggeredAbilitySetup
	// void TriggeredAbilitySetup(class UAbilitySystemComponent* AbilitySystemIn, class UAbilitySystemComponent*& AbilitySystemOut); // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Parents/GAT_TriggeredAbility.GAT_TriggeredAbility_C.K2_ActivateAbilityFromEvent
	// void K2_ActivateAbilityFromEvent(FGameplayEventData& EventData);                                                      // [0x130d900] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/Player/Parents/GAT_TriggeredAbility.GAT_TriggeredAbility_C.ExecuteUbergraph_GAT_TriggeredAbility
	// void ExecuteUbergraph_GAT_TriggeredAbility(int32_t EntryPoint);                                                       // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/NPC/Generic/GE_TransferKnockback.GE_TransferKnockback_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_TransferKnockback_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Abilities/Weapons/Ranged/GE_Impulse.GE_Impulse_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_Impulse_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Abilities/Player/Constructor/TacticalPerks/PlasmaGrenades/GE_Constructor_Tactical_PlasmaGrenades_Applied.GE_Constructor_Tactical_PlasmaGrenades_Applied_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_Constructor_Tactical_PlasmaGrenades_Applied_C : public UGET_PeriodicEnergyDamage_C
{ 
public:
};

/// Class /Game/Abilities/Player/Commando/Actives/FragGrenade/GE_Commando_FragGrenadeDamage.GE_Commando_FragGrenadeDamage_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_Commando_FragGrenadeDamage_C : public UGET_DirectEnergyDamage_C
{ 
public:
};

/// Class /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C
/// Size: 0x0129 (0x000B60 - 0x000C89)
class UGAB_GenericApplyKnockback_C : public UFortGameplayAbility
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0B60   (0x0008)  
	class UClass*                                      GE_TransferKnockback;                                       // 0x0B68   (0x0008)  
	class UClass*                                      GE_KnockbackActive;                                         // 0x0B70   (0x0008)  
	double                                             KnockbackPropagationThreshold;                              // 0x0B78   (0x0008)  
	class UAnimMontage*                                KnockbackUpMontage;                                         // 0x0B80   (0x0008)  
	FName                                              KnockbackUpMontageSection;                                  // 0x0B88   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0B8C   (0x0004)  MISSED
	class UAnimMontage*                                KnockbackDownMontage;                                       // 0x0B90   (0x0008)  
	FName                                              KnockbackDownMontageSection;                                // 0x0B98   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0B9C   (0x0004)  MISSED
	class UAnimMontage*                                KnockbackLandMontage;                                       // 0x0BA0   (0x0008)  
	FName                                              KnockbackLandMontageSection;                                // 0x0BA8   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x0BAC   (0x0004)  MISSED
	class UAnimMontage*                                KnockbackLandToIdleMontage;                                 // 0x0BB0   (0x0008)  
	FName                                              KnockbackLandToIdleMontageSection;                          // 0x0BB8   (0x0004)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x0BBC   (0x0004)  MISSED
	class UAnimMontage*                                KnockbackLandToStunMontage;                                 // 0x0BC0   (0x0008)  
	FName                                              KnockbackLandToStunMontageSection;                          // 0x0BC8   (0x0004)  
	bool                                               DebugDraw;                                                  // 0x0BCC   (0x0001)  
	bool                                               DebugNumbers;                                               // 0x0BCD   (0x0001)  
	bool                                               DebugForceKnockbackValues;                                  // 0x0BCE   (0x0001)  
	bool                                               bOrientToImpulse;                                           // 0x0BCF   (0x0001)  
	FActiveGameplayEffectHandle                        ActiveKnockback;                                            // 0x0BD0   (0x0008)  
	FVector                                            OrientDirection;                                            // 0x0BD8   (0x0018)  
	FVector                                            HitDirection;                                               // 0x0BF0   (0x0018)  
	FVector                                            ImpulseDirectionVelocityOrRotation;                         // 0x0C08   (0x0018)  
	FVector                                            DebugLastLocation;                                          // 0x0C20   (0x0018)  
	FGameplayTag                                       TC_NPCStatusLockedInPlace;                                  // 0x0C38   (0x0004)  
	unsigned char                                      UnknownData04_5[0x4];                                       // 0x0C3C   (0x0004)  MISSED
	double                                             LockedInPlaceKnockbackAngle;                                // 0x0C40   (0x0008)  
	double                                             LockedInPlaceKnockbackMagnitude;                            // 0x0C48   (0x0008)  
	class UClass*                                      GE_RestoreControlResistance;                                // 0x0C50   (0x0008)  
	class UClass*                                      GE_ImpactImmunity;                                          // 0x0C58   (0x0008)  
	FActiveGameplayEffectHandle                        ActiveImpactImmunity;                                       // 0x0C60   (0x0008)  
	bool                                               bHasImpactImmunity;                                         // 0x0C68   (0x0001)  
	unsigned char                                      UnknownData05_5[0x7];                                       // 0x0C69   (0x0007)  MISSED
	double                                             F_OneFrameDelay;                                            // 0x0C70   (0x0008)  
	FGameplayTag                                       Event_Triggered_Knockback;                                  // 0x0C78   (0x0004)  
	bool                                               KnockbackFromFloorTrap;                                     // 0x0C7C   (0x0001)  
	bool                                               KnockbackFromFloorTrap_PlayUpMontage;                       // 0x0C7D   (0x0001)  
	bool                                               KnockbackFromFloorTrap_PlayDownMontage;                     // 0x0C7E   (0x0001)  
	bool                                               KnockbackFromFloorTrap_PlayLandMontage;                     // 0x0C7F   (0x0001)  
	FGameplayTag                                       Event_Control_Ended;                                        // 0x0C80   (0x0004)  
	FGameplayTag                                       GC_TrapKnockback_Tag;                                       // 0x0C84   (0x0004)  
	bool                                               AllowKnockbackAnimation;                                    // 0x0C88   (0x0001)  


	/// Functions
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.CheckForPawnDeath
	// void CheckForPawnDeath(class AFortPawn* Pawn, bool& IsDead);                                                          // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.DoesUseInstagorInsteadOfImpulseDirection
	// void DoesUseInstagorInsteadOfImpulseDirection(FGameplayEffectContextHandle EffectContext, class UObject* OptionalObject, bool& Value); // [0x130d900] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.GetPawnFromInstigator
	// void GetPawnFromInstigator(class AActor* InActor, class AFortPlayerPawn*& OutPawn);                                   // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.CalculateImpulseDirection
	// FVector CalculateImpulseDirection(class AFortPlayerPawn* InPawn);                                                     // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.OnCancelled_D744890E4C485F1C80B3E7864AE506FF
	// void OnCancelled_D744890E4C485F1C80B3E7864AE506FF();                                                                  // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.OnInterrupted_D744890E4C485F1C80B3E7864AE506FF
	// void OnInterrupted_D744890E4C485F1C80B3E7864AE506FF();                                                                // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.OnBlendOut_D744890E4C485F1C80B3E7864AE506FF
	// void OnBlendOut_D744890E4C485F1C80B3E7864AE506FF();                                                                   // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.OnCompleted_D744890E4C485F1C80B3E7864AE506FF
	// void OnCompleted_D744890E4C485F1C80B3E7864AE506FF();                                                                  // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.OnCancelled_1F181048470CEB2EB6CC648039C5913C
	// void OnCancelled_1F181048470CEB2EB6CC648039C5913C();                                                                  // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.OnInterrupted_1F181048470CEB2EB6CC648039C5913C
	// void OnInterrupted_1F181048470CEB2EB6CC648039C5913C();                                                                // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.OnBlendOut_1F181048470CEB2EB6CC648039C5913C
	// void OnBlendOut_1F181048470CEB2EB6CC648039C5913C();                                                                   // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.OnCompleted_1F181048470CEB2EB6CC648039C5913C
	// void OnCompleted_1F181048470CEB2EB6CC648039C5913C();                                                                  // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.OnCancelled_BA9188C34C234A4C47306FA73AAF0583
	// void OnCancelled_BA9188C34C234A4C47306FA73AAF0583();                                                                  // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.OnInterrupted_BA9188C34C234A4C47306FA73AAF0583
	// void OnInterrupted_BA9188C34C234A4C47306FA73AAF0583();                                                                // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.OnBlendOut_BA9188C34C234A4C47306FA73AAF0583
	// void OnBlendOut_BA9188C34C234A4C47306FA73AAF0583();                                                                   // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.OnCompleted_BA9188C34C234A4C47306FA73AAF0583
	// void OnCompleted_BA9188C34C234A4C47306FA73AAF0583();                                                                  // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.OnCancelled_8FC7071F40FA26EA05D9688FB3E623A0
	// void OnCancelled_8FC7071F40FA26EA05D9688FB3E623A0();                                                                  // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.OnInterrupted_8FC7071F40FA26EA05D9688FB3E623A0
	// void OnInterrupted_8FC7071F40FA26EA05D9688FB3E623A0();                                                                // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.OnBlendOut_8FC7071F40FA26EA05D9688FB3E623A0
	// void OnBlendOut_8FC7071F40FA26EA05D9688FB3E623A0();                                                                   // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.OnCompleted_8FC7071F40FA26EA05D9688FB3E623A0
	// void OnCompleted_8FC7071F40FA26EA05D9688FB3E623A0();                                                                  // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.OnCancelled_07DF210D46EDFA929CDBFFB162E8E4CF
	// void OnCancelled_07DF210D46EDFA929CDBFFB162E8E4CF();                                                                  // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.OnInterrupted_07DF210D46EDFA929CDBFFB162E8E4CF
	// void OnInterrupted_07DF210D46EDFA929CDBFFB162E8E4CF();                                                                // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.OnBlendOut_07DF210D46EDFA929CDBFFB162E8E4CF
	// void OnBlendOut_07DF210D46EDFA929CDBFFB162E8E4CF();                                                                   // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.OnCompleted_07DF210D46EDFA929CDBFFB162E8E4CF
	// void OnCompleted_07DF210D46EDFA929CDBFFB162E8E4CF();                                                                  // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.OnReachedJumpApex
	// void OnReachedJumpApex();                                                                                             // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.SetupMontageSectionsAndOrientDirection
	// void SetupMontageSectionsAndOrientDirection();                                                                        // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.OnPawnLanded
	// void OnPawnLanded(FHitResult& Hit);                                                                                   // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.OnHitPawn
	// void OnHitPawn(class AActor* SelfActor, class AActor* OtherActor, FVector NormalImpulse, FHitResult& Hit);            // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.MovementModeChangedDelegate_Event
	// void MovementModeChangedDelegate_Event(class ACharacter* Character, TEnumAsByte<EMovementMode> PrevMovementMode, char PreviousCustomMode); // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.BindMovementModeChange
	// void BindMovementModeChange();                                                                                        // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.UnbindMovementModeChange
	// void UnbindMovementModeChange();                                                                                      // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.K2_ActivateAbilityFromEvent
	// void K2_ActivateAbilityFromEvent(FGameplayEventData& EventData);                                                      // [0x130d900] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.K2_OnEndAbility
	// void K2_OnEndAbility(bool bWasCancelled);                                                                             // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.DebugLine
	// void DebugLine();                                                                                                     // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C.ExecuteUbergraph_GAB_GenericApplyKnockback
	// void ExecuteUbergraph_GAB_GenericApplyKnockback(int32_t EntryPoint);                                                  // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/Weapons/Ranged/GE_Damage_Explosive_LineOfSight.GE_Damage_Explosive_LineOfSight_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_Damage_Explosive_LineOfSight_C : public UGE_Ranged_GenericDamage_Explosive_C
{ 
public:
};

/// Class /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_PetOtherPet.GA_DefaultPlayer_PetOtherPet_C
/// Size: 0x0008 (0x000B60 - 0x000B68)
class UGA_DefaultPlayer_PetOtherPet_C : public UFortGameplayAbility
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0B60   (0x0008)  


	/// Functions
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_PetOtherPet.GA_DefaultPlayer_PetOtherPet_C.OnCancelled_FB7AFE5D4FF547CAEB1ECA8264EE1330
	// void OnCancelled_FB7AFE5D4FF547CAEB1ECA8264EE1330();                                                                  // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_PetOtherPet.GA_DefaultPlayer_PetOtherPet_C.OnInterrupted_FB7AFE5D4FF547CAEB1ECA8264EE1330
	// void OnInterrupted_FB7AFE5D4FF547CAEB1ECA8264EE1330();                                                                // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_PetOtherPet.GA_DefaultPlayer_PetOtherPet_C.OnBlendOut_FB7AFE5D4FF547CAEB1ECA8264EE1330
	// void OnBlendOut_FB7AFE5D4FF547CAEB1ECA8264EE1330();                                                                   // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_PetOtherPet.GA_DefaultPlayer_PetOtherPet_C.OnCompleted_FB7AFE5D4FF547CAEB1ECA8264EE1330
	// void OnCompleted_FB7AFE5D4FF547CAEB1ECA8264EE1330();                                                                  // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_PetOtherPet.GA_DefaultPlayer_PetOtherPet_C.K2_ActivateAbility
	// void K2_ActivateAbility();                                                                                            // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_PetOtherPet.GA_DefaultPlayer_PetOtherPet_C.ExecuteUbergraph_GA_DefaultPlayer_PetOtherPet
	// void ExecuteUbergraph_GA_DefaultPlayer_PetOtherPet(int32_t EntryPoint);                                               // [0x130d900] Final                
};

/// Class /Game/Abilities/Player/Commando/Actives/FragGrenade/B_GrenadeCameraShake.B_GrenadeCameraShake_C
/// Size: 0x0000 (0x0001F0 - 0x0001F0)
class UB_GrenadeCameraShake_C : public ULegacyCameraShake
{ 
public:
};

/// Class /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractUse.GA_DefaultPlayer_InteractUse_C
/// Size: 0x0008 (0x000B60 - 0x000B68)
class UGA_DefaultPlayer_InteractUse_C : public UFortGameplayAbility
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0B60   (0x0008)  


	/// Functions
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractUse.GA_DefaultPlayer_InteractUse_C.OnCancelled_A513E1E044E129CC612DF5A23589BC9C
	// void OnCancelled_A513E1E044E129CC612DF5A23589BC9C();                                                                  // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractUse.GA_DefaultPlayer_InteractUse_C.OnInterrupted_A513E1E044E129CC612DF5A23589BC9C
	// void OnInterrupted_A513E1E044E129CC612DF5A23589BC9C();                                                                // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractUse.GA_DefaultPlayer_InteractUse_C.OnBlendOut_A513E1E044E129CC612DF5A23589BC9C
	// void OnBlendOut_A513E1E044E129CC612DF5A23589BC9C();                                                                   // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractUse.GA_DefaultPlayer_InteractUse_C.OnCompleted_A513E1E044E129CC612DF5A23589BC9C
	// void OnCompleted_A513E1E044E129CC612DF5A23589BC9C();                                                                  // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractUse.GA_DefaultPlayer_InteractUse_C.K2_ActivateAbility
	// void K2_ActivateAbility();                                                                                            // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractUse.GA_DefaultPlayer_InteractUse_C.ExecuteUbergraph_GA_DefaultPlayer_InteractUse
	// void ExecuteUbergraph_GA_DefaultPlayer_InteractUse(int32_t EntryPoint);                                               // [0x130d900] Final                
};

/// Class /Game/Abilities/Player/Sliding/CamShake_Athena_Player_Slide.CamShake_Athena_Player_Slide_C
/// Size: 0x0000 (0x0001F0 - 0x0001F0)
class UCamShake_Athena_Player_Slide_C : public ULegacyCameraShake
{ 
public:
};

/// Class /Game/Abilities/Player/Parents/GAT_ActiveAbility.GAT_ActiveAbility_C
/// Size: 0x0028 (0x000B60 - 0x000B88)
class UGAT_ActiveAbility_C : public UFortGameplayAbility
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0B60   (0x0008)  
	FGameplayTag                                       TC_AbilitiesGenericActiveAbilityActivate;                   // 0x0B68   (0x0004)  
	FName                                              N_SavedCollisionChannel;                                    // 0x0B6C   (0x0004)  
	class UClass*                                      GE_KnockBackImmunity;                                       // 0x0B70   (0x0008)  
	FActiveGameplayEffectHandle                        GEH_KnockBackImmunity;                                      // 0x0B78   (0x0008)  
	bool                                               bPlayerHolsterState;                                        // 0x0B80   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0B81   (0x0003)  MISSED
	FGameplayTag                                       TC_AbilitiesGenericActiveAbilityEndAbility;                 // 0x0B84   (0x0004)  


	/// Functions
	// Function /Game/Abilities/Player/Parents/GAT_ActiveAbility.GAT_ActiveAbility_C.EndAbilityWithReason
	// void EndAbilityWithReason(FString Reason);                                                                            // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Parents/GAT_ActiveAbility.GAT_ActiveAbility_C.SendHeroAbilityActivationEvent
	// void SendHeroAbilityActivationEvent();                                                                                // [0x130d900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Parents/GAT_ActiveAbility.GAT_ActiveAbility_C.SetHolsterWeaponWithName
	// void SetHolsterWeaponWithName(class AFortPawn* Target Fort Pawn, bool ShouldHolster, bool PlayEquipAnim, bool ShowDebugPrintName, bool& IsWeaponHolstered, bool& OperationSuccessful); // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Parents/GAT_ActiveAbility.GAT_ActiveAbility_C.K2_ShouldAbilityRespondToEvent
	// bool K2_ShouldAbilityRespondToEvent(FGameplayAbilityActorInfo ActorInfo, FGameplayEventData Payload);                 // [0x130d900] Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/Abilities/Player/Parents/GAT_ActiveAbility.GAT_ActiveAbility_C.ActiveAbilitySetup
	// void ActiveAbilitySetup(class UAbilitySystemComponent* AbilitySystemIn, class UAbilitySystemComponent*& AbilitySystemOut); // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Parents/GAT_ActiveAbility.GAT_ActiveAbility_C.SetKnockbackImmunity
	// void SetKnockbackImmunity(bool ImmunityOn);                                                                           // [0x130d900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Parents/GAT_ActiveAbility.GAT_ActiveAbility_C.SetPawnCollision
	// void SetPawnCollision(class AFortPawn* FortPawn, bool CollisionOn);                                                   // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Parents/GAT_ActiveAbility.GAT_ActiveAbility_C.K2_ActivateAbility
	// void K2_ActivateAbility();                                                                                            // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Player/Parents/GAT_ActiveAbility.GAT_ActiveAbility_C.K2_OnEndAbility
	// void K2_OnEndAbility(bool bWasCancelled);                                                                             // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Player/Parents/GAT_ActiveAbility.GAT_ActiveAbility_C.ExecuteUbergraph_GAT_ActiveAbility
	// void ExecuteUbergraph_GAT_ActiveAbility(int32_t EntryPoint);                                                          // [0x130d900] Final                
};

/// Class /Game/Abilities/Player/Parents/GAT_ActiveAbility_Hero.GAT_ActiveAbility_Hero_C
/// Size: 0x0030 (0x000B88 - 0x000BB8)
class UGAT_ActiveAbility_Hero_C : public UGAT_ActiveAbility_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0B88   (0x0008)  
	bool                                               UseHeroLoadoutSystem;                                       // 0x0B90   (0x0001)  
	bool                                               bUseMidAbilityCosts;                                        // 0x0B91   (0x0001)  
	bool                                               bTriggerCooldownOnAbilityEnd;                               // 0x0B92   (0x0001)  
	unsigned char                                      UnknownData00_5[0x5];                                       // 0x0B93   (0x0005)  MISSED
	class UAbilitySystemComponent*                     Owner_ASC;                                                  // 0x0B98   (0x0008)  
	class UClass*                                      GE_CooldownModifier;                                        // 0x0BA0   (0x0008)  
	TArray<FActiveGameplayEffectHandle>                Active_Cooldown_Modifiers;                                  // 0x0BA8   (0x0010)  


	/// Functions
	// Function /Game/Abilities/Player/Parents/GAT_ActiveAbility_Hero.GAT_ActiveAbility_Hero_C.IncrementAbilityCostAndCooldown
	// void IncrementAbilityCostAndCooldown(double Energy Cost, bool Adjust Cooldown, double Cooldown Increment, TArray<FActiveGameplayEffectHandle>& Active Cooldown Modifiers); // [0x130d900] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Parents/GAT_ActiveAbility_Hero.GAT_ActiveAbility_Hero_C.CommitAbilityWithEvent
	// void CommitAbilityWithEvent(bool& Passed);                                                                            // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Parents/GAT_ActiveAbility_Hero.GAT_ActiveAbility_Hero_C.K2_ActivateAbility
	// void K2_ActivateAbility();                                                                                            // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Player/Parents/GAT_ActiveAbility_Hero.GAT_ActiveAbility_Hero_C.K2_OnEndAbility
	// void K2_OnEndAbility(bool bWasCancelled);                                                                             // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Player/Parents/GAT_ActiveAbility_Hero.GAT_ActiveAbility_Hero_C.ExecuteUbergraph_GAT_ActiveAbility_Hero
	// void ExecuteUbergraph_GAT_ActiveAbility_Hero(int32_t EntryPoint);                                                     // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/NPC/Generic/GAB_CarryPlayer.GAB_CarryPlayer_C
/// Size: 0x0034 (0x000B90 - 0x000BC4)
class UGAB_CarryPlayer_C : public UFortGameplayAbility_CarryPlayer
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0B90   (0x0008)  
	class AFortPlayerPawn*                             PlayerPawn;                                                 // 0x0B98   (0x0008)  
	FName                                              DBNOCarryHolster;                                           // 0x0BA0   (0x0004)  
	bool                                               bCompletedPickup;                                           // 0x0BA4   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0BA5   (0x0003)  MISSED
	FVector                                            PickupLocation;                                             // 0x0BA8   (0x0018)  
	int32_t                                            CarryLongDistanceThreshold;                                 // 0x0BC0   (0x0004)  


	/// Functions
	// Function /Game/Abilities/NPC/Generic/GAB_CarryPlayer.GAB_CarryPlayer_C.OnCancelled_C4440F1640E9A8D79E44FD8C23525824
	// void OnCancelled_C4440F1640E9A8D79E44FD8C23525824();                                                                  // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_CarryPlayer.GAB_CarryPlayer_C.OnInterrupted_C4440F1640E9A8D79E44FD8C23525824
	// void OnInterrupted_C4440F1640E9A8D79E44FD8C23525824();                                                                // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_CarryPlayer.GAB_CarryPlayer_C.OnBlendOut_C4440F1640E9A8D79E44FD8C23525824
	// void OnBlendOut_C4440F1640E9A8D79E44FD8C23525824();                                                                   // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_CarryPlayer.GAB_CarryPlayer_C.OnCompleted_C4440F1640E9A8D79E44FD8C23525824
	// void OnCompleted_C4440F1640E9A8D79E44FD8C23525824();                                                                  // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_CarryPlayer.GAB_CarryPlayer_C.K2_ActivateAbility
	// void K2_ActivateAbility();                                                                                            // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_CarryPlayer.GAB_CarryPlayer_C.K2_OnEndAbility
	// void K2_OnEndAbility(bool bWasCancelled);                                                                             // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_CarryPlayer.GAB_CarryPlayer_C.OnFortPlayerHitByVehicle_Event
	// void OnFortPlayerHitByVehicle_Event(class AFortAthenaVehicle* InstigatingVehicle);                                    // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_CarryPlayer.GAB_CarryPlayer_C.ExecuteUbergraph_GAB_CarryPlayer
	// void ExecuteUbergraph_GAB_CarryPlayer(int32_t EntryPoint);                                                            // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/NPC/Generic/GAB_DropPlayer.GAB_DropPlayer_C
/// Size: 0x0010 (0x000B90 - 0x000BA0)
class UGAB_DropPlayer_C : public UFortGameplayAbility_CarryPlayer
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0B90   (0x0008)  
	class AFortPlayerPawn*                             PlayerPawn;                                                 // 0x0B98   (0x0008)  


	/// Functions
	// Function /Game/Abilities/NPC/Generic/GAB_DropPlayer.GAB_DropPlayer_C.Completed_89F288114D44792D5568298354B7216C
	// void Completed_89F288114D44792D5568298354B7216C(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_DropPlayer.GAB_DropPlayer_C.Cancelled_89F288114D44792D5568298354B7216C
	// void Cancelled_89F288114D44792D5568298354B7216C(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_DropPlayer.GAB_DropPlayer_C.Triggered_89F288114D44792D5568298354B7216C
	// void Triggered_89F288114D44792D5568298354B7216C(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_DropPlayer.GAB_DropPlayer_C.K2_ActivateAbility
	// void K2_ActivateAbility();                                                                                            // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_DropPlayer.GAB_DropPlayer_C.K2_OnEndAbility
	// void K2_OnEndAbility(bool bWasCancelled);                                                                             // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_DropPlayer.GAB_DropPlayer_C.ExecuteUbergraph_GAB_DropPlayer
	// void ExecuteUbergraph_GAB_DropPlayer(int32_t EntryPoint);                                                             // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/Player/Parents/GAT_CommandoActiveAbility.GAT_CommandoActiveAbility_C
/// Size: 0x00C2 (0x000BB8 - 0x000C7A)
class UGAT_CommandoActiveAbility_C : public UGAT_ActiveAbility_Hero_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0BB8   (0x0008)  
	FGameplayEventData                                 Event_Data;                                                 // 0x0BC0   (0x00B0)  
	class AFortPawn*                                   CommandoPlayerPawn;                                         // 0x0C70   (0x0008)  
	bool                                               isAutoCommitted;                                            // 0x0C78   (0x0001)  
	bool                                               isStaminaLockedOut;                                         // 0x0C79   (0x0001)  


	/// Functions
	// Function /Game/Abilities/Player/Parents/GAT_CommandoActiveAbility.GAT_CommandoActiveAbility_C.K2_ActivateAbility
	// void K2_ActivateAbility();                                                                                            // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Player/Parents/GAT_CommandoActiveAbility.GAT_CommandoActiveAbility_C.ExecuteUbergraph_GAT_CommandoActiveAbility
	// void ExecuteUbergraph_GAT_CommandoActiveAbility(int32_t EntryPoint);                                                  // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/NPC/Generic/GAB_ThrowPlayer.GAB_ThrowPlayer_C
/// Size: 0x0010 (0x000B90 - 0x000BA0)
class UGAB_ThrowPlayer_C : public UFortGameplayAbility_CarryPlayer
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0B90   (0x0008)  
	class AFortPlayerPawn*                             PlayerPawn;                                                 // 0x0B98   (0x0008)  


	/// Functions
	// Function /Game/Abilities/NPC/Generic/GAB_ThrowPlayer.GAB_ThrowPlayer_C.Completed_45B7744E4902B26207BAA1954E6BCDEE
	// void Completed_45B7744E4902B26207BAA1954E6BCDEE(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_ThrowPlayer.GAB_ThrowPlayer_C.Cancelled_45B7744E4902B26207BAA1954E6BCDEE
	// void Cancelled_45B7744E4902B26207BAA1954E6BCDEE(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_ThrowPlayer.GAB_ThrowPlayer_C.Triggered_45B7744E4902B26207BAA1954E6BCDEE
	// void Triggered_45B7744E4902B26207BAA1954E6BCDEE(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_ThrowPlayer.GAB_ThrowPlayer_C.K2_ActivateAbility
	// void K2_ActivateAbility();                                                                                            // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_ThrowPlayer.GAB_ThrowPlayer_C.K2_OnEndAbility
	// void K2_OnEndAbility(bool bWasCancelled);                                                                             // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_ThrowPlayer.GAB_ThrowPlayer_C.ExecuteUbergraph_GAB_ThrowPlayer
	// void ExecuteUbergraph_GAB_ThrowPlayer(int32_t EntryPoint);                                                            // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/Player/Commando/Actives/FragGrenade/AOE_Commando_KeepOutExplosion.AOE_Commando_KeepOutExplosion_C
/// Size: 0x0400 (0x0006D8 - 0x000AD8)
class AAOE_Commando_KeepOutExplosion_C : public AFortAreaOfEffectCloud
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x06D8   (0x0008)  
	class UAudioComponent*                             AOE_Audio_Effect;                                           // 0x06E0   (0x0008)  
	class UParticleSystemComponent*                    P_Grenade_Linger;                                           // 0x06E8   (0x0008)  
	class USphereComponent*                            DamageArea;                                                 // 0x06F0   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x06F8   (0x0008)  
	double                                             Radius;                                                     // 0x0700   (0x0008)  
	FSoundAttenuationSettings                          AOE_Sound_Attenuation_Based_On_Radius;                      // 0x0708   (0x03D0)  


	/// Functions
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/AOE_Commando_KeepOutExplosion.AOE_Commando_KeepOutExplosion_C.OnRep_Radius
	// void OnRep_Radius();                                                                                                  // [0x130d900] HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/AOE_Commando_KeepOutExplosion.AOE_Commando_KeepOutExplosion_C.Send_Info
	// void Send_Info(double Radius);                                                                                        // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/AOE_Commando_KeepOutExplosion.AOE_Commando_KeepOutExplosion_C.ReceiveDestroyed
	// void ReceiveDestroyed();                                                                                              // [0x130d900] Event|Public|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/AOE_Commando_KeepOutExplosion.AOE_Commando_KeepOutExplosion_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/AOE_Commando_KeepOutExplosion.AOE_Commando_KeepOutExplosion_C.ExecuteUbergraph_AOE_Commando_KeepOutExplosion
	// void ExecuteUbergraph_AOE_Commando_KeepOutExplosion(int32_t EntryPoint);                                              // [0x130d900] Final                
};

/// Class /Game/Abilities/Player/Commando/Actives/FragGrenade/GE_Commando_FragGrenadeCooldown.GE_Commando_FragGrenadeCooldown_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_Commando_FragGrenadeCooldown_C : public UGET_Cooldown_Hero_Active_C
{ 
public:
};

/// Class /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractSearch.GA_DefaultPlayer_InteractSearch_C
/// Size: 0x01E8 (0x000B60 - 0x000D48)
class UGA_DefaultPlayer_InteractSearch_C : public UFortGameplayAbility
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0B60   (0x0008)  
	class AFortPlayerPawn*                             PlayerPawn;                                                 // 0x0B68   (0x0008)  
	FGameplayTag                                       RefillGasTankTag;                                           // 0x0B70   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0B74   (0x0004)  MISSED
	FFortGameplayAbilityMontageInfo                    RefillGasTankMontage;                                       // 0x0B78   (0x0058)  
	FGameplayTag                                       CatchFireflyTag;                                            // 0x0BD0   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0BD4   (0x0004)  MISSED
	FFortGameplayAbilityMontageInfo                    FireflyCatchMontage;                                        // 0x0BD8   (0x0058)  
	FFortGameplayAbilityMontageInfo                    RefillVehicleFuelMontage;                                   // 0x0C30   (0x0058)  
	FGameplayTag                                       GasCanRefillVehicleTag;                                     // 0x0C88   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x0C8C   (0x0004)  MISSED
	FFortGameplayAbilityMontageInfo                    DBNOMontageInfo;                                            // 0x0C90   (0x0058)  
	FGameplayTag                                       Tag_UseOverrideSearchMontage;                               // 0x0CE8   (0x0004)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x0CEC   (0x0004)  MISSED
	FFortGameplayAbilityMontageInfo                    OverrideSearchMontageInfo;                                  // 0x0CF0   (0x0058)  


	/// Functions
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractSearch.GA_DefaultPlayer_InteractSearch_C.EndInteractSearch
	// void EndInteractSearch();                                                                                             // [0x130d900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractSearch.GA_DefaultPlayer_InteractSearch_C.StartInteractSearch
	// void StartInteractSearch();                                                                                           // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractSearch.GA_DefaultPlayer_InteractSearch_C.K2_OnEndAbility
	// void K2_OnEndAbility(bool bWasCancelled);                                                                             // [0x130d900] Event|Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractSearch.GA_DefaultPlayer_InteractSearch_C.Completed_B697D9B445CA2BFDB1328D93C33FBCF3
	// void Completed_B697D9B445CA2BFDB1328D93C33FBCF3(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractSearch.GA_DefaultPlayer_InteractSearch_C.Cancelled_B697D9B445CA2BFDB1328D93C33FBCF3
	// void Cancelled_B697D9B445CA2BFDB1328D93C33FBCF3(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractSearch.GA_DefaultPlayer_InteractSearch_C.Triggered_B697D9B445CA2BFDB1328D93C33FBCF3
	// void Triggered_B697D9B445CA2BFDB1328D93C33FBCF3(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractSearch.GA_DefaultPlayer_InteractSearch_C.Completed_72217B3542CE776DEDDBB3A7B5D6D343
	// void Completed_72217B3542CE776DEDDBB3A7B5D6D343(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractSearch.GA_DefaultPlayer_InteractSearch_C.Cancelled_72217B3542CE776DEDDBB3A7B5D6D343
	// void Cancelled_72217B3542CE776DEDDBB3A7B5D6D343(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractSearch.GA_DefaultPlayer_InteractSearch_C.Triggered_72217B3542CE776DEDDBB3A7B5D6D343
	// void Triggered_72217B3542CE776DEDDBB3A7B5D6D343(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractSearch.GA_DefaultPlayer_InteractSearch_C.Completed_6A38D93A428260E68695388965BFA176
	// void Completed_6A38D93A428260E68695388965BFA176(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractSearch.GA_DefaultPlayer_InteractSearch_C.Cancelled_6A38D93A428260E68695388965BFA176
	// void Cancelled_6A38D93A428260E68695388965BFA176(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractSearch.GA_DefaultPlayer_InteractSearch_C.Triggered_6A38D93A428260E68695388965BFA176
	// void Triggered_6A38D93A428260E68695388965BFA176(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractSearch.GA_DefaultPlayer_InteractSearch_C.Completed_5EB1B64344DD00ABFE41E2857DC3FB38
	// void Completed_5EB1B64344DD00ABFE41E2857DC3FB38(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractSearch.GA_DefaultPlayer_InteractSearch_C.Cancelled_5EB1B64344DD00ABFE41E2857DC3FB38
	// void Cancelled_5EB1B64344DD00ABFE41E2857DC3FB38(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractSearch.GA_DefaultPlayer_InteractSearch_C.Triggered_5EB1B64344DD00ABFE41E2857DC3FB38
	// void Triggered_5EB1B64344DD00ABFE41E2857DC3FB38(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractSearch.GA_DefaultPlayer_InteractSearch_C.Completed_3E01853F4E8362C959E7B4B82217702E
	// void Completed_3E01853F4E8362C959E7B4B82217702E(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractSearch.GA_DefaultPlayer_InteractSearch_C.Cancelled_3E01853F4E8362C959E7B4B82217702E
	// void Cancelled_3E01853F4E8362C959E7B4B82217702E(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractSearch.GA_DefaultPlayer_InteractSearch_C.Triggered_3E01853F4E8362C959E7B4B82217702E
	// void Triggered_3E01853F4E8362C959E7B4B82217702E(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractSearch.GA_DefaultPlayer_InteractSearch_C.Completed_64A40E14483311B0BA6F95B516CA6468
	// void Completed_64A40E14483311B0BA6F95B516CA6468(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractSearch.GA_DefaultPlayer_InteractSearch_C.Cancelled_64A40E14483311B0BA6F95B516CA6468
	// void Cancelled_64A40E14483311B0BA6F95B516CA6468(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractSearch.GA_DefaultPlayer_InteractSearch_C.Triggered_64A40E14483311B0BA6F95B516CA6468
	// void Triggered_64A40E14483311B0BA6F95B516CA6468(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractSearch.GA_DefaultPlayer_InteractSearch_C.K2_ActivateAbility
	// void K2_ActivateAbility();                                                                                            // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractSearch.GA_DefaultPlayer_InteractSearch_C.ExecuteUbergraph_GA_DefaultPlayer_InteractSearch
	// void ExecuteUbergraph_GA_DefaultPlayer_InteractSearch(int32_t EntryPoint);                                            // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractReboot.GA_DefaultPlayer_InteractReboot_C
/// Size: 0x0000 (0x000D48 - 0x000D48)
class UGA_DefaultPlayer_InteractReboot_C : public UGA_DefaultPlayer_InteractSearch_C
{ 
public:


	/// Functions
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractReboot.GA_DefaultPlayer_InteractReboot_C.StartInteractSearch
	// void StartInteractSearch();                                                                                           // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractDBNO.GA_DefaultPlayer_InteractDBNO_C
/// Size: 0x0000 (0x000D48 - 0x000D48)
class UGA_DefaultPlayer_InteractDBNO_C : public UGA_DefaultPlayer_InteractSearch_C
{ 
public:


	/// Functions
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_InteractDBNO.GA_DefaultPlayer_InteractDBNO_C.StartInteractSearch
	// void StartInteractSearch();                                                                                           // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Abilities/Player/Interrogation/GE_Interrogation_Voice_PickedUp.GE_Interrogation_Voice_PickedUp_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_Interrogation_Voice_PickedUp_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C
/// Size: 0x0480 (0x000B60 - 0x000FE0)
class UGAB_InterrogatePlayer_Reveal_C : public UFortGameplayAbility
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0B60   (0x0008)  
	class AFortPlayerPawn*                             PlayerPawn;                                                 // 0x0B68   (0x0008)  
	class AFortPlayerControllerAthena*                 PlayerController;                                           // 0x0B70   (0x0008)  
	class AFortPlayerPawn*                             InterrogatedPlayer;                                         // 0x0B78   (0x0008)  
	class UAnimMontage*                                Anim_Reveal;                                                // 0x0B80   (0x0008)  
	class UAnimMontage*                                Anim_End;                                                   // 0x0B88   (0x0008)  
	FName                                              RevealHolster;                                              // 0x0B90   (0x0004)  
	FGameplayTag                                       GC_Reveal;                                                  // 0x0B94   (0x0004)  
	FScalableFloat                                     MarkDurationPlayer;                                         // 0x0B98   (0x0028)  
	FScalableFloat                                     MarkDurationNPC;                                            // 0x0BC0   (0x0028)  
	FScalableFloat                                     MarkRadius;                                                 // 0x0BE8   (0x0028)  
	TArray<class AActor*>                              SquadmatesToMark;                                           // 0x0C10   (0x0010)  
	FTimerHandle                                       Timer_Reveal;                                               // 0x0C20   (0x0008)  
	FGameplayTag                                       T_NPC;                                                      // 0x0C28   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0C2C   (0x0004)  MISSED
	double                                             RevealDuration;                                             // 0x0C30   (0x0008)  
	double                                             EndAbilityDelay;                                            // 0x0C38   (0x0008)  
	double                                             SweepDelay;                                                 // 0x0C40   (0x0008)  
	bool                                               Cancelled;                                                  // 0x0C48   (0x0001)  
	bool                                               Ending;                                                     // 0x0C49   (0x0001)  
	unsigned char                                      UnknownData01_5[0x6];                                       // 0x0C4A   (0x0006)  MISSED
	SDK_UNDEFINED(16,11252) /* FString */              __um(IndicatorGroup);                                       // 0x0C50   (0x0010)  
	class UClass*                                      CameraMode;                                                 // 0x0C60   (0x0008)  
	TArray<class AActor*>                              ActorsToMark;                                               // 0x0C68   (0x0010)  
	FGameplayTagContainer                              T_ReticleHUD;                                               // 0x0C78   (0x0020)  
	FGameplayTagContainer                              NPCTagsToMark;                                              // 0x0C98   (0x0020)  
	FGameplayTagContainer                              ChestTagsToMark;                                            // 0x0CB8   (0x0020)  
	FGameplayTagContainer                              GameplayItemTagsToMark;                                     // 0x0CD8   (0x0020)  
	FName                                              ParticleSystemParamName;                                    // 0x0CF8   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x0CFC   (0x0004)  MISSED
	class UParticleSystem*                             IndicatedPS;                                                // 0x0D00   (0x0008)  
	class USoundBase*                                  IndicatedSound;                                             // 0x0D08   (0x0008)  
	FVector                                            PSOffset;                                                   // 0x0D10   (0x0018)  
	FName                                              PSVectorParamName;                                          // 0x0D28   (0x0004)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x0D2C   (0x0004)  MISSED
	FVector                                            PSDBNOOffset;                                               // 0x0D30   (0x0018)  
	FName                                              EnemyStencilName;                                           // 0x0D48   (0x0004)  
	FName                                              TreasureChestStencilName;                                   // 0x0D4C   (0x0004)  
	double                                             StepTime;                                                   // 0x0D50   (0x0008)  
	bool                                               testbool;                                                   // 0x0D58   (0x0001)  
	unsigned char                                      UnknownData04_5[0x7];                                       // 0x0D59   (0x0007)  MISSED
	FScalableFloat                                     EnemyStencilID;                                             // 0x0D60   (0x0028)  
	FScalableFloat                                     StencilStepTime;                                            // 0x0D88   (0x0028)  
	FScalableFloat                                     bUseDefaultStencil;                                         // 0x0DB0   (0x0028)  
	FScalableFloat                                     IndicatorStepTime;                                          // 0x0DD8   (0x0028)  
	FGameplayTagQuery                                  NPCGameplayTagQuery;                                        // 0x0E00   (0x0048)  
	FIndicatedActorData                                IndicatedActorDataPlayers;                                  // 0x0E48   (0x00F8)  
	FStenciledActorData                                StenciledActorDataPlayers;                                  // 0x0F40   (0x0080)  
	FGameplayTagContainer                              T_QuestTagContainer;                                        // 0x0FC0   (0x0020)  


	/// Functions
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.GetTeamMembers
	// TArray<AFortPlayerStateAthena*> GetTeamMembers(class APawn* Target, bool bIncludeSelf);                               // [0x130d900] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.GAB_InterrogatePlayer_Reveal_AutoGenFunc
	// void GAB_InterrogatePlayer_Reveal_AutoGenFunc(class AActor* IndicatedActor);                                          // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.ToggleReticleVisibility
	// void ToggleReticleVisibility(bool Hide);                                                                              // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.Reveal
	// void Reveal();                                                                                                        // [0x130d900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.EndAbilityCleanup
	// void EndAbilityCleanup();                                                                                             // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.InitAbility
	// void InitAbility();                                                                                                   // [0x130d900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.Completed_23F3C2DB411862D627ACFCA8233F7B33
	// void Completed_23F3C2DB411862D627ACFCA8233F7B33(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.Cancelled_23F3C2DB411862D627ACFCA8233F7B33
	// void Cancelled_23F3C2DB411862D627ACFCA8233F7B33(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.Triggered_23F3C2DB411862D627ACFCA8233F7B33
	// void Triggered_23F3C2DB411862D627ACFCA8233F7B33(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.Completed_3C2C8C224B62B00BDEEAF5AF38A401C1
	// void Completed_3C2C8C224B62B00BDEEAF5AF38A401C1(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.Cancelled_3C2C8C224B62B00BDEEAF5AF38A401C1
	// void Cancelled_3C2C8C224B62B00BDEEAF5AF38A401C1(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.Triggered_3C2C8C224B62B00BDEEAF5AF38A401C1
	// void Triggered_3C2C8C224B62B00BDEEAF5AF38A401C1(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.OnFinish_68B3C6D14B44CCD3170ABDA038C1203E
	// void OnFinish_68B3C6D14B44CCD3170ABDA038C1203E();                                                                     // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.K2_OnEndAbility
	// void K2_OnEndAbility(bool bWasCancelled);                                                                             // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.OnDied_Event
	// void OnDied_Event(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, FVector HitLocation, class UPrimitiveComponent* FHitComponent, FName BoneName, FVector Momentum); // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.EndInterrogation
	// void EndInterrogation();                                                                                              // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.K2_ActivateAbilityFromEvent
	// void K2_ActivateAbilityFromEvent(FGameplayEventData& EventData);                                                      // [0x130d900] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Reveal.GAB_InterrogatePlayer_Reveal_C.ExecuteUbergraph_GAB_InterrogatePlayer_Reveal
	// void ExecuteUbergraph_GAB_InterrogatePlayer_Reveal(int32_t EntryPoint);                                               // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Search.GAB_InterrogatePlayer_Search_C
/// Size: 0x0118 (0x000B90 - 0x000CA8)
class UGAB_InterrogatePlayer_Search_C : public UFortGameplayAbility_CarryPlayer
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0B90   (0x0008)  
	class AFortPlayerPawn*                             PlayerPawn;                                                 // 0x0B98   (0x0008)  
	class AFortPlayerControllerAthena*                 PlayerController;                                           // 0x0BA0   (0x0008)  
	class AFortPlayerPawn*                             InterrogatedPlayer;                                         // 0x0BA8   (0x0008)  
	class UAnimMontage*                                Anim_Search;                                                // 0x0BB0   (0x0008)  
	FName                                              InterrogateHolster;                                         // 0x0BB8   (0x0004)  
	FName                                              LootTierGroupName;                                          // 0x0BBC   (0x0004)  
	class UFortWorldItemDefinition*                    ItemDefinition;                                             // 0x0BC0   (0x0008)  
	int32_t                                            NumberToSpawn;                                              // 0x0BC8   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0BCC   (0x0004)  MISSED
	FVector                                            LootSpawnOffset;                                            // 0x0BD0   (0x0018)  
	FScalableFloat                                     MaxDropsInstance;                                           // 0x0BE8   (0x0028)  
	int32_t                                            NumDropsInstance;                                           // 0x0C10   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0C14   (0x0004)  MISSED
	FScalableFloat                                     KeycardDropBias;                                            // 0x0C18   (0x0028)  
	TArray<class UFortWorldItemDefinition*>            KeycardItemDefinitions;                                     // 0x0C40   (0x0010)  
	FGameplayTag                                       T_Keycard_Yacht;                                            // 0x0C50   (0x0004)  
	FGameplayTag                                       T_Keycard_OilRig;                                           // 0x0C54   (0x0004)  
	FGameplayTag                                       T_Keycard_SharkIsland;                                      // 0x0C58   (0x0004)  
	FGameplayTag                                       T_Keycard_HQ;                                               // 0x0C5C   (0x0004)  
	FGameplayTag                                       T_Keycard_MountainBase;                                     // 0x0C60   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x0C64   (0x0004)  MISSED
	FTimerHandle                                       Timer_Interrogation;                                        // 0x0C68   (0x0008)  
	FGameplayTagContainer                              T_ReticleHUD;                                               // 0x0C70   (0x0020)  
	FGameplayTag                                       T_NPC;                                                      // 0x0C90   (0x0004)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x0C94   (0x0004)  MISSED
	class UClass*                                      GE_Cooldown;                                                // 0x0C98   (0x0008)  
	class UClass*                                      GE_PickedUp;                                                // 0x0CA0   (0x0008)  


	/// Functions
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Search.GAB_InterrogatePlayer_Search_C.ApplyGameplayEffectToNPC
	// void ApplyGameplayEffectToNPC(class UClass* GameplayEffect);                                                          // [0x130d900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Search.GAB_InterrogatePlayer_Search_C.DropKeycard
	// void DropKeycard();                                                                                                   // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Search.GAB_InterrogatePlayer_Search_C.GetKeycardToDrop
	// void GetKeycardToDrop(bool& HasKeycard, class UFortWorldItemDefinition*& Output);                                     // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Search.GAB_InterrogatePlayer_Search_C.DropLoot
	// void DropLoot();                                                                                                      // [0x130d900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Search.GAB_InterrogatePlayer_Search_C.ToggleReticleVisibility
	// void ToggleReticleVisibility(bool Hide);                                                                              // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Search.GAB_InterrogatePlayer_Search_C.EndAbilityCleanup
	// void EndAbilityCleanup();                                                                                             // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Search.GAB_InterrogatePlayer_Search_C.InitAbility
	// void InitAbility();                                                                                                   // [0x130d900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Search.GAB_InterrogatePlayer_Search_C.Completed_6BBDC9B445D4280492A25E8E5EA7A53D
	// void Completed_6BBDC9B445D4280492A25E8E5EA7A53D(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Search.GAB_InterrogatePlayer_Search_C.Cancelled_6BBDC9B445D4280492A25E8E5EA7A53D
	// void Cancelled_6BBDC9B445D4280492A25E8E5EA7A53D(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Search.GAB_InterrogatePlayer_Search_C.Triggered_6BBDC9B445D4280492A25E8E5EA7A53D
	// void Triggered_6BBDC9B445D4280492A25E8E5EA7A53D(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Search.GAB_InterrogatePlayer_Search_C.Added_9291D75D4A0949E1C5B7E49C1FD11F8B
	// void Added_9291D75D4A0949E1C5B7E49C1FD11F8B();                                                                        // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Search.GAB_InterrogatePlayer_Search_C.OnPress_2000C5AE43E9D757FF188B85CF911E39
	// void OnPress_2000C5AE43E9D757FF188B85CF911E39(float TimeWaited);                                                      // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Search.GAB_InterrogatePlayer_Search_C.K2_OnEndAbility
	// void K2_OnEndAbility(bool bWasCancelled);                                                                             // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Search.GAB_InterrogatePlayer_Search_C.K2_ActivateAbility
	// void K2_ActivateAbility();                                                                                            // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Search.GAB_InterrogatePlayer_Search_C.OnDied_Event
	// void OnDied_Event(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, FVector HitLocation, class UPrimitiveComponent* FHitComponent, FName BoneName, FVector Momentum); // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Search.GAB_InterrogatePlayer_Search_C.OnDied_Event
	// void OnDied_Event(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, FVector HitLocation, class UPrimitiveComponent* FHitComponent, FName BoneName, FVector Momentum); // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Interrogation/GAB_InterrogatePlayer_Search.GAB_InterrogatePlayer_Search_C.ExecuteUbergraph_GAB_InterrogatePlayer_Search
	// void ExecuteUbergraph_GAB_InterrogatePlayer_Search(int32_t EntryPoint);                                               // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/Player/Sliding/GE_Athena_Player_Slide_Cooldown.GE_Athena_Player_Slide_Cooldown_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_Athena_Player_Slide_Cooldown_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Abilities/Player/Sliding/CamShake_Athena_Player_PreSlide.CamShake_Athena_Player_PreSlide_C
/// Size: 0x0000 (0x0001F0 - 0x0001F0)
class UCamShake_Athena_Player_PreSlide_C : public ULegacyCameraShake
{ 
public:
};

/// Class /Game/Abilities/Player/Sliding/GA_Athena_Player_PreSlideFeedback.GA_Athena_Player_PreSlideFeedback_C
/// Size: 0x0018 (0x000B60 - 0x000B78)
class UGA_Athena_Player_PreSlideFeedback_C : public UFortGameplayAbility
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0B60   (0x0008)  
	class UCameraShakeBase*                            CameraShake;                                                // 0x0B68   (0x0008)  
	class AFortWeapon*                                 CurrentWeapon;                                              // 0x0B70   (0x0008)  


	/// Functions
	// Function /Game/Abilities/Player/Sliding/GA_Athena_Player_PreSlideFeedback.GA_Athena_Player_PreSlideFeedback_C.K2_ActivateAbility
	// void K2_ActivateAbility();                                                                                            // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Player/Sliding/GA_Athena_Player_PreSlideFeedback.GA_Athena_Player_PreSlideFeedback_C.K2_OnEndAbility
	// void K2_OnEndAbility(bool bWasCancelled);                                                                             // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Player/Sliding/GA_Athena_Player_PreSlideFeedback.GA_Athena_Player_PreSlideFeedback_C.CustomEvent
	// void CustomEvent();                                                                                                   // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Sliding/GA_Athena_Player_PreSlideFeedback.GA_Athena_Player_PreSlideFeedback_C.FailedToActivatePassiveAbility
	// void FailedToActivatePassiveAbility(FGameplayAbilityActorInfo ActorInfo);                                             // [0x130d900] Event|Public|BlueprintEvent 
	// Function /Game/Abilities/Player/Sliding/GA_Athena_Player_PreSlideFeedback.GA_Athena_Player_PreSlideFeedback_C.OnTargetingChanged
	// void OnTargetingChanged(bool bIsTargeting);                                                                           // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Sliding/GA_Athena_Player_PreSlideFeedback.GA_Athena_Player_PreSlideFeedback_C.ExecuteUbergraph_GA_Athena_Player_PreSlideFeedback
	// void ExecuteUbergraph_GA_Athena_Player_PreSlideFeedback(int32_t EntryPoint);                                          // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/NPC/Generic/GAB_GenericDeath.GAB_GenericDeath_C
/// Size: 0x01DC (0x000B60 - 0x000D3C)
class UGAB_GenericDeath_C : public UFortGameplayAbility
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0B60   (0x0008)  
	class UAnimMontage*                                DeathMontage;                                               // 0x0B68   (0x0008)  
	FName                                              DeathMontageSectionName;                                    // 0x0B70   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0B74   (0x0004)  MISSED
	FVector                                            DeathHitDirection;                                          // 0x0B78   (0x0018)  
	FHitResult                                         DeathHitResult;                                             // 0x0B90   (0x00E8)  
	FGameplayTagContainer                              DamageTags;                                                 // 0x0C78   (0x0020)  
	FGameplayTagContainer                              SpawnDroneTags;                                             // 0x0C98   (0x0020)  
	class UAnimMontage*                                Front;                                                      // 0x0CB8   (0x0008)  
	class UAnimMontage*                                Left;                                                       // 0x0CC0   (0x0008)  
	class UAnimMontage*                                Right;                                                      // 0x0CC8   (0x0008)  
	class UAnimMontage*                                Back;                                                       // 0x0CD0   (0x0008)  
	class UAnimMontage*                                Head_Front;                                                 // 0x0CD8   (0x0008)  
	class UAnimMontage*                                Head_Left;                                                  // 0x0CE0   (0x0008)  
	class UAnimMontage*                                Head_Right;                                                 // 0x0CE8   (0x0008)  
	class UAnimMontage*                                Head_Back;                                                  // 0x0CF0   (0x0008)  
	int32_t                                            FrontSectionNameCount;                                      // 0x0CF8   (0x0004)  
	int32_t                                            LeftSectionNameCount;                                       // 0x0CFC   (0x0004)  
	int32_t                                            RightSectionNameCount;                                      // 0x0D00   (0x0004)  
	int32_t                                            BackSectionNameCount;                                       // 0x0D04   (0x0004)  
	int32_t                                            Head_FrontSectionNameCount;                                 // 0x0D08   (0x0004)  
	int32_t                                            Head_LeftSectionNameCount;                                  // 0x0D0C   (0x0004)  
	int32_t                                            Head_RightSectionNameCount;                                 // 0x0D10   (0x0004)  
	int32_t                                            Head_BackSectionNameCount;                                  // 0x0D14   (0x0004)  
	FName                                              FrontMontageSectionPrefix;                                  // 0x0D18   (0x0004)  
	FName                                              BackMontageSectionPrefix;                                   // 0x0D1C   (0x0004)  
	FName                                              LeftMontageSectionPrefix;                                   // 0x0D20   (0x0004)  
	FName                                              RightMontageSectionPrefix;                                  // 0x0D24   (0x0004)  
	FName                                              HeadFrontMontageSectionPrefix;                              // 0x0D28   (0x0004)  
	FName                                              HeadBackMontageSectionPrefix;                               // 0x0D2C   (0x0004)  
	FName                                              HeadLeftMontageSectionPrefix;                               // 0x0D30   (0x0004)  
	FName                                              HeadRightMontageSectionPrefix;                              // 0x0D34   (0x0004)  
	FGameplayTag                                       TeleportOutCue;                                             // 0x0D38   (0x0004)  


	/// Functions
	// Function /Game/Abilities/NPC/Generic/GAB_GenericDeath.GAB_GenericDeath_C.GetRandomSectionName
	// void GetRandomSectionName(int32_t MaxNumberOfSections, FName OriginalSectionName, FName& SectionName);                // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericDeath.GAB_GenericDeath_C.InitializeDeathHitDirection
	// void InitializeDeathHitDirection(FGameplayEventData EventHitData);                                                    // [0x130d900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericDeath.GAB_GenericDeath_C.OnCancelled_CD8A514040DDA2A4EF94DD913E1B01E4
	// void OnCancelled_CD8A514040DDA2A4EF94DD913E1B01E4();                                                                  // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericDeath.GAB_GenericDeath_C.OnInterrupted_CD8A514040DDA2A4EF94DD913E1B01E4
	// void OnInterrupted_CD8A514040DDA2A4EF94DD913E1B01E4();                                                                // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericDeath.GAB_GenericDeath_C.OnBlendOut_CD8A514040DDA2A4EF94DD913E1B01E4
	// void OnBlendOut_CD8A514040DDA2A4EF94DD913E1B01E4();                                                                   // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericDeath.GAB_GenericDeath_C.OnCompleted_CD8A514040DDA2A4EF94DD913E1B01E4
	// void OnCompleted_CD8A514040DDA2A4EF94DD913E1B01E4();                                                                  // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericDeath.GAB_GenericDeath_C.K2_OnEndAbility
	// void K2_OnEndAbility(bool bWasCancelled);                                                                             // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericDeath.GAB_GenericDeath_C.PickDeathMontageSectionName
	// void PickDeathMontageSectionName();                                                                                   // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericDeath.GAB_GenericDeath_C.SetDeathMontageSectionFromName
	// void SetDeathMontageSectionFromName();                                                                                // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericDeath.GAB_GenericDeath_C.K2_ActivateAbilityFromEvent
	// void K2_ActivateAbilityFromEvent(FGameplayEventData& EventData);                                                      // [0x130d900] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericDeath.GAB_GenericDeath_C.TryCharacterDissolve
	// void TryCharacterDissolve();                                                                                          // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_GenericDeath.GAB_GenericDeath_C.ExecuteUbergraph_GAB_GenericDeath
	// void ExecuteUbergraph_GAB_GenericDeath(int32_t EntryPoint);                                                           // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_Death.GA_DefaultPlayer_Death_C
/// Size: 0x0014 (0x000D3C - 0x000D50)
class UGA_DefaultPlayer_Death_C : public UGAB_GenericDeath_C
{ 
public:
	unsigned char                                      UnknownData00_3[0x4];                                       // 0x0D3C   (0x0004)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0D40   (0x0008)  
	FGameplayTag                                       FadeCapsuleStWCue;                                          // 0x0D48   (0x0004)  
	FGameplayTag                                       FadeCapsuleAthenaCue;                                       // 0x0D4C   (0x0004)  


	/// Functions
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_Death.GA_DefaultPlayer_Death_C.PickDeathMontageSection
	// void PickDeathMontageSection();                                                                                       // [0x130d900] BlueprintEvent       
	// Function /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GA_DefaultPlayer_Death.GA_DefaultPlayer_Death_C.ExecuteUbergraph_GA_DefaultPlayer_Death
	// void ExecuteUbergraph_GA_DefaultPlayer_Death(int32_t EntryPoint);                                                     // [0x130d900] Final                
};

/// Class /Game/Abilities/Player/Perks/Hero/ClusterBomb/B_Prj_Commando_FragGrenade_Cluster.B_Prj_Commando_FragGrenade_Cluster_C
/// Size: 0x0058 (0x000AA0 - 0x000AF8)
class AB_Prj_Commando_FragGrenade_Cluster_C : public AFortProjectileBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0AA0   (0x0008)  
	class UParticleSystemComponent*                    ParticleSystem1;                                            // 0x0AA8   (0x0008)  
	class UAudioComponent*                             Audio1;                                                     // 0x0AB0   (0x0008)  
	class USoundBase*                                  BounceSound;                                                // 0x0AB8   (0x0008)  
	class UParticleSystem*                             P_Explosion;                                                // 0x0AC0   (0x0008)  
	class USoundBase*                                  ExplosionSound;                                             // 0x0AC8   (0x0008)  
	FVector                                            ExplosionLocation;                                          // 0x0AD0   (0x0018)  
	double                                             MinExplosionDelay;                                          // 0x0AE8   (0x0008)  
	double                                             MaxExplosionDelay;                                          // 0x0AF0   (0x0008)  


	/// Functions
	// Function /Game/Abilities/Player/Perks/Hero/ClusterBomb/B_Prj_Commando_FragGrenade_Cluster.B_Prj_Commando_FragGrenade_Cluster_C.OnStop
	// void OnStop(FHitResult& Hit);                                                                                         // [0x130d900] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/Player/Perks/Hero/ClusterBomb/B_Prj_Commando_FragGrenade_Cluster.B_Prj_Commando_FragGrenade_Cluster_C.ReceiveAnyDamage
	// void ReceiveAnyDamage(float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser); // [0x130d900] BlueprintAuthorityOnly|Event|Public|BlueprintEvent 
	// Function /Game/Abilities/Player/Perks/Hero/ClusterBomb/B_Prj_Commando_FragGrenade_Cluster.B_Prj_Commando_FragGrenade_Cluster_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Player/Perks/Hero/ClusterBomb/B_Prj_Commando_FragGrenade_Cluster.B_Prj_Commando_FragGrenade_Cluster_C.OnExploded
	// void OnExploded(TArray<AActor*>& HitActors, TArray<FHitResult>& HitResults);                                          // [0x130d900] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/Player/Perks/Hero/ClusterBomb/B_Prj_Commando_FragGrenade_Cluster.B_Prj_Commando_FragGrenade_Cluster_C.ExecuteUbergraph_B_Prj_Commando_FragGrenade_Cluster
	// void ExecuteUbergraph_B_Prj_Commando_FragGrenade_Cluster(int32_t EntryPoint);                                         // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/Player/Commando/Actives/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C
/// Size: 0x02F4 (0x000AA0 - 0x000D94)
class AB_Prj_Commando_FragGrenade_C : public AFortProjectileBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0AA0   (0x0008)  
	class URotatingMovementComponent*                  RotatingMovement;                                           // 0x0AA8   (0x0008)  
	class UParticleSystemComponent*                    Fuse_Particle;                                              // 0x0AB0   (0x0008)  
	class UStaticMeshComponent*                        Mesh;                                                       // 0x0AB8   (0x0008)  
	class UAudioComponent*                             GrenadeFuse_AudioComponent;                                 // 0x0AC0   (0x0008)  
	class UParticleSystemComponent*                    Effect_Distance;                                            // 0x0AC8   (0x0008)  
	class UParticleSystem*                             P_Explosion;                                                // 0x0AD0   (0x0008)  
	class USoundBase*                                  Cue_DistantSound;                                           // 0x0AD8   (0x0008)  
	class USoundBase*                                  Cue_CloseSound;                                             // 0x0AE0   (0x0008)  
	double                                             ExplosionRadius;                                            // 0x0AE8   (0x0008)  
	int32_t                                            NumberOfBouncesTillExplode;                                 // 0x0AF0   (0x0004)  
	int32_t                                            CurrentNumberOfBounces;                                     // 0x0AF4   (0x0004)  
	class USoundBase*                                  Cue_GrenadeFuseSound;                                       // 0x0AF8   (0x0008)  
	double                                             BouncePawnAgainstPawnGravityScale;                          // 0x0B00   (0x0008)  
	class UForceFeedbackEffect*                        ExplosionForceFeedbackNear;                                 // 0x0B08   (0x0008)  
	class UForceFeedbackEffect*                        ExplosionForceFeedbackFar;                                  // 0x0B10   (0x0008)  
	int32_t                                            MaxClusterGrenades;                                         // 0x0B18   (0x0004)  
	FGameplayTag                                       EC_ClusterExplosion;                                        // 0x0B1C   (0x0004)  
	bool                                               bHasCluster;                                                // 0x0B20   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0B21   (0x0007)  MISSED
	class UClass*                                      Prj_Cluster;                                                // 0x0B28   (0x0008)  
	FFortGameplayEffectContainerSpec                   ClusterContainerSpec;                                       // 0x0B30   (0x00B8)  
	bool                                               bHasKeepOut;                                                // 0x0BE8   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0BE9   (0x0007)  MISSED
	FFortGameplayEffectContainerSpec                   KeepOutContainerSpec;                                       // 0x0BF0   (0x00B8)  
	class UClass*                                      AOE_KeepOut;                                                // 0x0CA8   (0x0008)  
	bool                                               bHasClusterTactical;                                        // 0x0CB0   (0x0001)  
	unsigned char                                      UnknownData02_5[0x7];                                       // 0x0CB1   (0x0007)  MISSED
	FFortGameplayEffectContainerSpec                   Cluster_Tactical_Container_Spec;                            // 0x0CB8   (0x00B8)  
	FGameplayTagContainer                              TC_ActorTagsThatShouldExplodeOnOverlap;                     // 0x0D70   (0x0020)  
	FGameplayTag                                       T_Event_GrenadeExploded;                                    // 0x0D90   (0x0004)  


	/// Functions
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C.SpawnKeepOut
	// void SpawnKeepOut();                                                                                                  // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C.SpawnClusters
	// void SpawnClusters();                                                                                                 // [0x130d900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C.CalcGrenadeSpeed
	// double CalcGrenadeSpeed(double Angle);                                                                                // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C.OnRep_StoredHit
	// void OnRep_StoredHit();                                                                                               // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x130d900] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C.OnStop
	// void OnStop(FHitResult& Hit);                                                                                         // [0x130d900] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C.Stop_Rotation
	// void Stop_Rotation();                                                                                                 // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C.OnExploded
	// void OnExploded(TArray<AActor*>& HitActors, TArray<FHitResult>& HitResults);                                          // [0x130d900] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C.ReceiveAnyDamage
	// void ReceiveAnyDamage(float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser); // [0x130d900] BlueprintAuthorityOnly|Event|Public|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C.OnBounce
	// void OnBounce(FHitResult& Hit);                                                                                       // [0x130d900] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C.On Destroy Grenade
	// void On Destroy Grenade(class AActor* DestroyedActor);                                                                // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C.Bind Destroy Grenade
	// void Bind Destroy Grenade();                                                                                          // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C.Force On Exploded Effects
	// void Force On Exploded Effects();                                                                                     // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C.Unbind Destroy Grenade
	// void Unbind Destroy Grenade();                                                                                        // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C.TriggerDoExplsoion
	// void TriggerDoExplsoion();                                                                                            // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C.ReceiveDestroyed
	// void ReceiveDestroyed();                                                                                              // [0x130d900] Event|Public|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C.CheckKeepOutAndCluster
	// void CheckKeepOutAndCluster();                                                                                        // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C.ReceiveActorBeginOverlap
	// void ReceiveActorBeginOverlap(class AActor* OtherActor);                                                              // [0x130d900] Event|Public|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C.SendExplodedEvent
	// void SendExplodedEvent();                                                                                             // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C.ExecuteUbergraph_B_Prj_Commando_FragGrenade
	// void ExecuteUbergraph_B_Prj_Commando_FragGrenade(int32_t EntryPoint);                                                 // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/Player/Commando/Actives/FragGrenade/TT_Commando_FragGrenade.TT_Commando_FragGrenade_C
/// Size: 0x0000 (0x000158 - 0x000158)
class UTT_Commando_FragGrenade_C : public UFortGameplayAbilityTooltip
{ 
public:


	/// Functions
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/TT_Commando_FragGrenade.TT_Commando_FragGrenade_C.GetApplicationTag
	// bool GetApplicationTag(class UGameplayAbility* AbilityInstance, FGameplayTag& OutTag);                                // [0x130d900] Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/TT_Commando_FragGrenade.TT_Commando_FragGrenade_C.GetTextForTokenFromAbilityInstanceInternal
	// bool GetTextForTokenFromAbilityInstanceInternal(class UGameplayAbility* AbilityInstance, FGameplayTag& tag, class UFortTooltipContext* Context, FGameplayTag& Token, FText& OutText); // [0x130d900] Event|Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/TT_Commando_FragGrenade.TT_Commando_FragGrenade_C.InitializeAbilityInstanceInternal
	// void InitializeAbilityInstanceInternal(class UGameplayAbility* AbilityInstance, class UFortTooltipContext* Context);  // [0x130d900] Event|Protected|BlueprintCallable|BlueprintEvent|Const 
};

/// Class /Game/Abilities/Player/Commando/Actives/FragGrenade/GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C
/// Size: 0x0336 (0x000C7A - 0x000FB0)
class UGA_Commando_FragGrenade_WithTrajectory_C : public UGAT_CommandoActiveAbility_C
{ 
public:
	unsigned char                                      UnknownData00_3[0x6];                                       // 0x0C7A   (0x0006)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0C80   (0x0008)  
	class UClass*                                      Prj_Grenade;                                                // 0x0C88   (0x0008)  
	double                                             GrenadeSpeedMin;                                            // 0x0C90   (0x0008)  
	double                                             GrenadeSpeedMax;                                            // 0x0C98   (0x0008)  
	double                                             GravityScale;                                               // 0x0CA0   (0x0008)  
	FGameplayTagContainer                              TC_ClusterBomb;                                             // 0x0CA8   (0x0020)  
	FGameplayTagContainer                              TC_BiggerIsBetter;                                          // 0x0CC8   (0x0020)  
	FGameplayTag                                       T_GEContainer_Explosion;                                    // 0x0CE8   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0CEC   (0x0004)  MISSED
	double                                             ExplosionRadius;                                            // 0x0CF0   (0x0008)  
	double                                             AdditionalThrowAngle;                                       // 0x0CF8   (0x0008)  
	FGameplayTag                                       EC_ClusterExplosion;                                        // 0x0D00   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x0D04   (0x0004)  MISSED
	FFortFeedbackHandle                                GrenadeDialogFeedback;                                      // 0x0D08   (0x0010)  
	FGameplayTagContainer                              TC_KeepOut;                                                 // 0x0D18   (0x0020)  
	FGameplayTag                                       EC_KeepOut;                                                 // 0x0D38   (0x0004)  
	bool                                               BiggerIsBetter;                                             // 0x0D3C   (0x0001)  
	bool                                               ClusterBomb;                                                // 0x0D3D   (0x0001)  
	bool                                               KeepOut;                                                    // 0x0D3E   (0x0001)  
	unsigned char                                      UnknownData03_5[0x1];                                       // 0x0D3F   (0x0001)  MISSED
	FGameplayTagContainer                              TC_GrenadeAmmo;                                             // 0x0D40   (0x0020)  
	FGameplayTagContainer                              TC_GrenadeCost;                                             // 0x0D60   (0x0020)  
	FGameplayTagContainer                              TC_GrenadeDamage;                                           // 0x0D80   (0x0020)  
	bool                                               GrenadeAmmo;                                                // 0x0DA0   (0x0001)  
	bool                                               GrenadeCost;                                                // 0x0DA1   (0x0001)  
	bool                                               GrenadeDamage;                                              // 0x0DA2   (0x0001)  
	unsigned char                                      UnknownData04_5[0x1];                                       // 0x0DA3   (0x0001)  MISSED
	int32_t                                            GrenadeAmmoUpgrade;                                         // 0x0DA4   (0x0004)  
	int32_t                                            GrenadeAmmoDefault;                                         // 0x0DA8   (0x0004)  
	int32_t                                            MaxGrenadeAmmo;                                             // 0x0DAC   (0x0004)  
	int32_t                                            ExplosionRadiusTooltip;                                     // 0x0DB0   (0x0004)  
	int32_t                                            ExplosionRadiusDefault;                                     // 0x0DB4   (0x0004)  
	int32_t                                            ExplosionRadiusUpgrade;                                     // 0x0DB8   (0x0004)  
	unsigned char                                      UnknownData05_5[0x4];                                       // 0x0DBC   (0x0004)  MISSED
	FGameplayTagContainer                              TC_PlasmaGrenades;                                          // 0x0DC0   (0x0020)  
	bool                                               PlasmaGrenades;                                             // 0x0DE0   (0x0001)  
	unsigned char                                      UnknownData06_5[0x7];                                       // 0x0DE1   (0x0007)  MISSED
	FGameplayTagContainer                              TC_Flashbang;                                               // 0x0DE8   (0x0020)  
	bool                                               Flashbang;                                                  // 0x0E08   (0x0001)  
	unsigned char                                      UnknownData07_5[0x7];                                       // 0x0E09   (0x0007)  MISSED
	FVector                                            GrenadeTargetingOriginOffset;                               // 0x0E10   (0x0018)  
	bool                                               DummyShouldBounce;                                          // 0x0E28   (0x0001)  
	unsigned char                                      UnknownData08_5[0x7];                                       // 0x0E29   (0x0007)  MISSED
	double                                             DummyBounciness;                                            // 0x0E30   (0x0008)  
	double                                             DummyFriction;                                              // 0x0E38   (0x0008)  
	double                                             TrajectoryUpdateInterval;                                   // 0x0E40   (0x0008)  
	double                                             DummyMaxSpeed;                                              // 0x0E48   (0x0008)  
	double                                             DummyGravity;                                               // 0x0E50   (0x0008)  
	double                                             DummyTimeStep;                                              // 0x0E58   (0x0008)  
	double                                             DummyExtent;                                                // 0x0E60   (0x0008)  
	bool                                               InThrowWindup;                                              // 0x0E68   (0x0001)  
	unsigned char                                      UnknownData09_5[0x7];                                       // 0x0E69   (0x0007)  MISSED
	class ABP_ProjectileTrajectory_C*                  TrajectoryIndicator;                                        // 0x0E70   (0x0008)  
	class UClass*                                      TrajectoryIndicatorClass;                                   // 0x0E78   (0x0008)  
	FFortGameplayAbilityMontageInfo                    ThrowWindupMontage;                                         // 0x0E80   (0x0058)  
	bool                                               AbilityKeyPressed;                                          // 0x0ED8   (0x0001)  
	unsigned char                                      UnknownData10_5[0x7];                                       // 0x0ED9   (0x0007)  MISSED
	double                                             MaxSpeedPitch;                                              // 0x0EE0   (0x0008)  
	double                                             MinSpeedPitch;                                              // 0x0EE8   (0x0008)  
	double                                             MaxTossPitch;                                               // 0x0EF0   (0x0008)  
	int32_t                                            MaxTrajectoryBounces;                                       // 0x0EF8   (0x0004)  
	unsigned char                                      UnknownData11_5[0x4];                                       // 0x0EFC   (0x0004)  MISSED
	FGameplayTagContainer                              TC_Tactical_Clusterbomb;                                    // 0x0F00   (0x0020)  
	bool                                               Tactical_Clusterbomb;                                       // 0x0F20   (0x0001)  
	unsigned char                                      UnknownData12_5[0x3];                                       // 0x0F21   (0x0003)  MISSED
	FGameplayTag                                       EC_ClusterExplosion_Tactical;                               // 0x0F24   (0x0004)  
	double                                             F_FrameDelay;                                               // 0x0F28   (0x0008)  
	bool                                               BiggerIsBetter_T01;                                         // 0x0F30   (0x0001)  
	bool                                               BiggerIsBetter_T02;                                         // 0x0F31   (0x0001)  
	bool                                               ClusterBomb_T01;                                            // 0x0F32   (0x0001)  
	bool                                               ClusterBomb_T02;                                            // 0x0F33   (0x0001)  
	FGameplayTag                                       T_BiggerIsBetter_T01;                                       // 0x0F34   (0x0004)  
	FGameplayTag                                       T_BiggerIsBetter_T02;                                       // 0x0F38   (0x0004)  
	FGameplayTag                                       T_ClusterBomb_T01;                                          // 0x0F3C   (0x0004)  
	FGameplayTag                                       T_ClusterBomb_T02;                                          // 0x0F40   (0x0004)  
	unsigned char                                      UnknownData13_5[0x4];                                       // 0x0F44   (0x0004)  MISSED
	FScalableFloat                                     SF_BiggerIsBetterRadius_T01;                                // 0x0F48   (0x0028)  
	class UAnimMontage*                                ThrowMontage;                                               // 0x0F70   (0x0008)  
	FGameplayTag                                       T_Event_Activate;                                           // 0x0F78   (0x0004)  
	FGameplayTag                                       T_Event_Deactivate;                                         // 0x0F7C   (0x0004)  
	FScalableFloat                                     SF_BiggerIsBetterRadius_T02;                                // 0x0F80   (0x0028)  
	SDK_UNDEFINED(1,11253) /* TEnumAsByte<ECollisionChannel> */ __um(DummyCollisionChannel);                       // 0x0FA8   (0x0001)  
	unsigned char                                      UnknownData14_5[0x3];                                       // 0x0FA9   (0x0003)  MISSED
	FGameplayTag                                       ThrowCue;                                                   // 0x0FAC   (0x0004)  


	/// Functions
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.ActiveAbilitySetup
	// void ActiveAbilitySetup(class UAbilitySystemComponent* AbilitySystemIn, class UAbilitySystemComponent*& AbilitySystemOut); // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.SpawnFragGrenade
	// void SpawnFragGrenade(class UClass* ProjectileClass, FVector& SpawnLocation, FRotator InputPin, FFortGameplayEffectContainerSpec EffectContainerSpecToApplyOnExplode, double InitialSpeed, double GravityScale); // [0x130d900] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.CalcGrenadeSpeedFromPitch
	// void CalcGrenadeSpeedFromPitch(double AimPitch, double& GrenadeSpeed);                                                // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.UpdateTrajectorySpline
	// void UpdateTrajectorySpline();                                                                                        // [0x130d900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.SetupDummyProjectile
	// void SetupDummyProjectile();                                                                                          // [0x130d900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.SpawnLocationAndRotation
	// void SpawnLocationAndRotation(FVector& OutLoc, FRotator& OutRot);                                                     // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.SetupAbility
	// void SetupAbility(class UAbilitySystemComponent* AbilitySystemComponentRef);                                          // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.SetupGrenade
	// void SetupGrenade(double AimPitch, class UClass*& Base Grenade, double& Projectile Speed, FFortGameplayEffectContainerSpec& Explosion Gameplay Spec, double& Projectile Gravity Scale); // [0x130d900] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.OnFinish_F5D87C9E46378707AE4C79B3A42F5A45
	// void OnFinish_F5D87C9E46378707AE4C79B3A42F5A45();                                                                     // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.OnCancelled_854170AF4268B06A435A3AA33232C5BF
	// void OnCancelled_854170AF4268B06A435A3AA33232C5BF();                                                                  // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.OnInterrupted_854170AF4268B06A435A3AA33232C5BF
	// void OnInterrupted_854170AF4268B06A435A3AA33232C5BF();                                                                // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.OnBlendOut_854170AF4268B06A435A3AA33232C5BF
	// void OnBlendOut_854170AF4268B06A435A3AA33232C5BF();                                                                   // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.OnCompleted_854170AF4268B06A435A3AA33232C5BF
	// void OnCompleted_854170AF4268B06A435A3AA33232C5BF();                                                                  // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.OnFinish_1C6A100D44D1ACE5BBB57DAEDB3561CB
	// void OnFinish_1C6A100D44D1ACE5BBB57DAEDB3561CB();                                                                     // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.Completed_BF65CDBE4F9E98E9174850B85775A15B
	// void Completed_BF65CDBE4F9E98E9174850B85775A15B(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.Cancelled_BF65CDBE4F9E98E9174850B85775A15B
	// void Cancelled_BF65CDBE4F9E98E9174850B85775A15B(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.Triggered_BF65CDBE4F9E98E9174850B85775A15B
	// void Triggered_BF65CDBE4F9E98E9174850B85775A15B(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.OnAbilityInputReleased
	// void OnAbilityInputReleased();                                                                                        // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.K2_OnEndAbility
	// void K2_OnEndAbility(bool bWasCancelled);                                                                             // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.CleanupTrajectoryDisplay
	// void CleanupTrajectoryDisplay();                                                                                      // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.K2_ActivateAbility
	// void K2_ActivateAbility();                                                                                            // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.TossGrenade
	// void TossGrenade();                                                                                                   // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.ServerSpawnProjectile
	// void ServerSpawnProjectile();                                                                                         // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Commando/Actives/FragGrenade/GA_Commando_FragGrenade_WithTrajectory.GA_Commando_FragGrenade_WithTrajectory_C.ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory
	// void ExecuteUbergraph_GA_Commando_FragGrenade_WithTrajectory(int32_t EntryPoint);                                     // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/NPC/Generic/GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C
/// Size: 0x0038 (0x000B60 - 0x000B98)
class UGAB_AthenaDBNORevive_C : public UFortGameplayAbility
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0B60   (0x0008)  
	FGameplayTag                                       EC_AppliedEffect;                                           // 0x0B68   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0B6C   (0x0004)  MISSED
	class AFortPlayerPawn*                             PlayerPawn;                                                 // 0x0B70   (0x0008)  
	FGameplayTag                                       ResurrectCue;                                               // 0x0B78   (0x0004)  
	FGameplayTag                                       ResurrectAthenaCue;                                         // 0x0B7C   (0x0004)  
	class UAnimMontage*                                DBNOMontageOutro;                                           // 0x0B80   (0x0008)  
	class UAnimMontage*                                DBNOMontageOutroSwimming;                                   // 0x0B88   (0x0008)  
	class UClass*                                      GE_PlayerDamage_Immune_FX;                                  // 0x0B90   (0x0008)  


	/// Functions
	// Function /Game/Abilities/NPC/Generic/GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C.Get DBNO Outro Montage
	// void Get DBNO Outro Montage(class UAnimMontage*& DBNOMontageOutro);                                                   // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Abilities/NPC/Generic/GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C.Completed_23712DBC45E68EA0C91A4895CBD8B3A6
	// void Completed_23712DBC45E68EA0C91A4895CBD8B3A6(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C.Cancelled_23712DBC45E68EA0C91A4895CBD8B3A6
	// void Cancelled_23712DBC45E68EA0C91A4895CBD8B3A6(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C.Triggered_23712DBC45E68EA0C91A4895CBD8B3A6
	// void Triggered_23712DBC45E68EA0C91A4895CBD8B3A6(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C.Cancelled_779E7BAA49FEAD286C5164B83CDFD609
	// void Cancelled_779E7BAA49FEAD286C5164B83CDFD609(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C.Targeted_779E7BAA49FEAD286C5164B83CDFD609
	// void Targeted_779E7BAA49FEAD286C5164B83CDFD609(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C.Removed_620488CD4F8BFC035EC7328664732683
	// void Removed_620488CD4F8BFC035EC7328664732683();                                                                      // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C.K2_ActivateAbilityFromEvent
	// void K2_ActivateAbilityFromEvent(FGameplayEventData& EventData);                                                      // [0x130d900] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C.K2_OnEndAbility
	// void K2_OnEndAbility(bool bWasCancelled);                                                                             // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_AthenaDBNORevive.GAB_AthenaDBNORevive_C.ExecuteUbergraph_GAB_AthenaDBNORevive
	// void ExecuteUbergraph_GAB_AthenaDBNORevive(int32_t EntryPoint);                                                       // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/NPC/Generic/GAB_AthenaDBNO.GAB_AthenaDBNO_C
/// Size: 0x01C8 (0x000B60 - 0x000D28)
class UGAB_AthenaDBNO_C : public UFortGameplayAbility
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0B60   (0x0008)  
	class UAnimMontage*                                DeathMontage;                                               // 0x0B68   (0x0008)  
	FVector                                            DeathHitDirection;                                          // 0x0B70   (0x0018)  
	FHitResult                                         DeathHitResult;                                             // 0x0B88   (0x00E8)  
	FGameplayTagContainer                              DamageTags;                                                 // 0x0C70   (0x0020)  
	FGameplayTagContainer                              GameplayStatusAfflicted;                                    // 0x0C90   (0x0020)  
	class UAnimMontage*                                DeathMontageSkydive;                                        // 0x0CB0   (0x0008)  
	FActiveGameplayEffectHandle                        DBNOBleedGEHandle;                                          // 0x0CB8   (0x0008)  
	FName                                              HolsterId;                                                  // 0x0CC0   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0CC4   (0x0004)  MISSED
	class UAnimMontage*                                DeathMontageSwimming;                                       // 0x0CC8   (0x0008)  
	class AFortPlayerPawnAthena*                       FortPlayerPawn;                                             // 0x0CD0   (0x0008)  
	class UClass*                                      DBNOStart_GE_Class;                                         // 0x0CD8   (0x0008)  
	bool                                               ImprovedDBNO;                                               // 0x0CE0   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0CE1   (0x0007)  MISSED
	FGameplayTagContainer                              Old_DBNO_Block_Tags;                                        // 0x0CE8   (0x0020)  
	FActiveGameplayEffectHandle                        GE_Handle__Health_Bonus;                                    // 0x0D08   (0x0008)  
	double                                             TenacityAmount;                                             // 0x0D10   (0x0008)  
	ETenacityType                                      TenacityType;                                               // 0x0D18   (0x0001)  
	unsigned char                                      UnknownData02_5[0x7];                                       // 0x0D19   (0x0007)  MISSED
	class UClass*                                      GE_PlayerDamage_Immune_FX;                                  // 0x0D20   (0x0008)  


	/// Functions
	// Function /Game/Abilities/NPC/Generic/GAB_AthenaDBNO.GAB_AthenaDBNO_C.Get Custom Tenacity
	// void Get Custom Tenacity(double& Tenacity);                                                                           // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Abilities/NPC/Generic/GAB_AthenaDBNO.GAB_AthenaDBNO_C.Get Max Health Tenacity
	// void Get Max Health Tenacity(double& Tenacity);                                                                       // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Abilities/NPC/Generic/GAB_AthenaDBNO.GAB_AthenaDBNO_C.Apply Health Bonus
	// void Apply Health Bonus(FActiveGameplayEffectHandle& EffectHandle);                                                   // [0x130d900] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_AthenaDBNO.GAB_AthenaDBNO_C.ApplyBleeding
	// void ApplyBleeding(FActiveGameplayEffectHandle& EffectHandle);                                                        // [0x130d900] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_AthenaDBNO.GAB_AthenaDBNO_C.Get DBNO Montage
	// class UAnimMontage* Get DBNO Montage();                                                                               // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Abilities/NPC/Generic/GAB_AthenaDBNO.GAB_AthenaDBNO_C.Get Initial Heal Amount
	// void Get Initial Heal Amount(double& Health);                                                                         // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_AthenaDBNO.GAB_AthenaDBNO_C.InitializeDeathHitDirection
	// void InitializeDeathHitDirection(FGameplayEventData EventHitData);                                                    // [0x130d900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_AthenaDBNO.GAB_AthenaDBNO_C.OnCancelled_F0F6785443BD2E74F5591884CB19F35F
	// void OnCancelled_F0F6785443BD2E74F5591884CB19F35F();                                                                  // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_AthenaDBNO.GAB_AthenaDBNO_C.OnInterrupted_F0F6785443BD2E74F5591884CB19F35F
	// void OnInterrupted_F0F6785443BD2E74F5591884CB19F35F();                                                                // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_AthenaDBNO.GAB_AthenaDBNO_C.OnBlendOut_F0F6785443BD2E74F5591884CB19F35F
	// void OnBlendOut_F0F6785443BD2E74F5591884CB19F35F();                                                                   // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_AthenaDBNO.GAB_AthenaDBNO_C.OnCompleted_F0F6785443BD2E74F5591884CB19F35F
	// void OnCompleted_F0F6785443BD2E74F5591884CB19F35F();                                                                  // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_AthenaDBNO.GAB_AthenaDBNO_C.OnStateInterrupted_C85094F843D5075FE4872C95AFC5D6B6
	// void OnStateInterrupted_C85094F843D5075FE4872C95AFC5D6B6();                                                           // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_AthenaDBNO.GAB_AthenaDBNO_C.OnStateEnded_C85094F843D5075FE4872C95AFC5D6B6
	// void OnStateEnded_C85094F843D5075FE4872C95AFC5D6B6();                                                                 // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_AthenaDBNO.GAB_AthenaDBNO_C.K2_ActivateAbilityFromEvent
	// void K2_ActivateAbilityFromEvent(FGameplayEventData& EventData);                                                      // [0x130d900] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_AthenaDBNO.GAB_AthenaDBNO_C.K2_OnEndAbility
	// void K2_OnEndAbility(bool bWasCancelled);                                                                             // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_AthenaDBNO.GAB_AthenaDBNO_C.DropHeldObjects
	// void DropHeldObjects();                                                                                               // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/NPC/Generic/GAB_AthenaDBNO.GAB_AthenaDBNO_C.ExecuteUbergraph_GAB_AthenaDBNO
	// void ExecuteUbergraph_GAB_AthenaDBNO(int32_t EntryPoint);                                                             // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/Player/Sliding/GA_Athena_Player_Slide.GA_Athena_Player_Slide_C
/// Size: 0x0EB0 (0x000B60 - 0x001A10)
class UGA_Athena_Player_Slide_C : public UFortGameplayAbility
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0B60   (0x0008)  
	class UClass*                                      CameraShake;                                                // 0x0B68   (0x0008)  
	class UClass*                                      Camera_Mode_Class;                                          // 0x0B70   (0x0008)  
	FGameplayTag                                       CameraShakeGCNL;                                            // 0x0B78   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0B7C   (0x0004)  MISSED
	class UClass*                                      CameraModifier;                                             // 0x0B80   (0x0008)  
	double                                             MinAngleForMomentum;                                        // 0x0B88   (0x0008)  
	FGameplayTag                                       SpeedlinesCue;                                              // 0x0B90   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0B94   (0x0004)  MISSED
	class UClass*                                      StartSlideCameraShake;                                      // 0x0B98   (0x0008)  
	double                                             AdditionalLaunchVelocityOffRamp;                            // 0x0BA0   (0x0008)  
	FSlidingControlParams                              DefaultSlidingParams;                                       // 0x0BA8   (0x06C0)  
	FSlidingControlParams                              PostDashGroundSlidingParams;                                // 0x1268   (0x06C0)  
	double                                             LevelGroundSlideDuration;                                   // 0x1928   (0x0008)  
	FTimerHandle                                       EndLevelGroundSlideTimerHandle;                             // 0x1930   (0x0008)  
	FScalableFloat                                     DashDuration;                                               // 0x1938   (0x0028)  
	FTimerHandle                                       CameraFXDelay;                                              // 0x1960   (0x0008)  
	FGameplayTag                                       PlayerGameplayCue;                                          // 0x1968   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x196C   (0x0004)  MISSED
	double                                             CameraShakeDelay;                                           // 0x1970   (0x0008)  
	FScalableFloat                                     MinAdditionalMomentum;                                      // 0x1978   (0x0028)  
	FScalableFloat                                     MaxAdditionalMomentum;                                      // 0x19A0   (0x0028)  
	FScalableFloat                                     MinAngleForAdditionalMomentum;                              // 0x19C8   (0x0028)  
	bool                                               Prev_FallingGracePeriodState;                               // 0x19F0   (0x0001)  
	unsigned char                                      UnknownData03_5[0x7];                                       // 0x19F1   (0x0007)  MISSED
	class UCameraModifier*                             SlideCameraModifier;                                        // 0x19F8   (0x0008)  
	FTimerHandle                                       AddMomentumTimerHandle;                                     // 0x1A00   (0x0008)  
	class UCameraShakeBase*                            CameraShakeObjRef;                                          // 0x1A08   (0x0008)  


	/// Functions
	// Function /Game/Abilities/Player/Sliding/GA_Athena_Player_Slide.GA_Athena_Player_Slide_C.EndAbilityServerSide
	// void EndAbilityServerSide();                                                                                          // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Sliding/GA_Athena_Player_Slide.GA_Athena_Player_Slide_C.EndAbilityClientSide
	// void EndAbilityClientSide();                                                                                          // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Sliding/GA_Athena_Player_Slide.GA_Athena_Player_Slide_C.BuildDataRegistryResolverScope
	// bool BuildDataRegistryResolverScope(TArray<FName>& InOutResolverScopes, int32_t& InOutPriority);                      // [0x130d900] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/Abilities/Player/Sliding/GA_Athena_Player_Slide.GA_Athena_Player_Slide_C.K2_ActivateAbilityFromEvent
	// void K2_ActivateAbilityFromEvent(FGameplayEventData& EventData);                                                      // [0x130d900] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/Player/Sliding/GA_Athena_Player_Slide.GA_Athena_Player_Slide_C.K2_OnEndAbility
	// void K2_OnEndAbility(bool bWasCancelled);                                                                             // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Player/Sliding/GA_Athena_Player_Slide.GA_Athena_Player_Slide_C.AddMomentum
	// void AddMomentum();                                                                                                   // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Sliding/GA_Athena_Player_Slide.GA_Athena_Player_Slide_C.EndLevelGroundSlide
	// void EndLevelGroundSlide();                                                                                           // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Sliding/GA_Athena_Player_Slide.GA_Athena_Player_Slide_C.CameraFX
	// void CameraFX();                                                                                                      // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Sliding/GA_Athena_Player_Slide.GA_Athena_Player_Slide_C.OnFinishedCharacterCustomization_Event
	// void OnFinishedCharacterCustomization_Event(class AFortPlayerPawn* Pawn);                                             // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Sliding/GA_Athena_Player_Slide.GA_Athena_Player_Slide_C.ForceRemoveSlideGC
	// void ForceRemoveSlideGC();                                                                                            // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Sliding/GA_Athena_Player_Slide.GA_Athena_Player_Slide_C.OnTargetingChanged
	// void OnTargetingChanged(bool bIsTargeting);                                                                           // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Sliding/GA_Athena_Player_Slide.GA_Athena_Player_Slide_C.ExecuteUbergraph_GA_Athena_Player_Slide
	// void ExecuteUbergraph_GA_Athena_Player_Slide(int32_t EntryPoint);                                                     // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/AccountBuff/Buff_PartyXPBoost.Buff_PartyXPBoost_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UBuff_PartyXPBoost_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Abilities/Player/Generic/Traits/DefaultPlayer/GE_DefaultPlayer_Tooltips.GE_DefaultPlayer_Tooltips_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_DefaultPlayer_Tooltips_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Abilities/Mission/GE_Resist_Damage_AoE.GE_Resist_Damage_AoE_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_Resist_Damage_AoE_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Abilities/Items/GCNL_PurpleStuff.GCNL_PurpleStuff_C
/// Size: 0x0010 (0x000380 - 0x000390)
class AGCNL_PurpleStuff_C : public AFortGameplayCueNotify_Looping
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0380   (0x0008)  
	class APlayerPawn_Athena_Generic_C*                PlayerActor;                                                // 0x0388   (0x0008)  


	/// Functions
	// Function /Game/Abilities/Items/GCNL_PurpleStuff.GCNL_PurpleStuff_C.OnRemove
	// bool OnRemove(class AActor* MyTarget, FGameplayCueParameters& Parameters);                                            // [0x130d900] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Items/GCNL_PurpleStuff.GCNL_PurpleStuff_C.OnActive
	// bool OnActive(class AActor* MyTarget, FGameplayCueParameters& Parameters);                                            // [0x130d900] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Items/GCNL_PurpleStuff.GCNL_PurpleStuff_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Items/GCNL_PurpleStuff.GCNL_PurpleStuff_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                 // [0x130d900] Event|Public|BlueprintEvent 
	// Function /Game/Abilities/Items/GCNL_PurpleStuff.GCNL_PurpleStuff_C.ExecuteUbergraph_GCNL_PurpleStuff
	// void ExecuteUbergraph_GCNL_PurpleStuff(int32_t EntryPoint);                                                           // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/Player/Athena/GCNL_Creative_PossessProp.GCNL_Creative_PossessProp_C
/// Size: 0x0010 (0x0009B0 - 0x0009C0)
class AGCNL_Creative_PossessProp_C : public AFortGameplayCueNotify_Loop
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x09B0   (0x0008)  
	class APlayerPawn_Athena_C*                        PlayerPawnAthena;                                           // 0x09B8   (0x0008)  


	/// Functions
	// Function /Game/Abilities/Player/Athena/GCNL_Creative_PossessProp.GCNL_Creative_PossessProp_C.OnActive
	// bool OnActive(class AActor* MyTarget, FGameplayCueParameters& Parameters);                                            // [0x130d900] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCNL_Creative_PossessProp.GCNL_Creative_PossessProp_C.OnLoopingStart
	// void OnLoopingStart(class AActor* MyTarget, FGameplayCueParameters& Parameters, TArray<UParticleSystemComponent*>& ParticleComponents, TArray<UAudioComponent*>& AudioComponents); // [0x130d900] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCNL_Creative_PossessProp.GCNL_Creative_PossessProp_C.OnApplication
	// void OnApplication(class AActor* MyTarget, FGameplayCueParameters& Parameters, TArray<UParticleSystemComponent*>& ParticleComponents, TArray<UAudioComponent*>& AudioComponents, class ULegacyCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance); // [0x130d900] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCNL_Creative_PossessProp.GCNL_Creative_PossessProp_C.ExecuteUbergraph_GCNL_Creative_PossessProp
	// void ExecuteUbergraph_GCNL_Creative_PossessProp(int32_t EntryPoint);                                                  // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/Player/Commando/Actives/FragGrenade/GC/GC_Commando_FragGrenade_Throw.GC_Commando_FragGrenade_Throw_C
/// Size: 0x0000 (0x000218 - 0x000218)
class UGC_Commando_FragGrenade_Throw_C : public UFortGameplayCueNotify_Burst
{ 
public:
};

/// Class /Game/Abilities/Player/GC/GC_Teleport_Out.GC_Teleport_Out_C
/// Size: 0x0008 (0x000068 - 0x000070)
class UGC_Teleport_Out_C : public UFortGameplayCueNotify_Simple
{ 
public:
	double                                             Default_Play_Length;                                        // 0x0068   (0x0008)  


	/// Functions
	// Function /Game/Abilities/Player/GC/GC_Teleport_Out.GC_Teleport_Out_C.OnExecute
	// bool OnExecute(class AActor* MyTarget, FGameplayCueParameters& Parameters);                                           // [0x130d900] Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
};

/// Class /Game/Abilities/Player/GC/GC_Abilities_Activation_DBNOResurrect.GC_Abilities_Activation_DBNOResurrect_C
/// Size: 0x0000 (0x000218 - 0x000218)
class UGC_Abilities_Activation_DBNOResurrect_C : public UFortGameplayCueNotify_Burst
{ 
public:


	/// Functions
	// Function /Game/Abilities/Player/GC/GC_Abilities_Activation_DBNOResurrect.GC_Abilities_Activation_DBNOResurrect_C.OnBurst
	// void OnBurst(class AActor* MyTarget, FGameplayCueParameters& Parameters, TArray<UParticleSystemComponent*>& ParticleComponents, TArray<UAudioComponent*>& AudioComponents, class ULegacyCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance); // [0x130d900] Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|Const 
};

/// Class /Game/Abilities/Player/GC/GC_Abilities_Activation_DBNOResurrect_Athena.GC_Abilities_Activation_DBNOResurrect_Athena_C
/// Size: 0x0000 (0x000218 - 0x000218)
class UGC_Abilities_Activation_DBNOResurrect_Athena_C : public UFortGameplayCueNotify_Burst
{ 
public:


	/// Functions
	// Function /Game/Abilities/Player/GC/GC_Abilities_Activation_DBNOResurrect_Athena.GC_Abilities_Activation_DBNOResurrect_Athena_C.OnBurst
	// void OnBurst(class AActor* MyTarget, FGameplayCueParameters& Parameters, TArray<UParticleSystemComponent*>& ParticleComponents, TArray<UAudioComponent*>& AudioComponents, class ULegacyCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance); // [0x130d900] Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|Const 
};

/// Class /Game/Abilities/Player/Athena/GCN_Athena_LowGravity.GCN_Athena_LowGravity_C
/// Size: 0x0038 (0x0003C8 - 0x000400)
class AGCN_Athena_LowGravity_C : public AFortGameplayCueNotifyLoop_LowGravity
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x03C8   (0x0008)  
	class AActor*                                      MyTargetCached;                                             // 0x03D0   (0x0008)  
	FTimerHandle                                       ExpireTellDelayTimer;                                       // 0x03D8   (0x0008)  
	double                                             ExpirationSoundPeriod;                                      // 0x03E0   (0x0008)  
	FTimerHandle                                       ExpirationSoundTimer;                                       // 0x03E8   (0x0008)  
	double                                             MaxDrawDistance;                                            // 0x03F0   (0x0008)  
	class UFXSystemComponent*                          LoopingFX;                                                  // 0x03F8   (0x0008)  


	/// Functions
	// Function /Game/Abilities/Player/Athena/GCN_Athena_LowGravity.GCN_Athena_LowGravity_C.OnRemove
	// bool OnRemove(class AActor* MyTarget, FGameplayCueParameters& Parameters);                                            // [0x130d900] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCN_Athena_LowGravity.GCN_Athena_LowGravity_C.Activated
	// void Activated(class AActor* PlayerPawn);                                                                             // [0x130d900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCN_Athena_LowGravity.GCN_Athena_LowGravity_C.WhileActive
	// bool WhileActive(class AActor* MyTarget, FGameplayCueParameters& Parameters);                                         // [0x130d900] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCN_Athena_LowGravity.GCN_Athena_LowGravity_C.ExpireTell
	// void ExpireTell();                                                                                                    // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCN_Athena_LowGravity.GCN_Athena_LowGravity_C.PlayExpirationSound
	// void PlayExpirationSound();                                                                                           // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCN_Athena_LowGravity.GCN_Athena_LowGravity_C.K2_HandleGameplayCue
	// void K2_HandleGameplayCue(class AActor* MyTarget, TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters& Parameters); // [0x130d900] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCN_Athena_LowGravity.GCN_Athena_LowGravity_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCN_Athena_LowGravity.GCN_Athena_LowGravity_C.ClearExpireTell
	// void ClearExpireTell();                                                                                               // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCN_Athena_LowGravity.GCN_Athena_LowGravity_C.ExecuteUbergraph_GCN_Athena_LowGravity
	// void ExecuteUbergraph_GCN_Athena_LowGravity(int32_t EntryPoint);                                                      // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/Player/Athena/GCN_Athena_LowGravity_ZipLine.GCN_Athena_LowGravity_ZipLine_C
/// Size: 0x0008 (0x000400 - 0x000408)
class AGCN_Athena_LowGravity_ZipLine_C : public AGCN_Athena_LowGravity_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0400   (0x0008)  


	/// Functions
	// Function /Game/Abilities/Player/Athena/GCN_Athena_LowGravity_ZipLine.GCN_Athena_LowGravity_ZipLine_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                 // [0x130d900] Event|Public|BlueprintEvent 
	// Function /Game/Abilities/Player/Athena/GCN_Athena_LowGravity_ZipLine.GCN_Athena_LowGravity_ZipLine_C.ExecuteUbergraph_GCN_Athena_LowGravity_ZipLine
	// void ExecuteUbergraph_GCN_Athena_LowGravity_ZipLine(int32_t EntryPoint);                                              // [0x130d900] Final                
};

/// Class /Game/Abilities/Player/GC/GCNL_Player_DamageImmune.GCNL_Player_DamageImmune_C
/// Size: 0x0010 (0x0009B0 - 0x0009C0)
class AGCNL_Player_DamageImmune_C : public AFortGameplayCueNotify_Loop
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x09B0   (0x0008)  
	class UFXSystemComponent*                          FXLooping;                                                  // 0x09B8   (0x0008)  


	/// Functions
	// Function /Game/Abilities/Player/GC/GCNL_Player_DamageImmune.GCNL_Player_DamageImmune_C.OnRemove
	// bool OnRemove(class AActor* MyTarget, FGameplayCueParameters& Parameters);                                            // [0x130d900] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/GC/GCNL_Player_DamageImmune.GCNL_Player_DamageImmune_C.OnLoopingStartGeneric
	// void OnLoopingStartGeneric(class AActor* MyTarget, FGameplayCueParameters& Parameters, TArray<UFXSystemComponent*>& ParticleComponents, TArray<UAudioComponent*>& AudioComponents); // [0x130d900] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/Abilities/Player/GC/GCNL_Player_DamageImmune.GCNL_Player_DamageImmune_C.ExecuteUbergraph_GCNL_Player_DamageImmune
	// void ExecuteUbergraph_GCNL_Player_DamageImmune(int32_t EntryPoint);                                                   // [0x130d900] Final|HasDefaults    
};

/// Class /Game/Abilities/Player/Sliding/Speed_CameraShakeLocationPerlin_Sliding.Speed_CameraShakeLocationPerlin_Sliding_C
/// Size: 0x0028 (0x0001F0 - 0x000218)
class USpeed_CameraShakeLocationPerlin_Sliding_C : public ULegacyCameraShake
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x01F0   (0x0008)  
	double                                             OscillatorAmplitudeX;                                       // 0x01F8   (0x0008)  
	double                                             OscillatorAmplitudeY;                                       // 0x0200   (0x0008)  
	double                                             OscillatorAmplitudeZ;                                       // 0x0208   (0x0008)  
	double                                             MinShakeScalar;                                             // 0x0210   (0x0008)  


	/// Functions
	// Function /Game/Abilities/Player/Sliding/Speed_CameraShakeLocationPerlin_Sliding.Speed_CameraShakeLocationPerlin_Sliding_C.BlueprintUpdateCameraShake
	// void BlueprintUpdateCameraShake(float DeltaTime, float Alpha, FMinimalViewInfo& POV, FMinimalViewInfo& ModifiedPOV);  // [0x130d900] Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Abilities/Player/Sliding/Speed_CameraShakeLocationPerlin_Sliding.Speed_CameraShakeLocationPerlin_Sliding_C.ReceivePlayShake
	// void ReceivePlayShake(float Scale);                                                                                   // [0x130d900] Event|Public|BlueprintEvent 
	// Function /Game/Abilities/Player/Sliding/Speed_CameraShakeLocationPerlin_Sliding.Speed_CameraShakeLocationPerlin_Sliding_C.ExecuteUbergraph_Speed_CameraShakeLocationPerlin_Sliding
	// void ExecuteUbergraph_Speed_CameraShakeLocationPerlin_Sliding(int32_t EntryPoint);                                    // [0x130d900] Final                
};

/// Class /RidingContent/Abilities/Irwin/GE_NPC_Irwin_RidingAbilities_CooldownReduction.GE_NPC_Irwin_RidingAbilities_CooldownReduction_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_NPC_Irwin_RidingAbilities_CooldownReduction_C : public UGameplayEffect
{ 
public:
};

/// Class /RidingContent/Abilities/Irwin/GA_NPC_Irwin_Prey_Burt_Charge_RidingHelper.GA_NPC_Irwin_Prey_Burt_Charge_RidingHelper_C
/// Size: 0x0038 (0x000B60 - 0x000B98)
class UGA_NPC_Irwin_Prey_Burt_Charge_RidingHelper_C : public UFortGameplayAbility
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0B60   (0x0008)  
	class UControllableRidableComponent*               ControllableRidableComponent_Cached;                        // 0x0B68   (0x0008)  
	class AFortAIPawn*                                 FortAIPawnCached;                                           // 0x0B70   (0x0008)  
	double                                             InitialMaxAcceleration;                                     // 0x0B78   (0x0008)  
	double                                             MaxRotationRateYaw;                                         // 0x0B80   (0x0008)  
	FGameplayTag                                       GCN_BoostTag;                                               // 0x0B88   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0B8C   (0x0004)  MISSED
	class UFortGameplayAbility*                        TargetAbilityCached;                                        // 0x0B90   (0x0008)  


	/// Functions
	// Function /RidingContent/Abilities/Irwin/GA_NPC_Irwin_Prey_Burt_Charge_RidingHelper.GA_NPC_Irwin_Prey_Burt_Charge_RidingHelper_C.K2_ActivateAbilityFromEvent
	// void K2_ActivateAbilityFromEvent(FGameplayEventData& EventData);                                                      // [0x130d900] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /RidingContent/Abilities/Irwin/GA_NPC_Irwin_Prey_Burt_Charge_RidingHelper.GA_NPC_Irwin_Prey_Burt_Charge_RidingHelper_C.ExecuteUbergraph_GA_NPC_Irwin_Prey_Burt_Charge_RidingHelper
	// void ExecuteUbergraph_GA_NPC_Irwin_Prey_Burt_Charge_RidingHelper(int32_t EntryPoint);                                 // [0x130d900] Final|HasDefaults    
};

/// Class /RidingContent/Abilities/Base/GE_Riding_Creature_EnergyCritical_Base.GE_Riding_Creature_EnergyCritical_Base_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_Riding_Creature_EnergyCritical_Base_C : public UGameplayEffect
{ 
public:
};

/// Class /RidingContent/Abilities/Irwin/GE_Riding_Creature_BlockAttackOnDismount.GE_Riding_Creature_BlockAttackOnDismount_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_Riding_Creature_BlockAttackOnDismount_C : public UGameplayEffect
{ 
public:
};

/// Class /RidingContent/Abilities/Base/GE_Riding_Creature_EnergyWarning_Base.GE_Riding_Creature_EnergyWarning_Base_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_Riding_Creature_EnergyWarning_Base_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C
/// Size: 0x0340 (0x000B60 - 0x000EA0)
class UGA_NPC_Parent_C : public UFortGameplayAbility
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0B60   (0x0008)  
	class AFortAIPawn*                                 NPC_ActivatingFortAIPawn;                                   // 0x0B68   (0x0008)  
	SDK_UNDEFINED(1,11254) /* TEnumAsByte<EFortMovementUrgency> */ __um(NPC_InitialMovementUrgency);               // 0x0B70   (0x0001)  
	bool                                               NPC_DebugAbility;                                           // 0x0B71   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x0B72   (0x0006)  MISSED
	FGameplayTagContainer                              NPC_IgnoreDamageAndOnlyDoKnockbackIfTheseAbilitiesAreActive; // 0x0B78   (0x0020)  
	bool                                               NPC_DebugFreezeFrameEnabled;                                // 0x0B98   (0x0001)  
	bool                                               NPC_DebugFreezeFrameOnlyWhenAbilityTargetHit;               // 0x0B99   (0x0001)  
	bool                                               NPC_DebugFreezeFrameOnlyWhenWeHaveSomeTarget;               // 0x0B9A   (0x0001)  
	bool                                               NPC_DamageHitAbilityTargetDuringThisAbilityActivation;      // 0x0B9B   (0x0001)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0B9C   (0x0004)  MISSED
	TArray<class AActor*>                              NPC_DamageActorsWeHaveHitDuringThisAbilityActivation;       // 0x0BA0   (0x0010)  
	bool                                               NPC_CanActivateAbility_AbilityTargetTeamAffiliationCanBeNeutral; // 0x0BB0   (0x0001)  
	bool                                               NPC_CanActivateAbility_AbilityTargetTeamAffiliationCanBeFriendly; // 0x0BB1   (0x0001)  
	bool                                               NPC_CanActivateAbility_AbilityTargetTeamAffiliationCanBeHostile; // 0x0BB2   (0x0001)  
	unsigned char                                      UnknownData02_5[0x5];                                       // 0x0BB3   (0x0005)  MISSED
	double                                             NPC_CanActivateAbility_MaxTargetZDistanceBelow;             // 0x0BB8   (0x0008)  
	double                                             NPC_CanActivateAbility_MaxTargetZDistanceAbove;             // 0x0BC0   (0x0008)  
	double                                             NPC_CanActivateAbility_MaxTargetZDistanceAbove_ForIntentionalFailedAttack; // 0x0BC8   (0x0008)  
	TArray<class AActor*>                              BuildingTargetingHitActors;                                 // 0x0BD0   (0x0010)  
	FGameplayTagContainer                              TC_NPC_FrustrationTagsToClearForGoals;                      // 0x0BE0   (0x0020)  
	SDK_UNDEFINED(1,11255) /* TEnumAsByte<Enum_NPC_AlertLevel> */ __um(NPC_AlertLevelGoalIsFortPawn);              // 0x0C00   (0x0001)  
	SDK_UNDEFINED(1,11256) /* TEnumAsByte<Enum_NPC_AlertLevel> */ __um(NPC_AlertLevelGoalIsOther);                 // 0x0C01   (0x0001)  
	SDK_UNDEFINED(1,11257) /* TEnumAsByte<Enum_NPC_AlertLevel> */ __um(NPC_AlertLevelGoalIsNotValid);              // 0x0C02   (0x0001)  
	unsigned char                                      UnknownData03_5[0x5];                                       // 0x0C03   (0x0005)  MISSED
	FScalableFloat                                     NPC_DamageKnockbackVelocityHF;                              // 0x0C08   (0x0028)  
	FScalableFloat                                     NPC_DamageKnockbackVerticalAngleHF;                         // 0x0C30   (0x0028)  
	FScalableFloat                                     NPC_DamageKnockbackMinimumYawValueHF;                       // 0x0C58   (0x0028)  
	FScalableFloat                                     NPC_DamageCanAttackDBNOPlayersHF;                           // 0x0C80   (0x0028)  
	FScalableFloat                                     NPC_DamageKnockbackVelocityVehicleHF;                       // 0x0CA8   (0x0028)  
	FScalableFloat                                     NPC_DamageKnockbackVerticalAngleVehicleHF;                  // 0x0CD0   (0x0028)  
	FScalableFloat                                     NPC_DamageKnockbackMinimumYawValueVehicleHF;                // 0x0CF8   (0x0028)  
	FScalableFloat                                     NPC_DamageChanceToEjectFromVehicleHF;                       // 0x0D20   (0x0028)  
	FGameplayTag                                       DestroyBuildingGC;                                          // 0x0D48   (0x0004)  
	unsigned char                                      UnknownData04_5[0x4];                                       // 0x0D4C   (0x0004)  MISSED
	class UClass*                                      DestroyBuildingGE;                                          // 0x0D50   (0x0008)  
	FGameplayTagContainer                              TC_NPC_FrustrationTagsToClearForMovement;                   // 0x0D58   (0x0020)  
	FGameplayTag                                       TC_NPC_FrustrationBuildDueToGoal;                           // 0x0D78   (0x0004)  
	FGameplayTag                                       TC_NPC_FrustrationBuildDueToMovement;                       // 0x0D7C   (0x0004)  
	FGameplayTagQuery                                  TQ_NPC_RequirementsToBuildFrustrationDueToGoal;             // 0x0D80   (0x0048)  
	FGameplayTagQuery                                  TQ_NPC_RequirementsToBuildFrustrationDueToMovement;         // 0x0DC8   (0x0048)  
	FScalableFloat                                     NPC_BodyBumpBuildingsWhenBuildingMovementFrustrationHF;     // 0x0E10   (0x0028)  
	FScalableFloat                                     NPC_FrustrationBodyBumpOnlyDestroyPlayerBuildingsHF;        // 0x0E38   (0x0028)  
	FGameplayTag                                       TC_NPC_EffectContainer_BodyBumpBuildingsWhenBuildingMovementFrustration; // 0x0E60   (0x0004)  
	unsigned char                                      UnknownData05_5[0x4];                                       // 0x0E64   (0x0004)  MISSED
	FGameplayAbilityTargetDataHandle                   BuildingTargetingTargetData;                                // 0x0E68   (0x0028)  
	FGameplayTag                                       BuildingTargetingApplicationTag;                            // 0x0E90   (0x0004)  
	FGameplayTag                                       TC_BuildingTypePlayer;                                      // 0x0E94   (0x0004)  
	class UClass*                                      GE_NPC_MMR_Scaling_AbilityCooldown;                         // 0x0E98   (0x0008)  


	/// Functions
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC Validate Can Knockback Pawn
	// bool NPC Validate Can Knockback Pawn(bool HitWasVehicle);                                                             // [0x130d900] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.FilterHitActors
	// void FilterHitActors(TArray<AActor*>& HitActors);                                                                     // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC ResetRotationRate
	// void NPC ResetRotationRate();                                                                                         // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC OverrideRotationRate
	// void NPC OverrideRotationRate(FScalableFloat RotationRate);                                                           // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC GetGoalActor
	// class UObject* NPC GetGoalActor();                                                                                    // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC AbilityTargetIsBuildingWeAreDestroyingToNavigate
	// void NPC AbilityTargetIsBuildingWeAreDestroyingToNavigate(bool& IsNavigationBuildingWeAreDestroying, class ABuildingActor*& BuildingWeAreDestroying, double& HealthOfBuildingWeAreDestroying); // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC ApplyGameplayEffectWithMMRScaling
	// void NPC ApplyGameplayEffectWithMMRScaling(class UClass* GameplayEffectClass, class AActor* Actor);                   // [0x130d900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC ApplyGameplayAbilityCooldownWithMMRScaling
	// void NPC ApplyGameplayAbilityCooldownWithMMRScaling();                                                                // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC ScalableFloatIsValid
	// void NPC ScalableFloatIsValid(FScalableFloat& ScalableFloat, bool& Valid);                                            // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC GetScalableFloatHotfixValue
	// void NPC GetScalableFloatHotfixValue(FScalableFloat ScalableFloatHotfix, double AtLevel, bool& AsBool, int32_t& AsIntRounded, double& AsFloat); // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC SetAlertLevelByAIAbilityTargetType
	// void NPC SetAlertLevelByAIAbilityTargetType();                                                                        // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC SetAlertLevel
	// void NPC SetAlertLevel(TEnumAsByte<Enum_NPC_AlertLevel> NPC_AlertLevel, TEnumAsByte<Enum_NPC_ModifyAlertLevelReason> Reason); // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC DoIntentionalFailedAttack
	// void NPC DoIntentionalFailedAttack(bool& DoIntentionalFailedAttack);                                                  // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC AttemptBuildFrustrationDueToMovement
	// void NPC AttemptBuildFrustrationDueToMovement(FString Reason);                                                        // [0x130d900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC AttemptBuildFrustrationDueToGoal
	// void NPC AttemptBuildFrustrationDueToGoal(FString Reason);                                                            // [0x130d900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC ClearFrustrationTagsForMovement
	// void NPC ClearFrustrationTagsForMovement(FString Reason);                                                             // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC ClearFrustrationTagsForGoals
	// void NPC ClearFrustrationTagsForGoals(FString Reason);                                                                // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.DestroyBuilding
	// void DestroyBuilding(class AActor* BuildingActor);                                                                    // [0x130d900] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC GenerateLaunchVelocityWithMinimumAngle
	// void NPC GenerateLaunchVelocityWithMinimumAngle(class AActor* ActorWeWantToLaunch, bool Vehicle, FVector& LaunchVelocity, class AActor*& LaunchActor, bool& LaunchingVehicle); // [0x130d900] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.K2_CanActivateAbility
	// bool K2_CanActivateAbility(FGameplayAbilityActorInfo ActorInfo, FGameplayAbilitySpecHandle Handle, FGameplayTagContainer& RelevantTags); // [0x130d900] Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC TryResetMovementUrgency
	// void NPC TryResetMovementUrgency();                                                                                   // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC TrySetMovementUrgency
	// void NPC TrySetMovementUrgency(TEnumAsByte<EFortMovementUrgency> MovementUrgency, bool TryResetUrgencyIfInvalid);     // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC EQS Results
	// void NPC EQS Results(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, TEnumAsByte<EEnvQueryStatus> QueryStatus, TEnumAsByte<EEnvQueryRunMode> EQS RunMode, bool NumReturnedItemsIsImportant, TArray<AActor*>& ResultActors, int32_t& NumValidActorsGenerated, bool& ResultActorsSuccess, TArray<FVector>& ResultLocations, int32_t& NumValidLocationsGenerated, bool& ResultLocationsSuccess, class UEnvQueryInstanceBlueprintWrapper*& QueryInstanceOut, TEnumAsByte<EEnvQueryStatus>& QueryStatusOut); // [0x130d900] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC DebugFreezeFrame
	// void NPC DebugFreezeFrame(bool ForceDebugFreezeFrame, bool HitAbilityTargetRightNow, bool HitAbilityTargetDuringThisAbilityActivation, TArray<AActor*>& ActorsWeHaveHitDuringThisAbilityActivation, TArray<AActor*>& ActorsHitWithThisSpecificTargetSelection); // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC ApplyGameplayEffectContainerAndLaunchTargets
	// void NPC ApplyGameplayEffectContainerAndLaunchTargets(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag, int32_t GameplayEffectLevel, bool AbilityTargetCanBeHitMultipleTimesByThisSelection, bool ForceDebugFreezeFrameForThisSpecificTargeting, bool& HitAbilityTargetRightNow, bool& HitAbilityTargetDuringThisAbilityActivation, TArray<AActor*>& ActorsWeHaveHitDuringThisAbilityActivation, TArray<AActor*>& ActorsHitWithThisSpecificTargetSelection); // [0x130d900] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC AbilityTargetIsWithinAngleThreshold
	// void NPC AbilityTargetIsWithinAngleThreshold(double AngleThreshold, bool& IsWithinAngle);                             // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC IsMontageInfoValid
	// void NPC IsMontageInfoValid(FFortGameplayAbilityMontageInfo MontageInfo, bool& IsValid?);                             // [0x130d900] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC AbilityDebugMessage
	// void NPC AbilityDebugMessage(FString String, bool OnlyWhenDebug);                                                     // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.NPC SetupAbility
	// void NPC SetupAbility();                                                                                              // [0x130d900] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.Cancelled_4BB5000E4F2C1DAB20E4FFAAA97E1368
	// void Cancelled_4BB5000E4F2C1DAB20E4FFAAA97E1368(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.Targeted_4BB5000E4F2C1DAB20E4FFAAA97E1368
	// void Targeted_4BB5000E4F2C1DAB20E4FFAAA97E1368(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.Cancelled_13B12ED64A3570FC1E117FAC4E3F7961
	// void Cancelled_13B12ED64A3570FC1E117FAC4E3F7961(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.Targeted_13B12ED64A3570FC1E117FAC4E3F7961
	// void Targeted_13B12ED64A3570FC1E117FAC4E3F7961(FGameplayAbilityTargetDataHandle& TargetData, FGameplayTag ApplicationTag); // [0x130d900] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.BeginDestroyBuildings
	// void BeginDestroyBuildings(FGameplayTag TargetSelectionApplicationTag, bool DoContinuousTargetSelection);             // [0x130d900] BlueprintCallable|BlueprintEvent 
	// Function /Game/Athena/AI/Abilities/NPC/Parents/GA_NPC_Parent.GA_NPC_Parent_C.ExecuteUbergraph_GA_NPC_Parent
	// void ExecuteUbergraph_GA_NPC_Parent(int32_t EntryPoint);                                                              // [0x130d900] Final|HasDefaults    
};

/// Class /RidingContent/Abilities/Base/GA_Riding_Creature_EnergyDepleted_Base.GA_Riding_Creature_EnergyDepleted_Base_C
/// Size: 0x0008 (0x000EA0 - 0x000EA8)
class UGA_Riding_Creature_EnergyDepleted_Base_C : public UGA_NPC_Parent_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0EA0   (0x0008)  


	/// Functions
	// Function /RidingContent/Abilities/Base/GA_Riding_Creature_EnergyDepleted_Base.GA_Riding_Creature_EnergyDepleted_Base_C.K2_ActivateAbility
	// void K2_ActivateAbility();                                                                                            // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /RidingContent/Abilities/Base/GA_Riding_Creature_EnergyDepleted_Base.GA_Riding_Creature_EnergyDepleted_Base_C.K2_OnEndAbility
	// void K2_OnEndAbility(bool bWasCancelled);                                                                             // [0x130d900] Event|Protected|BlueprintEvent 
	// Function /RidingContent/Abilities/Base/GA_Riding_Creature_EnergyDepleted_Base.GA_Riding_Creature_EnergyDepleted_Base_C.FailedToActivatePassiveAbility
	// void FailedToActivatePassiveAbility(FGameplayAbilityActorInfo ActorInfo);                                             // [0x130d900] Event|Public|BlueprintEvent 
	// Function /RidingContent/Abilities/Base/GA_Riding_Creature_EnergyDepleted_Base.GA_Riding_Creature_EnergyDepleted_Base_C.ExecuteUbergraph_GA_Riding_Creature_EnergyDepleted_Base
	// void ExecuteUbergraph_GA_Riding_Creature_EnergyDepleted_Base(int32_t EntryPoint);                                     // [0x130d900] Final|HasDefaults    
};

/// Class /RidingContent/Abilities/Irwin/GA_Riding_Creature_EnergyDepleted_Grandma.GA_Riding_Creature_EnergyDepleted_Grandma_C
/// Size: 0x0000 (0x000EA8 - 0x000EA8)
class UGA_Riding_Creature_EnergyDepleted_Grandma_C : public UGA_Riding_Creature_EnergyDepleted_Base_C
{ 
public:
};

/// Class /RidingContent/Abilities/Irwin/GE_Riding_Creature_EnergyDepleted_Grandma.GE_Riding_Creature_EnergyDepleted_Grandma_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_Riding_Creature_EnergyDepleted_Grandma_C : public UGameplayEffect
{ 
public:
};

/// Class /RidingContent/Abilities/Irwin/GA_Riding_Creature_EnergyDepleted_Burt.GA_Riding_Creature_EnergyDepleted_Burt_C
/// Size: 0x0000 (0x000EA8 - 0x000EA8)
class UGA_Riding_Creature_EnergyDepleted_Burt_C : public UGA_Riding_Creature_EnergyDepleted_Base_C
{ 
public:
};

/// Class /RidingContent/Abilities/Irwin/GE_Riding_Creature_EnergyDepleted_Burt.GE_Riding_Creature_EnergyDepleted_Burt_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_Riding_Creature_EnergyDepleted_Burt_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Athena/HUD/Bacchus/CustomizableHUD/MobileHUDPresets.MobileHUDPresets_C
/// Size: 0x0000 (0x000040 - 0x000040)
class UMobileHUDPresets_C : public UFortMobileHUDPresetContainer
{ 
public:
};

/// Class /Game/Athena/HUD/Bacchus/CustomizableHUD/MobileHUDPresetsInDevelopment.MobileHUDPresetsInDevelopment_C
/// Size: 0x0000 (0x000040 - 0x000040)
class UMobileHUDPresetsInDevelopment_C : public UFortMobileHUDPresetContainer
{ 
public:
};

/// Class /Game/Athena/AI/MANG/Abilities/GE_NPC_Status_Stressed_Cooldown.GE_NPC_Status_Stressed_Cooldown_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_NPC_Status_Stressed_Cooldown_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Athena/AI/Phoebe/NavFilter/NavFilter_Phoebe.NavFilter_Phoebe_C
/// Size: 0x0000 (0x000048 - 0x000048)
class UNavFilter_Phoebe_C : public UNavigationQueryFilter
{ 
public:
};

/// Class /Game/Athena/AI/NPCs/Base/GameplayEffects/GE_Patrolling.GE_Patrolling_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_Patrolling_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Athena/HUD/SimpleMaterialProgressBar.SimpleMaterialProgressBar_C
/// Size: 0x0000 (0x0003B8 - 0x0003B8)
class USimpleMaterialProgressBar_C : public UFortSimpleMaterialProgressBar
{ 
public:
};

/// Class /Game/Athena/Irwin/Characters/Parents/Abilities/TargetSlots/Melee/GE_NPC_Behavior_TargetSlots_Melee_Max.GE_NPC_Behavior_TargetSlots_Melee_Max_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_NPC_Behavior_TargetSlots_Melee_Max_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Athena/AI/NavFilters/NavFilter_NPC_AnyTraversable.NavFilter_NPC_AnyTraversable_C
/// Size: 0x0000 (0x000048 - 0x000048)
class UNavFilter_NPC_AnyTraversable_C : public UNavigationQueryFilter
{ 
public:
};

/// Class /Game/Athena/AI/Abilities/NPC/Parents/GE_NPC_BehaviorPhaseIntroBehaviorCooldown_60s.GE_NPC_BehaviorPhaseIntroBehaviorCooldown_60s_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_NPC_BehaviorPhaseIntroBehaviorCooldown_60s_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Athena/AI/GoalSelection/GoalComponents/GoalComponent_Default.GoalComponent_Default_C
/// Size: 0x0000 (0x000158 - 0x000158)
class UGoalComponent_Default_C : public UFortAIGoalComponent
{ 
public:
};

/// Class /Game/Athena/AI/Abilities/NPC/Parents/GE_NPC_Parent_Convert_Damage.GE_NPC_Parent_Convert_Damage_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_NPC_Parent_Convert_Damage_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Athena/Effects/Blueprints/Ash/GE_SnowFlakes_PlayerEffect.GE_SnowFlakes_PlayerEffect_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_SnowFlakes_PlayerEffect_C : public UGameplayEffect
{ 
public:
};

/// Class /Game/Athena/AI/Abilities/NPC/Parents/GE_NPC_GoalSelection_Tamed.GE_NPC_GoalSelection_Tamed_C
/// Size: 0x0000 (0x000A68 - 0x000A68)
class UGE_NPC_GoalSelection_Tamed_C : public UGameplayEffect
{ 
public:
};

